Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: Odd parity is not supported
de_de: Eine ungerade Parität wird nicht unterstützt
es: Paridad impar no soportada
fil: Odd na parity ay hindi supportado
fr: Parité impaire non supportée
nl: Oneven pariteit is niet ondersteund
pt_br: A paridade ímpar não é compatível
ru: Нечетная четность не поддерживается
sv: Udda paritet stöds inte

source: Only 8 or 16 bit mono with
es: Solo mono de 8 ó 16 bit con
fil: Tanging 8 o 16 na bit mono na may
nl: Alleen 8 of 16 bit mono met

source: Only IPv4 addresses supported
de_de: Nur IPv4-Adressen werden unterstützt
es: Solo hay capacidad para direcciones IPv4
fr: Seulement les adresses IPv4 sont supportées
nl: Alleen IPv4 adressen worden ondersteund
pt_br: Somente os endereços IPv4 são suportados
ru: Поддерживаются только адреса IPv4
sv: Endast IPv4-adresser stöds

source: Only IPv4 sockets supported
de_de: Nur IPv4-Sockets werden unterstützt
es: Solo se admiten sockets IPv4
fr: Seulement les sockets IPv4 sont supportés
nl: Alleen IPv4-sockets ondersteund
pt_br: Apenas soquetes IPv4 são suportados
ru: Поддерживаются только сокеты IPv4
sv: Endast IPv4-socket stöds

source: Only Windows format, uncompressed BMP supported: given header size is %d
de_de: Nur Windows-Format, unkomprimiertes BMP unterstützt: die gegebene Header-Größe ist %d
es: Solo formato de Windows, sin comprimir BMP soportado: tamaño de encabezado dado es %d
fr: Seulement le format BMP Windows, non compressé est supporté : la taille de l'entête fournie est %d
nl: Alleen Windows formaat en ongecomprimeerd BMP ondersteund: gegeven header grootte is %d
pt_br: O BMP descompactado é compatível apenas no formato Windows: o tamanho do cabeçalho é %d
ru: Поддерживается только формат Windows, несжатый BMP: заданный размер заголовка - %d
sv: Endast Windows-format, okomprimerad BMP stöds: given headerstorlek är %d

source: Only connectable advertisements can be directed
de_de: Es können nur verknüpfbare Ankündigungen geleitet werden
es: Solo se puede dirigir a los anuncios conectables
fr: Seuls les avertissements connectables peuvent être dirigés
pt_br: Somente anúncios conectáveis podem ser direcionados
ru: Только подключаемые объявления могут быть направлены
sv: Endast anslutningsbara annonseringar kan dirigeras

source: Only edge detection is available on this hardware
de_de: Nur Edge Detection ist für diese Hardware verfügbar
es: Este hardware solo tiene capacidad para detección de borde
fr: Seule la détection des bords est disponible sur ce matériel
pt_br: Apenas a detecção de borda está disponível neste hardware
ru: На этом аппаратном обеспечении доступно только обнаружение края
sv: Endast kantdetektering är tillgänglig för denna hårdvara

source: Only int or string supported for ip
de_de: Nur Int oder String werden unterstützt für IP
es: Solamente int or string son permitados para una ip
fr: Seulement les int et string sont supportés pour une adresse IP
pt_br: Apenas int ou string é suportado para ip
ru: Для IP поддерживаются только int или строка
sv: Endast int eller string stöds för ip

source: Only monochrome, indexed 4bpp or 8bpp, and 16bpp or greater BMPs supported: %d bpp given
de_de: Nur monochrome, indizierte 4bpp oder 8bpp, und 16bpp oder größere BMPs unterstützt: %d bpp wurden gegeben
es: Solo se admiten BMP monocromáticos, indexados de 4 bpp u 8 bpp y 16 bpp o más: %d bpp proporcionados
fr: Seulement les BMP monochromes, 4 bpp ou 8 bpp, ou 16 bpp et plus sont supportés: %d bpp fournis
nl: Alleen monochrome en 4bpp of 8bpp, en 16bpp of grotere geïndiceerde BMP's zijn ondersteund: %d bpp is gegeven
pt_br: São compatíveis apenas os BMPs monocromáticos, indexados em 4bpp ou 8bpp e 16bpp ou superior: determinado %d bpp
ru: Только монохром, индексированный 4bpp или 8bpp, и 16bpp или больше BMP поддерживаются: %d bpp
sv: Endast monokrom, indexerad 4 bpp eller 8 bpp och 16 bpp eller högre BMP: er stöds: %d bpp angiven

source: Only one TouchAlarm can be set in deep sleep.
es: Solamente una TouchAlarm puede ser configurada durante deep sleep.

source: Only one alarm.time alarm can be set.
de_de: Nur eine alarm-time kann gesetzt werden.
es: Solamente una alarm.time puede ser configurada.
fr: Seulement une alarme alarm.time peut être réglée.
nl: Slechts één alarm.time alarm kan worden ingesteld.
pt_br: Apenas um alarme alarm.time pode ser definido.
ru: Можно установить только один будильник alarm.time.
sv: Endast ett alarm.time kan ställas in.

source: Only one color can be transparent at a time
de_de: Nur eine Farbe kann transparent sein zu einer Zeit
es: Solo un color puede ser transparente a la vez
fr: Une seule couleur peut être transparente à la fois
nl: Er kan maar één kleur per keer transparant zijn
pt_br: Apenas uma cor pode ser transparente de cada vez
ru: Только один цвет может быть прозрачным одновременно
sv: Bara en färg kan vara genomskinlig i taget

source: Operation or feature not supported
de_de: Vorgang oder Funktion wird nicht unterstützt
es: Operación no característica no soportada
fr: Opération ou fonction non supportée
pt_br: A operação ou o recurso não é suportado
ru: Операция или функция, не поддерживаемые
sv: Operation eller funktion stöds inte

source: Operation timed out
de_de: Zeit für Vorgang abgelaufen
es: Tiempo de espera agotado
fr: Timeout de l'opération
pt_br: A operação expirou
ru: Истекло время ожидания операции
sv: Åtgärden orsakade timeout

source: Out of memory
de_de: Kein Speicher mehr verfügbar
es: Memoria agotada
fr: Mémoire insuffisante
pt_br: Sem memória
ru: Не хватает памяти
sv: Slut på minne

source: Out of sockets
de_de: Keine Sockets mehr verfügbar
es: Se acabaron los enchufes
fr: Plus de sockets
nl: Geen sockets meer beschikbaar
pt_br: Sem soquetes
ru: Вне розеток
sv: Slut på sockets

source: Out-buffer elements must be <= 4 bytes long
de_de: Out-Buffer-Elemente müssen <= 4 bytes lang sein
es: Los elementos del búfer de salida deben ser de una longitud <= 4 bytes
fr: Éléments du tampon de sortie doivent être <= à 4 octets
pt_br: Os elementos Out-buffer devem ter um comprimento de <= 4 bytes
ru: Элементы вне буфера должны иметь длину <= 4 байта
sv: Element i utbuffer måste vara <= 4 byte långa

source: Output buffer must be at least %d bytes
es: buffer de salida debe ser de por lo menos %d bytes

source: Oversample must be multiple of 8.
es: El sobremuestreo debe ser un múltiplo de 8.
fil: Oversample ay dapat multiple ng 8.
it_it: L'oversampling deve essere multiplo di 8.
nl: Oversample moet een meervoud van 8 zijn.
pt_br: A superamostragem deve ser um múltiplo de 8.

source: PDMIn not available
es: PDMIn no esta disponible

source: PWM duty_cycle must be between 0 and 65535 inclusive (16 bit resolution)
es: PWM duty_cycle debe ser entre 0 y 65535 inclusivo (16 bit resolution)
fil: PWM duty_cycle ay dapat sa loob ng 0 at 65535 (16 bit resolution)
it_it: duty_cycle del PWM deve essere compresa tra 0 e 65535 inclusiva (risoluzione a 16 bit)
nl: PWM duty_cycle moet tussen 0 en 65535 inclusief zijn (16 bit resolutie)

source: PWM frequency not writable when variable_frequency is False on construction.
es: La frecuencia de PWM no se puede escribir variable_frequency es False en la construcción.
fil: PWM frequency hindi writable kapag variable_frequency ay False sa pag buo.
nl: PWM frequentie is niet schrijfbaar wanneer de variable_frequency False is tijdens constructie.
pt_br: A frequência do PWM não pode ser gravada quando variable_frequency for False na construção.

source: PWM slice already in use
de_de: PWM-Stück wird bereits verwendet
es: Segmento PWM ya esta en uso
fr: PWM slice déja utilisée
pt_br: A fatia do PWM já está em uso
ru: PWM уже используется
sv: PWM-segment används redan

source: PWM slice channel A already in use
de_de: PWM-Stück-Kanal A wird bereits verwendet
es: Segmento del PWM canal A ya esta en uso
fr: Canal A de PWM slice est utilisé
pt_br: O canal A da fatia do PWM já está em uso
ru: PWM канал среза A уже используется
sv: PWM-segmentkanal A används redan

source: ParallelBus not yet supported
es: ParallelBus todavía no soportado
nl: ParallelBus nog niet ondersteund

source: Peripheral in use
de_de: Peripheriegerät wird bereits verwendet
es: Periférico en uso
fr: Périphérique en utilisation
pt_br: O periférico está em uso
ru: Периферийные устройства в использовании
sv: Periferi i bruk

source: Permission denied
de_de: Zugriff verweigert
es: Permiso denegado
fil: Walang pahintulot
fr: Permission refusée
it_it: Permesso negato
nl: Toegang geweigerd
pt_br: Permissão negada
ru: Отказано в разрешении
sv: Åtkomst nekad

source: Pin cannot wake from Deep Sleep
de_de: Pin kann nicht aus Deep Sleep aufwachen
es: El Pin no se puede despertar de un sueño profundo
fr: La broche ne peut être réveillée depuis un sommeil profond
pt_br: O pino não pode acordar do deep sleep
ru: Пин не может вывести из глубокого сна
sv: Pinnen kan inte väcka från djup sömn

source: Pin count must be at least 1
es: El total de pines debe ser por lo menos 1

source: Pin count too large
de_de: Pin-Anzahl zu gross
es: Total de pines demasiado grande
fr: Nombre de broches trop élevé
pt_br: A contagem dos pinos é muito grande
ru: Слишком большое количество пинов
sv: Antal pinnar för stort

source: Pin does not have ADC capabilities
es: Pin no tiene capacidad ADC
fil: Ang pin ay walang kakayahan sa ADC
it_it: Il pin non ha capacità di ADC
nl: Pin heeft geen ADC mogelijkheden

source: Pin interrupt already in use
de_de: Pin-Interrupt wird bereits verwendet
es: Interrupción de Pin ya está en uso
fr: L'interruption de cette broche est déjà utilisée
pt_br: A interrupção do pino já está em uso
ru: Прерывание пина уже используется
sv: Pinnavbrott används redan

source: Pin is input only
de_de: Pin kann nur als Eingang verwendet werden
es: El pin es solo de entrada
fr: La broche est entrée uniquement
nl: Pin kan alleen voor invoer gebruikt worden
pt_br: Apenas o pino de entrada
ru: Пин является только входом
sv: Pinnen är enbart ingång

source: Pin must be on PWM Channel B
de_de: Pin muss auf PWM-Kanal B sein
es: El pin debe estar en el PWM canal B
fr: La broche doit être sur le canal B du PWM
pt_br: O pino deve estar no canal B do PWM
ru: Пин должен быть на канале ШИМ B
sv: Pinne måste vara på PWM-kanal B

source: Pin must support hardware interrupts
es: El pin debe admitir interrupciones de hardware
nl: Pin moet hardware interrupts ondersteunen
pt_br: O pino deve ser compatível com as interrupções do hardware

source: Pinout uses %d bytes per element, which consumes more than the ideal %d bytes. If this cannot be avoided, pass allow_inefficient=True to the constructor
de_de: Pinbelegung verwendet %d Bytes pro Element, was mehr als die idealen %d Bytes verbraucht. Wenn dies nicht vermieden werden kann, übergib allow_inefficient=True an den Konstruktor
es: El pinout utiliza %d bytes por elemento, lo que consume más de los %d bytes ideales. Si esto no se puede evitar, pase allow_inefficient=True al constructor
fr: Le brochage utilise %d octets par élément, ce qui consomme plus que le %d octets idéal. Si cela ne peut pas être évité, transmettez allow_inefficient = True au constructeur
nl: Pinout gebruikt %d bytes per element, welke meer dan de ideale %d bytes gebruikt. Als dit niet kan worden vermeden, geef dan het argument allow_inefficient=True aan de constructor
pt_br: A pinagem utiliza %d bytes por elemento, que consome mais do que %d bytes do ideal. Caso isso não possa ser evitado, passe allow_inefficient=True ao construtor
ru: Распиновка использует %d байт на элемент, что превышает идеальное %d байт. Если этого нельзя избежать, передайте конструктору allow_inefficient=True
sv: Pinout använder %d byte per element, vilket förbrukar mer än det idealiska %d byte. Om detta inte kan undvikas, skicka allow_inefficient=True till konstruktorn

source: Pins must be sequential
de_de: Pins müssen geordnet sein
es: Los pines deben estar en orden secuencial
fr: Les broches doivent être séquentielles
pt_br: Os pinos devem ser sequenciais
ru: Пины должны быть последовательными
sv: Pinnarna måste vara i sekvens

source: Pins must share PWM slice
de_de: Pins muss ein geteiltes PWM-Stück sein
es: Los pines deben compartir la división PWM
fr: Les broches doivent partager la tranche PWM
pt_br: Os pinos devem compartilhar a fatia do PWM
ru: Пины должны иметь общий срез PWM
sv: Pinnar måste dela PWM-segment

source: Plus any modules on the filesystem
de_de: und alle Module im Dateisystem
es: Además de cualquier módulo en el sistema de archivos
fil: Kasama ang kung ano pang modules na sa filesystem
fr: Ainsi que tout autres modules présents sur le système de fichiers
nl: En iedere module in het bestandssysteem
pt_br: Além de quaisquer módulos no sistema de arquivos
ru: Плюс любые модули в файловой системе
sv: Plus eventuella moduler i filsystemet

source: Polygon needs at least 3 points
de_de: Polygone brauchen mindestens 3 Punkte
es: El polígono necesita al menos 3 puntos
fr: Polygon a besoin d'au moins 3 points
nl: Polygon heeft op zijn minst 3 punten nodig
pt_br: O Polígono precisa de pelo menos 3 pontos
ru: Полигону необходимо как минимум 3 точки
sv: Polygonen behöver minst 3 punkter

source: Port does not accept PWM carrier. Pass a pin, frequency and duty cycle instead
es: Port no acepta un carrier de PWM. Pase en cambio un pin, una frecuencia o un ciclo de actividad
nl: Poort ondersteund geen PWM drager. Geef een pin, frequentie en inschakeltijd op

source: Port does not accept pins or frequency. Construct and pass a PWMOut Carrier instead
es: Port no acepta los pines o la frecuencia. Construya y pase en su lugar un Carrier de PWMOut
nl: Poort accepteert geen pin of frequentie. Stel een PWMOut Carrier samen en geef die op

source: Prefix buffer must be on the heap
de_de: Präfix-Puffer muss sich auf dem Heap befinden
es: El prefijo del buffer debe estar en el heap
fr: Le tampon de préfixe doit être sur la pile
nl: Prefix buffer moet op de heap zijn
pt_br: O buffer do prefixo deve estar na área de alocação dinâmica de variáveis (heap)
ru: Буфер префикса должен находиться в куче
sv: Prefixbufferten måste finnas på heap

source: Press any key to enter the REPL. Use CTRL-D to reload.
de_de: Drücke eine beliebige Taste um REPL zu betreten. Drücke STRG-D zum neuladen.
es: Presiona cualquier tecla para entrar al REPL. Usa CTRL-D para recargar.
fr: Appuyez sur n'importe quelle touche pour utiliser le REPL. Utilisez CTRL-D pour relancer.
nl: Druk een willekeurige toets om de REPL te starten. Gebruik CTRL+D om te herstarten.
pt_br: Pressione qualquer tecla para entrar no REPL. Use CTRL-D para recarregar.
ru: Нажмите любую клавишу чтобы зайти в REPL. Используйте CTRL-D для перезагрузки.
sv: Tryck på valfri tangent för att gå in i REPL. Använd CTRL-D för att ladda om.

source: Pretending to deep sleep until alarm, CTRL-C or file write.
de_de: Vortäuschen von Deep Sleep bis Alarm, Strg-C oder Schreiben in Datei.
es: Pretendiendo ir a deep sleep hasta la alarma, CTRL-C or una escritura de archivo
fr: Feinte un sommeil profond jusqu'à l'alarme, CTRL-C ou l'écriture d'un fichier.
pt_br: Tentando entrar no deep sleep até o alarme, pressione CTRL-C ou grave o arquivo.
ru: Притворяюсь глубоким сном до сигнала тревоги, CTRL-C или записи файла.
sv: Fingerar djup sömn tills larm, Ctrl-C eller filskrivning.

source: Program does IN without loading ISR
de_de: Programm macht IN ohne Laden von ISR
es: El programa hace un IN sin cargar ISR
fr: Le programme fait des entrées sans charger d'ISR
pt_br: O programa faz IN sem carregar o ISR
ru: Программа выполняет IN без загрузки ISR
sv: Program gör IN utan att ladda ISR

source: Program does OUT without loading OSR
de_de: Programm macht OUT ohne Laden von OSR
es: El programa hace OUT sin cargar OSR
fr: Le programme fait des sorties sans charger d'OSR
pt_br: O programa faz OUT sem carregar o OSR
ru: Программа выполняет ВЫХОД без загрузки OSR
sv: Program gör OUT utan att läsa in OSR

source: Program must contain at least one 16-bit instruction.
es: El programa debe contener por lo menos una instrucción de 16 bits.

source: Program size invalid
de_de: Programm-Größe ist ungültig
es: El tamaño del programa no es correcto
fr: Taille du programme invalide
pt_br: O tamanho do programa é inválido
ru: Недопустимый размер программы
sv: Programstorlek ogiltig

source: Program too large
es: Programa demasiado grande

source: Pull not used when direction is output.
de_de: Pull wird nicht verwendet, wenn die Richtung output ist.
es: Pull no se usa cuando la dirección es output.
fil: Pull hindi ginagamit kapag ang direksyon ay output.
fr: Le tirage 'pull' n'est pas utilisé quand la direction est 'output'.
nl: Pull niet gebruikt wanneer de richting output is.
pt_br: O Pull não foi usado quando a direção for gerada.
ru: Тяга не используется, когда выводится направление.
sv: Pull används inte när riktningen är output.

source: RAISE mode is not implemented
es: El modo RAISE no esta implementado

source: RNG DeInit Error
de_de: RNG DeInit-Fehler
es: Error de desinicialización de RNG
fr: Erreur de désinitialisation du RNG
nl: RNG DeInit Fout
pt_br: Erro DeInit RNG
ru: Ошибка деинициализации генератора случайных чисел
sv: RNG DeInit-fel

source: RNG Init Error
de_de: RNG-Init-Fehler
es: Error de inicialización de RNG
fr: Erreur d'initialisation du RNG
nl: RNG Init Fout
pt_br: Houve um erro na inicialização do RNG
ru: Ошибка инициализации RNG
sv: RNG Init-fel

source: RS485 Not yet supported on this device
es: RS485 no esta soportado todavía en este dispositivo

source: RS485 inversion specified when not in RS485 mode
de_de: RS485-Inversion angegeben, wenn nicht im RS485-Modus
es: Se especifica inversión de RS485 si no está en modo RS485
fr: Inversion RS485 spécifiée sans être en mode RS485
nl: RS485 inversie gespecificeerd terwijl niet in RS485 modus
pt_br: A definição da inversão do RS485 quando não está no modo RS485
ru: Инверсия RS485 указана, когда она не находится в режиме RS485
sv: RS485-inversion specificerad när den inte är i RS485-läge

source: RTC calibration is not supported on this board
es: Calibración de RTC no es soportada en esta placa
fil: RTC calibration ay hindi supportado ng board na ito
it_it: calibrazione RTC non supportata su questa scheda
nl: RTC calibratie niet ondersteund door dit board

source: RTC is not supported on this board
de_de: Eine RTC wird auf diesem Board nicht unterstützt
es: RTC no soportado en esta placa
fil: Hindi supportado ang RTC sa board na ito
fr: RTC non supporté sur cette carte
it_it: RTC non supportato su questa scheda
nl: RTC is niet ondersteund door dit board
pt_br: O RTC não é suportado nesta placa
ru: RTC не поддерживается на этой плате
sv: RTC stöds inte av detta kort

source: RTS/CTS/RS485 Not yet supported on this device
es: Sin capacidad de RTS/CTS/RS485 para este dispositivo
nl: RTS/CTS/RS485 Nog niet ondersteund door dit apparaat

source: Random number generation error
de_de: Fehler bei der Erzeugung von Zufallszahlen
es: Error de generación de números aleatorios
fr: Erreur de génération de chiffres aléatoires
nl: Random number generatie fout
pt_br: Houve um erro na geração do número aleatório
ru: Ошибка генерации случайных чисел
sv: Fel vid generering av slumptal

source: Read-only
de_de: Nur lesen möglich, da Schreibgeschützt
es: Solo-lectura
fil: Basahin-lamang
fr: Lecture seule
it_it: Sola lettura
nl: Alleen-lezen
pt_br: Somente leitura
ru: Только для чтения
sv: Skrivskyddad

source: Read-only filesystem
de_de: Schreibgeschützte Dateisystem
es: Sistema de archivos de solo-Lectura
fil: Basahin-lamang mode
fr: Système de fichier en lecture seule
it_it: Filesystem in sola lettura
nl: Alleen-lezen bestandssysteem
pt_br: Sistema de arquivos somente leitura
ru: Файловая система только для чтения
sv: Skrivskyddat filsystem

source: Read-only object
es: Objeto de solo-lectura
nl: Alleen-lezen object

source: Received response was invalid
de_de: Erhaltene Antwort ist ungültig
es: La respuesta recibida es invalida
fr: Réponse reçue invalide
pt_br: A resposta recebida foi inválida
ru: Полученный ответ недействителен
sv: Mottaget svar var ogiltigt

source: Refresh too soon
de_de: Zu früh neu geladen
es: Refresco demasiado pronto
fr: Rafraîchissement trop tôt
nl: Verversing te snel
pt_br: A recarga foi cedo demais
ru: Слишком раннее обновление
sv: Uppdaterad för tidigt

source: RemoteTransmissionRequests limited to 8 bytes
de_de: RemoteTransmissionRequests limitiert auf 8 Bytes
es: RemoteTransmissionRequests limitado a 8 bytes
fr: RemoteTransmissionRequests limité à 8 octets
nl: RemoteTransmissionRequests is beperkt tot 8 bytes
pt_br: As requisições de transmissões remotas é limitada a 8 bytes
ru: Запросы на удаленную передачу ограничены 8 байтами
sv: RemoteTransmissionRequests begränsad till 8 byte

source: Requested AES mode is unsupported
de_de: Der angeforderte AES-Modus wird nicht unterstützt
es: El modo AES solicitado no es compatible
fr: Le mode AES demandé n'est pas supporté
nl: Gevraagde AES modus is niet ondersteund
pt_br: O modo AES solicitado não é compatível
ru: Запрошенный режим AES не поддерживается
sv: Det begärda AES-läget stöds inte

source: Requested resource not found
de_de: Angefragte Ressource nicht gefunden
es: Recurso solicitado no encontrado
fr: Resource demandée non trouvée
pt_br: O recurso solicitado não foi encontrado
ru: Запрошенный ресурс не найден
sv: Begärd resurs hittades inte

source: Right channel unsupported
de_de: Rechter Kanal wird nicht unterstützt
es: Canal derecho no soportado
fil: Hindi supportado ang kanang channel
fr: Canal droit non supporté
it_it: Canale destro non supportato
nl: Rechter kanaal niet ondersteund
pt_br: Canal direito não suportado
ru: Правый канал не поддерживается
sv: Höger kanal stöds inte

source: Row entry must be digitalio.DigitalInOut
es: La entrada de la fila debe ser digitalio.DigitalInOut
nl: Rij invoeging moet digitalio.DigitalInOut zijn

source: Running in safe mode! Not running saved code.
de_de: Sicherheitsmodus aktiv! Gespeicherter Code wird nicht ausgeführt
es: ¡Ejecutando en modo seguro! No se esta ejecutando el código almacenado.
fil: Tumatakbo sa safe mode! Hindi tumatakbo ang nai-save na code.
fr: Mode sans-échec ! Le code sauvegardé n'est pas éxecuté.
it_it: Modalità sicura in esecuzione! Codice salvato non in esecuzione.
nl: Draaiende in veilige modus! Opgeslagen code wordt niet uitgevoerd.
pt_br: Rodando em modo seguro! O código salvo não está em execução.
ru: Работает в безопасном режиме! Сохраненный код не выполняется.
sv: Kör i säkert läge! Sparad kod körs inte.

source: SD card CSD format not supported
de_de: SD-Card CSD-Format nicht unterstützt
es: Sin capacidad para formato CSD para tarjeta SD
fr: Le format de carte SD CSD n'est pas supporté
nl: SD kaart CSD formaat niet ondersteund
pt_br: O formato CSD do Cartão SD não é compatível
ru: Формат CSD SD-карты не поддерживается
sv: SD-kort CSD-format stöds inte

source: SDIO GetCardInfo Error %d
de_de: SDIO GetCardInfo-Fehler %d
es: Error SDIO GetCardInfo %d
fr: Erreur de SDIO GetCardInfo %d
nl: SDIO GetCardInfo Fout %d
pt_br: Erro SDIO GetCardInfo %d
ru: Ошибка получения информации о карте SDIO %d
sv: SDIO GetCardInfo-fel %d

source: SDIO Init Error %d
de_de: SDIO-Init-Fehler %d
es: Error de iniciado de SDIO %d
fr: Erreur d'initialisation SDIO %d
nl: SDIO Init Fout %d
pt_br: Erro SDIO Init %d
ru: Ошибка инициализации SDIO %d
sv: SDIO Init-fel %d

source: SPI Init Error
es: Error de inicio de SPI
nl: SPI Init Fout

source: SPI Re-initialization error
es: Error de reinicialización de SPI
nl: SPI Herinitialisatie Fout

source: SPI configuration failed
de_de: SPI-Konfiguration fehlgeschlagen
es: Configuración de SPI fallida
fr: La configuration SPI a échoué
pt_br: A configuração SPI falhou
ru: Сбой конфигурации SPI
sv: SPI-konfigurationen misslyckades
