Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: SPI peripheral in use
de_de: SPI-Peripheriegeräte wird bereits verwendet
es: Periférico SPI en uso
fr: Périphérique SPI utilisé
pt_br: O periférico SPI está em uso
ru: Используемое периферийное устройство SPI
sv: SPI-enhet används redan

source: Sample rate must be positive
es: Sample rate debe ser positivo
fil: Sample rate ay dapat positibo
nl: Sample rate moet positief zijn

source: Sample rate too high. It must be less than %d
es: Frecuencia de muestreo demasiado alta. Debe ser menor a %d
fil: Sample rate ay masyadong mataas. Ito ay dapat hindi hiigit sa %d
it_it: Frequenza di campionamento troppo alta. Il valore deve essere inferiore a %d
nl: Sample rate is te hoog. Moet minder dan %d zijn

source: Scan already in progess. Stop with stop_scan.
es: Escaneo en progreso. Usa stop_scan para detener.
nl: Scan wordt al uitvoerd. Stop met stop_scan.

source: Serializer in use
de_de: Serializer wird benutzt
es: Serializer está siendo utilizado
fil: Serializer ginagamit
fr: Sérialiseur en cours d'utilisation
it_it: Serializer in uso
nl: Serializer in gebruik
pt_br: Serializer em uso
ru: Сериализатор используется
sv: Serializern används redan

source: Server side context cannot have hostname
de_de: Serverseitiger Kontext kann keinen Hostnamen haben
es: El contexto del lado del servidor no puede tener un hostname
fr: Un contexte niveau serveur ne peut avoir de hostname
nl: Context aan de serverkant kan geen hostnaam hebben
pt_br: O contexto do lado do servidor não pode ter nome de host
ru: Контекст на стороне сервера не может иметь имя хоста
sv: Serversidans kontext kan inte ha värdnamn

source: Set pin count must be between 1 and 5
es: La suma de pines configurados debe estar entre 1 y 5

source: Side set pin count must be between 1 and 5
es: El conteo de pines de Side set debe estar entre 1 y 5

source: Size not supported
de_de: Größe nicht unterstützt
es: Sin capacidades para el tamaño
fr: Taille n'est pas supportée
nl: Afmeting niet ondersteund
pt_br: O tamanho não é suportado
ru: Размер не поддерживается
sv: Storleken stöds inte

source: Sleep Memory not available
es: Memoria de sueño no disponible

source: Slice and value different lengths.
de_de: Slice und Wert (value) haben unterschiedliche Längen.
es: Slice y value tienen tamaños diferentes.
fil: Slice at value iba't ibang haba.
fr: Tranche et valeur de tailles différentes.
nl: Slice en waarde hebben verschillende lengtes.
pt_br: Fatie e avalie os diferentes comprimentos.
ru: Нарежьте и оцените разную длину.
sv: Slice och värde har olika längd.

source: Slices not supported
de_de: Slices werden nicht unterstützt
es: Rebanadas no soportadas
fil: Hindi suportado ang Slices
fr: Tranches non supportées
it_it: Slice non supportate
nl: Slices niet ondersteund
pt_br: Fatiamento não compatível
ru: Фрагменты не поддерживаются
sv: Slice stöds inte

source: SocketPool can only be used with wifi.radio
de_de: SocketPool kann nur mit wifi.radio verwendet werden
es: SocketPool solo se puede usar con wifi.radio
fr: SocketPool ne s'utilise qu'avec wifi.radio
nl: SocketPool kan alleen met wifi.radio gebruikt worden
pt_br: O SocketPool só pode ser usado com rádio wifi.radio
ru: SocketPool можно использовать только с wifi.radio
sv: SocketPool kan endast användas med wifi.radio

source: Source and destination buffers must be the same length
de_de: Quell- und Zielpuffer müssen gleich lang sein
es: Los buffers de fuente y destino deben ser del mismo tamaño
fr: Les tampons source et de destination doivent être de la même longueur
nl: Bron en bestemming buffers moeten dezelfde lengte hebben
pt_br: Os buffers da origem e do destino devem ter o mesmo comprimento
ru: Исходный и конечный буферы должны иметь одинаковую длину
sv: Käll- och målbuffertar måste ha samma längd

source: Splitting with sub-captures
es: Dividiendo con sub-capturas
fil: Binibiyak gamit ang sub-captures
it_it: Suddivisione con sotto-catture
nl: Splitting met sub-captures

source: Stack size must be at least 256
es: El tamaño de la pila debe ser de al menos 256
fil: Ang laki ng stack ay dapat na hindi bababa sa 256
it_it: La dimensione dello stack deve essere almeno 256
nl: Stack grootte moet op zijn minst 256 zijn

source: Stereo left must be on PWM channel A
es: Estéreo izquierdo debe estar en el canal PWM A
pt_br: O estéreo à esquerda deve estar no canal PWM A

source: Stereo right must be on PWM channel B
es: Estéreo derecho debe estar en el canal PWM B
pt_br: O estéreo à direita deve estar no canal PWM B

source: Stream missing readinto() or write() method.
es: A Stream le falta el método readinto() o write().
fil: Stream kulang ng readinto() o write() method.
it_it: Metodi mancanti readinto() o write() allo stream.
nl: Stream mist readinto() of write() methode.

source: Supply at least one UART pin
es: Suministre al menos un pin UART
nl: Geef op zijn minst 1 UART pin op

source: Supply one of monotonic_time or epoch_time
de_de: Gib entweder monotonic_time oder epoch_time an
es: Suministre monotonic_time o epoch_time
fr: Fournissez l'un de monotonic_time ou epoch_time
nl: Geef monotonic_time of epoch_time
pt_br: Forneça um de monotonic_time ou de epoch_time
ru: Поставьте один из monotonic_time или epoch_time
sv: Ange en av monotonic_time eller epoch_time

source: System entry must be gnss.SatelliteSystem
de_de: Systemeintrag muss auf gnss.SatelliteSystem lauten
es: La entrada del sistema debe ser gnss.SatelliteSystem
fr: L'entrée du système doit être gnss.SatelliteSystem
nl: Systeem invoer moet gnss.SatelliteSystem zijn
pt_br: A entrada no sistema deve ser gnss.SatelliteSystem
ru: Системная запись должна быть gnss. Спутниковая система
sv: Systeminträdet måste vara gnss. SatellitSystem

source: Temperature read timed out
de_de: Zeitüberschreitung beim Auslesen der Temperatur
es: Lectura de temperatura expirada
fr: Délais de lecture de température dépassée
nl: Temperatuur lees time-out
pt_br: A leitura da temperatura expirou
ru: Истекло время ожидания считывания температуры
sv: Temperaturavläsning tog för lång tid

source: The CircuitPython heap was corrupted because the stack was too small. Increase the stack size if you know how. If not:
es: El montículo de CircuitPython está corrupto porque la pila era muy pequeña. Aumente el tamaño de pila si sabe como. De lo contrario:

source: The `microcontroller` module was used to boot into safe mode. Press reset to exit safe mode.
es: El módulo de `microcontroller` se usó para un arranque en modo seguro. Presione reset para salir del modo seguro.

source: The length of rgb_pins must be 6, 12, 18, 24, or 30
de_de: Die Länge von rgb_pins muss 6, 12, 18, 24 oder 30 betragen
es: La longitud de rgb_pins debe ser 6, 12, 18, 24, o 30
fr: La taille de rgb_pins doit être 6, 12, 18, 24 ou 30
nl: De lengte van rgb_pins moet 6, 12, 18, 24 of 30 zijn
pt_br: O comprimento dos rgb_pins devem ser 6, 12, 18, 24, ou 30
ru: Длина rgb_pins должна быть 6, 12, 18, 24 или 30
sv: Längden på rgb_pins vara 6, 12, 18, 24 eller 30

source: The microcontroller's power dipped. Make sure your power supply provides enough power for the whole circuit and press reset (after ejecting CIRCUITPY).
es: La corriente eléctrica de la microcontroladora bajó. Asegúrate que tu fuente de poder provee suficiente corriente para todo el circuito y presiones reset (luego de expulsar CIRCUITPY).

source: The sample's bits_per_sample does not match the mixer's
de_de: Das bits_per_sample des Samples stimmt nicht mit dem des Mixers überein
es: Los bits_per_sample del sample no igualan a los del mixer
fil: Ang bits_per_sample ng sample ay hindi tugma sa mixer
fr: Le 'bits_per_sample' de l'échantillon ne correspond pas à celui du mixer
nl: De sample's bits_per_sample komen niet overeen met die van de mixer
pt_br: A amostragem bits_per_sample não coincide com a do mixer
ru: Bits_per_sample сэмпла не соответствует битам микшера
sv: Samplingens bits_per_sample matchar inte mixerns

source: The sample's channel count does not match the mixer's
de_de: Die Kanalanzahl des Samples stimmt nicht mit der des Mischers überein
es: La cuenta de canales del sample no iguala a las del mixer
fil: Ang channel count ng sample ay hindi tugma sa mixer
fr: Le canal de l'échantillon ne correspond pas à celui du mixer
nl: De sample's kanaal aantal komt niet overeen met die van de mixer
pt_br: A contagem da amostragem dos canais não coincide com o a do mixer
ru: Количество каналов образца не совпадает с количеством каналов микшера
sv: Samplingens kanalantal matchar inte mixerns

source: The sample's sample rate does not match the mixer's
de_de: Die Abtastrate der Probe stimmt nicht mit der des Mischers überein
es: El sample rate del sample no iguala al del mixer
fil: Ang sample rate ng sample ay hindi tugma sa mixer
fr: L'échantillonage de l'échantillon ne correspond pas à celui du mixer
nl: De sample's sample rate komt niet overeen met die van de mixer
pt_br: A taxa de amostragem da amostra não coincide com a do mixer
ru: Частота дискретизации семпла не соответствует частоте микшера
sv: Samplingens frekvens matchar inte mixerns

source: The sample's signedness does not match the mixer's
de_de: Der Vorzeichentyp des Samples stimmt nicht mit dem des Mixers überein
es: El signo del sample no iguala al del mixer
fil: Ang signedness ng sample hindi tugma sa mixer
fr: Le signe de l'échantillon ne correspond pas à celui du mixer
nl: De sample's signature komt niet overeen met die van de mixer
pt_br: A amostragem "signedness" não coincide com a do mixer
ru: Подпись семпла не совпадает с подписью микшера
sv: Samplingens signerad/osignerad stämmer inte med mixern

source: Tile height must exactly divide bitmap height
de_de: Die Kachelhöhe muss die Bitmaphöhe genau teilen
es: La altura del Tile debe dividir exacto la altura del bitmap
fr: La hauteur de la tuile doit diviser exactement la hauteur de l'image
nl: Tile hoogte moet exact de bitmap hoogte verdelen
pt_br: A altura do bloco deve dividir exatamente com a altura do bitmap
ru: Высота плитки должна точно делить высоту растрового изображения
sv: Tile-höjden måste vara jämnt delbar med höjd på bitmap

source: Tile index out of bounds
de_de: Kachelindex außerhalb der Grenzen
es: Índice de mosaico fuera de límites
fr: Index des tuiles hors limites
nl: Tile index buiten bereik
pt_br: O índice do bloco está fora dos limites
ru: Выход индекса плитки за пределы
sv: Tile-index utanför gräns

source: Tile value out of bounds
es: Valor de mosaico fuera de límites
nl: Tile waarde buiten bereik

source: Tile width must exactly divide bitmap width
de_de: Die Kachelbreite muss die Bitmap-Breite genau teilen
es: Ancho del Tile debe dividir exactamente el ancho de mapa de bits
fr: La largeur de la tuile doit diviser exactement la largeur de l'image
nl: Tile breedte moet exact de bitmap breedte verdelen
pt_br: A largura do bloco deve dividir exatamente com a largura do bitmap
ru: Ширина плитки должна точно делить ширину растрового изображения
sv: Tile-bredd måste vara jämnt delbar med bredd på bitmap

source: Time is in the past.
de_de: Zeit liegt in der Vergangenheit.
es: Tiempo suministrado esta en el pasado.
fr: L'heure est dans le passé.
nl: Tijdstip ligt in het verleden.
pt_br: O tempo está no passado.
ru: Время в прошлом.
sv: Tid har passerats.

source: Timeout is too long: Maximum timeout length is %d seconds
de_de: Zeitbeschränkung ist zu groß: Maximale Zeitbeschränkung ist %d Sekunden
es: Tiempo de espera demasiado largo: El tiempo máximo de espera es de %d segundos
fr: Le délai est trop long : le délai maximal est de %d secondes
nl: Time-out is te lang. Maximale time-out lengte is %d seconden
pt_br: O tempo limite é long demais: O comprimento máximo do tempo limite é de %d segundos
ru: Таймаут слишком длинный: максимальная длина таймаута %d секунд
sv: Åtgärden tog för lång tid: Max väntetid är %d sekunder

source: To exit, please reset the board without
es: Para salir, por favor reinicia la tarjeta sin
fil: Para lumabas, paki-reset ang board na wala ang
it_it: Per uscire resettare la scheda senza
nl: Om te beëindigen, reset het bord zonder

source: Too many channels in sample.
de_de: Zu viele Kanäle im sample.
es: Demasiados canales en sample.
fil: Sobra ang channels sa sample.
fr: Trop de canaux dans l'échantillon.
nl: Teveel kanalen in sample.
pt_br: Muitos canais na amostra.
ru: Слишком много каналов в выборке.
sv: För många kanaler i sampling.

source: Too many display busses
es: Demasiados buses de pantalla
nl: Teveel beeldscherm bussen

source: Too many displays
de_de: Zu viele displays
es: Muchos displays
fr: Trop d'affichages
nl: Teveel beeldschermen
pt_br: Exibições demais
ru: Слишком много дисплеев
sv: För många displayer

source: Total data to write is larger than %q
de_de: Gesamte zu schreibende Datenmenge ist größer als %q
es: La cantidad total de datos es mas grande que %q
fr: Quantité de données à écrire est plus que %q
pt_br: O total dos dados que serão escritos é maior do que %q
ru: Общее количество данных для записи превышает %q
sv: Totala data att skriva är större än %q

source: Touch alarms not available
de_de: Touch-Alarme nicht verfügbar
es: Alarmas táctiles no disponibles
fr: Les touches d'alarme ne sont pas disponibles
pt_br: Alarmes de toque não estão disponíveis
ru: Сенсорные сигналы недоступны
sv: Touchalarm är inte tillgängligt

source: Traceback (most recent call last):
de_de: Zurückverfolgung (jüngste Aufforderung zuletzt):
es: Traceback (ultima llamada reciente):
fil: Traceback (pinakahuling huling tawag):
fr: Traceback (appels les plus récents en dernier) :
it_it: Traceback (chiamata più recente per ultima):
nl: Traceback (meest recente call laatst):
pt_br: Traceback (a última chamada mais recente):
ru: Трассировка (последний вызов):
sv: Traceback (senaste anrop):

source: Tuple or struct_time argument required
es: Argumento tuple o struct_time requerido
fil: Tuple o struct_time argument kailangan
it_it: Tupla o struct_time richiesto come argomento
nl: Tuple of struct_time argument vereist
pt_br: O argumento de tupla ou struct_time é necessário

source: UART Buffer allocation error
es: No se pudo encontrar el búfer para UART
nl: UART Buffer allocatie fout

source: UART De-init error
es: Error de desinicialización de UART
nl: UART De-init fout

source: UART Init Error
es: Error de inicialización de UART
nl: UART Init Fout

source: UART Re-init error
es: Error de reinicialización de UART
nl: UART Re-init Fout

source: UART write error
es: Error de escritura UART
nl: UART schrijf fout

source: USB busy
de_de: USB beschäftigt
es: USB ocupado
fr: L'USB est occupé
pt_br: USB ocupado
ru: USB занят
sv: USB upptaget

source: USB devices need more endpoints than are available.
de_de: USB-Geräte brauchen mehr Endpunkte als verfügbar sind.
es: Dispositivos USB necesita más puntos finales de los disponibles.
fr: Les appareils USB nécessitent plus de connexions que disponibles.
pt_br: Os dispositivos USB precisam de mais "endpoints" do que estão disponíveis.
ru: USB-устройствам требуется больше конечных точек, чем доступно.
sv: USB-enheter behöver fler slutpunkter än vad som är tillgängligt.

source: USB devices specify too many interface names.
de_de: USB-Geräte haben zu viele Schnittstellen-Namen festgelegt.
es: Dispositivos USB especifica demasiados nombres de interfaz.
fr: Les appareils USB spécifient trop de noms d'interface.
pt_br: Os dispositivos USB definiram nomes demais para as interfaces.
ru: USB-устройства указывают слишком много имен интерфейсов.
sv: USB-enheter anger för många gränssnittsnamn.

source: USB error
de_de: USB Fehler
es: error USB
fr: Erreur de l'USB
pt_br: Erro na USB
ru: Ошибка USB
sv: USB-fel

source: UUID integer value must be 0-0xffff
de_de: UUID Integer-Wert muss ein Wert von 0 bis 0xffff sein
es: El valor entero del UUID debe ser 0-0xffff
fr: La valeur du chiffre entier de UUID doit être 0-0xffff
nl: UUID integer waarde moet tussen 0 en 0xffff liggen
pt_br: O valor inteiro UUID deve ser 0-0xffff
ru: Целое значение UUID должно быть равно 0-0xffff
sv: UUID-heltal måste vara 0-0xffff

source: UUID string not 'xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx'
de_de: UUID string ist nicht 'xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx'
es: UUID string no es 'xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx'
fr: La chaîne UUID n'est pas au format 'xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx'
nl: UUID string is niet 'xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx'
pt_br: A cadeia de caracteres UUID não 'xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx'
ru: UUID строка не 'xxxxxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxxxxxxxxxxx "
sv: UUID-sträng inte "xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx"

source: UUID value is not str, int or byte buffer
de_de: Der UUID-Wert ist kein str-, int- oder Byte-Puffer
es: UUID valor no es un str, int o byte buffer
fr: La valeur de l'UUID n'est pas une chaîne de caractères, un chiffre entier ou un tampon d'octets
nl: UUID waarde is geen str, int, of byte buffer
pt_br: O valor UUID não é um buffer str, int ou byte
ru: Значение UUID не является строковым, целым или байтовым буфером
sv: UUID-värdet är inte str, int eller byte-buffert

source: Unable to allocate buffers for signed conversion
de_de: Konnte keine Buffer für Vorzeichenumwandlung allozieren
es: No se pudieron asignar buffers para la conversión con signo
fil: Hindi ma-allocate ang buffers para sa naka-sign na conversion
fr: Impossible d'allouer des tampons pour une conversion signée
it_it: Ipossibilitato ad allocare buffer per la conversione con segno
nl: Niet in staat buffers voor gesigneerde conversie te alloceren
pt_br: Não é possível alocar buffers para conversão assinada
ru: Не удается выделить буферы для подписанного преобразования
sv: Det går inte att allokera buffert för signerad konvertering

source: Unable to create lock
de_de: Lock kann nicht erzeugt werden
es: No se puede crear bloqueo
fr: Impossible de créer un verrou ('lock')
nl: Kan vergrendeling niet maken
pt_br: Não é possível criar um lock
ru: Не удается создать блокировку
sv: Kan inte skapa lås

source: Unable to find I2C Display at %x
de_de: Konnte kein I2C Display finden an %x
es: No se puede encontrar la pantalla I2C en %x
fr: Impossible de trouver l'affichage I2C à %x
nl: Geen I2C beeldscherm gevonden bij %x
pt_br: Não foi possível encontrar a tela I2C no %x
ru: Не удается найти дисплей I2C в %x
sv: Det gick inte att hitta I2C-display på %x

source: Unable to find free GCLK
es: No se pudo encontrar un GCLK libre
fil: Hindi mahanap ang libreng GCLK
it_it: Impossibile trovare un GCLK libero
nl: Niet in staat een vrije GCLK te vinden
pt_br: Não é possível encontrar GCLK livre

source: Unable to init parser
de_de: Parser konnte nicht gestartet werden
es: Incapaz de inicializar el parser
fil: Hindi ma-init ang parser
fr: Impossible d'initialiser le parser
it_it: Inizilizzazione del parser non possibile
nl: Niet in staat om de parser te initialiseren
pt_br: Não foi possível iniciar o analisador
ru: Не удается инициировать синтаксический анализатор
sv: Kan inte initiera tolken

source: Unable to read color palette data
de_de: Konnte Farbpalettendaten nicht lesen
es: No se pudo leer los datos de la paleta de colores
fr: Impossible de lire les données de la palette de couleurs
nl: Niet in staat kleurenpalet data te lezen
pt_br: Não foi possível ler os dados da paleta de cores
ru: Не удается прочитать данные цветовой палитры
sv: Det går inte att läsa färgpalettdata

source: Unable to write to nvm.
de_de: Schreiben in nvm nicht möglich.
es: Imposible escribir en nvm.
fil: Hindi ma i-sulat sa NVM.
fr: Écriture impossible vers nvm.
it_it: Imposibile scrivere su nvm.
nl: Niet in staat om naar nvm te schrijven.
pt_br: Não é possível gravar no nvm.
ru: Невозможно выполнить запись в nvm.
sv: Det gick inte att skriva till nvm.

source: Unable to write to sleep_memory.
de_de: Schreiben in sleep_memory nicht möglich.
es: Imposible de escribir en sleep_memory.
fr: Écriture impossible vers sleep_memory.
nl: Kan niet naar sleep_memory schrijven.
pt_br: Não foi possível escrever no sleep_memory.
ru: Невозможно записать в Sleep_memory.
sv: Det gick inte att skriva till sleep_memory.

source: Unexpected nrfx uuid type
de_de: Unerwarteter nrfx uuid-Typ
es: Tipo de uuid nrfx inesperado
fr: Type inattendu pour l'uuid nrfx
nl: Onverwacht mrfx uuid type
pt_br: Tipo uuid nrfx inesperado
ru: Неожиданный тип nrfx uuid
sv: Oväntad nrfx uuid-typ

source: Unhandled ESP TLS error %d %d %x %d
es: Error no manejado de ESP TLS %d %d %x %d
fr: Erreur ESP TLS non gérée %d %d %x %d
nl: Niet behandelde ESP TLS fout %d %d %x %d
pt_br: Erro não tratado do ESP TLS %d %d %x %d

source: Unknown failure %d
de_de: Unbekannter Fehler %d
es: Fallo desconocido %d
fr: Échec inconnu %d
pt_br: Falha desconhecida %d
ru: Неизвестный сбой %d
sv: Okänt fel %d

source: Unknown gatt error: 0x%04x
de_de: Unbekannter Gatt-Fehler: 0x%04x
es: Error de gatt desconocido: 0x%04x
fr: Erreur gatt inconnue : 0x%04x
nl: Onbekende gatt fout: 0x%04x
pt_br: Erro gatt desconhecido: 0x%04x
ru: Неизвестная ошибка gatt: 0x%04x
sv: Okänt gatt-fel: 0x%04x

source: Unknown reason.
de_de: Unbekannter Grund.
es: Razón desconocida.
fr: Raison inconnue.
nl: Onbekende reden.
pt_br: Motivo desconhecido.
ru: Причина неизвестна.
sv: Okänd anledning.

source: Unknown security error: 0x%04x
de_de: Unbekannter Sicherheitsfehler: 0x%04x
es: Error de seguridad desconocido: 0x%04x
fr: Erreur de sécurité inconnue : 0x%04x
nl: Onbekende veiligheidsfout: 0x%04x
pt_br: Erro de segurança desconhecido: 0x%04x
ru: Неизвестная ошибка безопасности: 0x%04x
sv: Okänt säkerhetsfel: 0x%04x

source: Unknown system firmware error: %04x
de_de: Unbekannter Systemfirmware Fehler: %04x
es: Error desconocido en el firmware sistema: %04x
fr: Faute inconnue du logiciel système : %04x
pt_br: Erro desconhecido do firmware: %04x
ru: Неизвестная системная ошибка прошивки: %04x
sv: Okänt systemfirmwarefel: %04x

source: Unmatched number of items on RHS (expected %d, got %d).
de_de: Nicht übereinstimmende Anzahl von Elementen auf der rechten Seite (erwartet %d, %d erhalten).
es: Número incomparable de elementos en RHS (%d esperado,%d obtenido).
fr: Pas de correspondance du nombres d'éléments à droite (attendu %d, obtenu %d).
nl: Niet overeenkomend aantal RHS items (verwachtte %d, kreeg %d).
pt_br: Quantidade inigualável de itens no RHS (%d esperado, obteve %d).
ru: Непревзойденное количество элементов на RHS (ожидалось %d, получено %d).
sv: Omatchat antal på RHS (förväntat %d, fick %d).

source: Unspecified issue. Can be that the pairing prompt on the other device was declined or ignored.
de_de: Nicht näher bezeichnetes Problem. Möglicherweise wurde die Pairing-Eingabeaufforderung auf dem anderen Gerät abgelehnt oder ignoriert.
es: Problema no especificado. Puede ser que la señal de emparejamiento del otro dispositivo fue denegada o ignorada.
fr: Problème non spécifié. Il se peut que l'invite d'association sur l'autre appareil ait été refusée ou ignorée.
nl: Ongespecificeerd probleem. Kan zijn dat de pariteit prompt op het andere apparaat geweigerd of genegeerd werd.
pt_br: Problema desconhecido. Pode ser que o prompt de emparelhamento no outro dispositivo tenha sido recusado ou ignorado.
ru: Неуказанная проблема. Возможно, запрос на сопряжение на другом устройстве был отклонен или проигнорирован.
sv: Ospecificerat problem. Kan vara att parningen på den andra enheten avvisades eller ignorerades.

source: Unsupported baudrate
es: Baudrate no soportado
fil: Hindi supportadong baudrate
it_it: baudrate non supportato
nl: Niet-ondersteunde baudsnelheid

source: Unsupported display bus type
de_de: Nicht unterstützter display bus type
es: Sin capacidad de bus tipo display
fr: Type de bus d'affichage non supporté
nl: Niet-ondersteund beeldscherm bus type
pt_br: Não há suporte para o tipo do display bus
ru: Неподдерживаемый тип шины дисплея
sv: Busstyp för display stöds inte
