Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: Cannot write without MOSI pin.
es: No se puede escribir sin pin MOSI.
fil: Hindi maaring isulat kapag walang MOSI pin.
it_it: Impossibile scrivere senza pin MOSI.
nl: Kan niet schrijven zonder MOSI pin.

source: CharacteristicBuffer writing not provided
de_de: Schreiben von CharacteristicBuffer ist nicht vorgesehen
es: CharateristicBuffer escritura no proporcionada
fr: Ecriture sur 'CharacteristicBuffer' non fournie
nl: CharacteristicBuffer schrijven is niet beschikbaar
pt_br: Escrita CharacteristicBuffer não informada
ru: ХарактеристикаЗапись в буфер не предусмотрена
sv: Skrivning för CharacteristicBuffer är inte tillhandahållen

source: CircuitPython core code crashed hard. Whoops!
de_de: Der CircuitPython-Kerncode ist hart abgestürzt. Hoppla!
es: El código central de CircuitPython se estrelló con fuerza. ¡Whoops!
fr: Le code principal de CircuitPython s'est complètement planté. Oups !
nl: CircuitPython core code is hard gecrashed. Ojee!
pt_br: O núcleo principal do CircuitPython falhou feio. Ops!
ru: Основной код CircuitPython сильно разбился. Упс!
sv: CircuitPython kärnkod kraschade hårt. Hoppsan!

source: CircuitPython was unable to allocate the heap.
es: CircuitPython no puedo encontrar el montículo.
nl: CircuitPython kon het heap geheugen niet toewijzen.

source: Clock pin init failed.
es: Iniciado de pin de reloj fallido.
fil: Nabigo sa pag init ng Clock pin.
it_it: Inizializzazione del pin di clock fallita.
nl: Clock pin init mislukt.

source: Clock stretch too long
es: Estirado de reloj demasiado largo
fil: Masyadong mahaba ang Clock stretch
nl: Clock stretch is te lang
pt_br: Clock se estendeu por tempo demais

source: Clock unit in use
de_de: Clock unit wird benutzt
es: Clock unit está siendo utilizado
fil: Clock unit ginagamit
fr: Horloge en cours d'utilisation
it_it: Unità di clock in uso
nl: Clock unit in gebruik
pt_br: Unidade de Clock em uso
ru: Источник тактирования уже используется
sv: Klockenhet används

source: Column entry must be digitalio.DigitalInOut
es: Entrada de columna debe ser digitalio.DigitalInOut
nl: Column entry moet digitalio.DigitalInOut zijn

source: Command must be an int between 0 and 255
es: Command debe ser un int entre 0 y 255
nl: Command moet een int tussen 0 en 255 zijn

source: Connection has been disconnected and can no longer be used. Create a new connection.
de_de: Die Verbindung wurde getrennt und kann nicht mehr verwendet werden. Erstelle eine neue Verbindung.
es: La conexión se ha desconectado y ya no se puede usar. Crea una nueva conexión.
fr: La connexion a été déconnectée et ne peut plus être utilisée. Créez une nouvelle connexion.
nl: Verbinding is verbroken en kan niet langer gebruikt worden. Creëer een nieuwe verbinding.
pt_br: A conexão foi desconectada e não pode mais ser usada. Crie uma nova conexão.
ru: Соединение было отключено и больше не может использоваться. Создайте новое соединение.
sv: Anslutningen har kopplats bort och kan inte längre användas. Skapa en ny anslutning.

source: Corrupt .mpy file
es: Archivo .mpy corrupto
nl: Corrupt .mpy bestand

source: Could not initialize Camera
es: No se puede inicializar Camera
nl: Kon camera niet initialiseren

source: Could not initialize GNSS
es: No se pudo inicializar el GNSS
nl: Kan GNSS niet initialiseren

source: Could not initialize SDCard
es: No se pudo inicializar SDCard
nl: Kan SDCard niet initialiseren

source: Could not initialize UART
es: No se puede inicializar la UART
fil: Hindi ma-initialize ang UART
it_it: Impossibile inizializzare l'UART
nl: Kan UART niet initialiseren

source: Could not re-init channel
es: No se pudo reiniciar el canal
nl: Kan kanaal niet her-initialiseren

source: Could not re-init timer
es: No se pudo reiniciar el temporizador
nl: Kan timer niet her-initialiseren

source: Could not restart PWM
es: No se pudo reiniciar el PWM
nl: Kan PWM niet herstarten

source: Could not retrieve clock
es: No puedo traer el reloj
nl: Kon klok niet ophalen
pt_br: Não foi possível recuperar o clock

source: Could not set address
de_de: Konnte Adresse nicht setzen
es: No se puede definir la dirección
fr: Impossible de définir l'adresse
nl: Kan adres niet zetten
pt_br: Não foi possível definir o endereço
ru: Не удалось задать адрес
sv: Kan inte ange adress

source: Could not start PWM
es: No se pudo iniciar PWM
nl: Kan PWM niet starten
pt_br: Não foi possível iniciar o PWM

source: Could not start interrupt, RX busy
de_de: Interrupt konnte nicht gestartet werden, RX beschäftigt
es: No se pudo iniciar la interrupción, RX ocupado
fr: Impossible de démarrer l'interruption, RX occupé
nl: Kan interrupt niet starten, RX is bezig
pt_br: Não foi possível iniciar a interrupção, RX ocupado
ru: Не удалось запустить прерывание, RX занят
sv: Det gick inte att starta avbrott, RX upptagen

source: Couldn't allocate decoder
de_de: Decoder konnte nicht zugeordnet werden
es: No se pudo encontrar el decodificador
fr: Impossible d'allouer le décodeur
nl: Kan decoder niet alloceren
pt_br: Não foi possível alocar o decodificador
ru: Не удалось выделить место для декодера
sv: Det gick inte att allokera avkodaren

source: Couldn't allocate first buffer
es: No se pudo asignar el primer buffer
fil: Hindi ma-iallocate ang first buffer
it_it: Impossibile allocare il primo buffer
nl: Kan eerste buffer niet alloceren

source: Couldn't allocate input buffer
es: No se pudo encontrar el buffer de entrada
nl: Kan input buffer niet alloceren

source: Couldn't allocate second buffer
es: No se pudo asignar el segundo buffer
fil: Hindi ma-iallocate ang second buffer
it_it: Impossibile allocare il secondo buffer
nl: Kan tweede buffer niet alloceren

source: Crash into the HardFault_Handler.
es: Choque contra el HardFault_Handler.
nl: Crash naar de HardFault_Handler.

source: DAC Channel Init Error
de_de: DAC-Kanal-Initialisierungsfehler
es: Error de inicio del canal DAC
fr: Erreur d'initialisation du canal DAC
nl: DAC kanaal Init Fout
pt_br: Erro de Inicialização do Canal DAC
ru: Ошибка инициализации канала DAC
sv: Initieringsfel för DAC-kanal

source: DAC Device Init Error
de_de: DAC-Gerät-Initialisierungsfehler
es: Error de inicio del dispositivo DAC
fr: Erreur d'initialisation du périphérique DAC
nl: DAC Apparaat Init Fout
pt_br: Erro de Inicialização do Dispositivo DAC
ru: Ошибка инициализации устройства DAC
sv: Initieringsfel för DAC-enhet

source: DAC already in use
de_de: DAC wird schon benutzt
es: DAC ya está siendo utilizado
fil: Ginagamit na ang DAC
fr: DAC déjà utilisé
it_it: DAC già in uso
nl: DAC al in gebruik
pt_br: DAC em uso
ru: DAC уже используется
sv: DAC används redan

source: Data 0 pin must be byte aligned
de_de: Data 0 pin muss am Byte ausgerichtet sein
es: El pin Data 0 debe estar alineado a bytes
fr: La broche 'Data 0' doit être aligné sur l'octet
nl: Data 0 pin moet byte uitgelijnd zijn
pt_br: O pino de dados 0 deve ser alinhado por bytes
ru: Пин data 0 должен быть байтово выровнен
sv: Datapinne 0 måste vara bytejusterad

source: Data 0 pin must be byte aligned.
es: El pin de datos 0 debe ser alineado a byte.

source: Data chunk must follow fmt chunk
de_de: Dem fmt Block muss ein Datenblock folgen
es: Trozo de datos debe seguir fmt chunk
fil: Dapat sunurin ng Data chunk ang fmt chunk
fr: Un bloc de données doit suivre un bloc fmt
nl: Data chunk moet gevolgd worden door fmt chunk
pt_br: Pedaço de dados deve seguir o pedaço de cortes
ru: Блок данных должен следовать за блоком fmt
sv: Datasegmentet måste följa fmt-segmentet

source: Data not supported with directed advertising
de_de: Daten werden nicht mit direkter Ankündigung unsterstützt
es: Datos sin capacidad de anuncio dirigido
fr: Les données ne sont pas supportées avec les annonces directes
pt_br: Os dados não são compatíveis com publicidade direcionada
ru: Данные не поддерживаются направленным объявлением
sv: Data stöds inte med riktad annonsering

source: Data too large for advertisement packet
de_de: Zu vielen Daten für das advertisement packet
es: Data es muy grande para el paquete de anuncio
fr: Données trop volumineuses pour un paquet d'avertissement
nl: Data te groot voor advertisement pakket
pt_br: Os dados são grandes demais para o pacote de publicidade
ru: Данные слишком велики для пакета объявления
sv: Data för stor för annonseringspaket

source: Deep sleep pins must use a rising edge with pulldown
de_de: Deep Sleep Pins müssen eine steigende Flanke mit Pulldown verwenden
es: Pines de sueño profundo deben usar eje de subida con jalado hacia abajo
fr: Les broches de sommeil profond doivent utiliser un montant avec un pulldown
pt_br: Os pinos deep sleep devem usar uma borda ascendente com pulldown
ru: Выводы глубокого сна должны использовать сигнал по возрастанию с подтяжкой к земле
sv: Deep sleep-pinnar måste använda en stigande flank med pulldown

source: Destination capacity is smaller than destination_length.
de_de: Die Zielkapazität ist kleiner als destination_length.
es: Capacidad de destino es mas pequeña que destination_length.
fil: Ang kapasidad ng destinasyon ay mas maliit kaysa sa destination_length.
fr: La capacité de destination est plus petite que 'destination_length'.
it_it: La capacità di destinazione è più piccola di destination_length.
nl: Bestemming grootte is kleiner dan destination_length.
pt_br: A capacidade do destino é menor que destination_length.
ru: Емкость места назначения меньше длины места назначения.
sv: Målkapaciteten är mindre än destination_length.

source: Device in use
de_de: Gerät in Benutzung
es: Dispositivo en uso
fr: Appareil utilisé
nl: Apparaat al in gebruik
pt_br: Dispositivo em uso
ru: Устройство используется
sv: Enheten används redan

source: DigitalInOut not supported on given pin
es: DigitalInOut no es compatible con un pin dado
nl: DigitalInOut niet ondersteund door gegeven pin

source: Display must have a 16 bit colorspace.
de_de: Display muss einen 16 Bit Farbraum haben.
es: La pantalla debe tener un espacio de color de 16 bits.
fr: L'affichage doit avoir un espace colorimétrique de 16 bits.
nl: Beeldscherm moet een 16bit kleurruimte hebben.
pt_br: O monitor deve ter um espaço de cores com 16 bits.
ru: Дисплей должен иметь 16 битное цветовое пространство.
sv: Displayen måste ha en 16-bitars färgrymd.

source: Display rotation must be in 90 degree increments
de_de: Die Rotation der Anzeige muss in 90-Grad-Schritten erfolgen
es: Rotación de display debe ser en incrementos de 90 grados
fr: La rotation d'affichage doit se faire par incréments de 90 degrés
nl: Beeldscherm rotatie moet in stappen van 90 graden
pt_br: A rotação da tela deve estar em incrementos de 90 graus
ru: Поворот дисплея должен осуществляться с шагом 90 градусов
sv: Displayens rotation måste vara i steg om 90 grader

source: Drive mode not used when direction is input.
de_de: Drive mode wird nicht verwendet, wenn die Richtung input ist.
es: Modo Drive no se usa cuando la dirección es input.
fil: Drive mode ay hindi ginagamit kapag ang direksyon ay input.
fr: Le mode Drive n'est pas utilisé quand la direction est entrante ('input').
nl: Drive modus niet gebruikt als de richting input is.
pt_br: O modo do controlador não é usado quando a direção for inserida.
ru: Режим движения не используется при вводе направления.
sv: Drivläge används inte när riktning är input.

source: ECB only operates on 16 bytes at a time
de_de: Die EZB arbeitet jeweils nur mit 16 Bytes
es: ECB solo opera sobre 16 bytes a la vez
fr: La BCE ne fonctionne que sur 16 octets à la fois
nl: ECB werkt alleen met 16 bytes tegelijkertijd
pt_br: O BCE opera apenas com 16 bytes por vez
ru: ECB работает только с 16 байтами за раз
sv: ECB arbetar endast på 16 byte åt gången

source: ESP-IDF memory allocation failed
de_de: ESP-IDF Speicherallozierung fehlgeschlagen
es: Fallo ESP-IDF al tomar la memoria
fr: ESP-IDF échec d'allocation de la mémoire
nl: ESP-IDF geheugen toewijzing mislukt
pt_br: Houve uma falha na alocação da memória ESP-IDF
ru: Ошибка выделения памяти ESP-IDF
sv: ESP-IDF-minnetilldelning misslyckades

source: EXTINT channel already in use
es: El canal EXTINT ya está siendo utilizado
fil: Ginagamit na ang EXTINT channel
it_it: Canale EXTINT già in uso
nl: EXTINT kanaal al in gebruik
pt_br: Canal EXTINT em uso

source: Error in MIDI stream at position %d
es: Error en el flujo MIDI en la posición %d

source: Error in regex
de_de: Fehler in regex
es: Error en regex
fil: May pagkakamali sa REGEX
fr: Erreur dans l'expression régulière
it_it: Errore nella regex
nl: Fout in regex
pt_br: Erro no regex
ru: Ошибка в регулярном выражении
sv: Fel i regex

source: Error: Failure to bind
es: Error: fallo al vincular
fr: Erreur : Impossible de lier
pt_br: Erro: Falha na vinculação

source: Expected a %q
es: Se espera un %q
fil: Umasa ng %q
it_it: Atteso un %q
nl: Verwacht een %q

source: Expected a Characteristic
es: Se esperaba una Característica
nl: Verwachtte een Characteristic

source: Expected a DigitalInOut
es: Se espera un DigitalInOut
nl: Verwachtte een DigitalInOut

source: Expected a Service
es: Se esperaba un servicio
nl: Verwachtte een Service

source: Expected a UART
es: Se espera un UART
nl: Verwachtte een UART

source: Expected a UUID
es: Se esperaba un UUID
nl: Verwachtte een UUID

source: Expected an Address
es: Se esperaba una dirección
nl: Verwachtte een adres

source: Expected an alarm
es: Un objecto alarm era esperado
nl: Verwachtte een alarm

source: Expected tuple of length %d, got %d
es: Se esperaba un tuple de %d, se obtuvo %d
nl: Verwachtte een tuple met lengte %d, maar kreeg %d

source: Extended advertisements with scan response not supported.
de_de: Erweiterte Ankündigung (advertising) mit Scan-Antwort wird nicht unterstützt.
es: No se admiten anuncios extendidos con respuesta de escaneo.
fr: Les avertissement étendues avec analyse de réponse ne sont pas supportées.
nl: Extended advertisements met scan antwoord niet ondersteund.
pt_br: Anúncios estendidos não compatíveis com a resposta da varredura.
ru: Расширенные объявления с ответом сканирования не поддерживаются.
sv: Utökad annonsering i kombination med skanningssvar stöds inte.

source: FFT is defined for ndarrays only
de_de: FFT ist nur für ndarrays definiert
es: FFT se define solo para ndarrays
fr: La FFT est définie uniquement pour les ndarrays
nl: FFT alleen voor ndarrays gedefineerd
pt_br: O FFT é definido apenas para ndarrays
ru: FFT определено только для массивов ndarrays
sv: FFT är enbart definierade för ndarrays

source: FFT is implemented for linear arrays only
de_de: FFT ist nur für lineare Arrays implementiert
es: FFT solo esta implementado para arrays lineales
fr: FFT n'est implémenté que pour les arrays linéaires
nl: FFT is alleen geïmplementeerd voor lineaire arrays
pt_br: O FFT é implementado apenas para matrizes lineares
ru: FFT реализовано только для линейных массивов
sv: FTT är enbart implementerad för linjära matriser

source: Failed SSL handshake
es: Fallo en saludo SSL
fr: Échec du handshake SSL
nl: SSL handdruk mislukt
pt_br: Houve uma falha no handshake do SSL

source: Failed sending command.
de_de: Kommando nicht gesendet.
es: Fallo enviando comando.
fr: Échec de l'envoi de la commande.
nl: Commando verzenden mislukt.
pt_br: Falha ao enviar comando.
ru: Не удалось отправить команду.
sv: Det gick inte att skicka kommandot.

source: Failed to acquire mutex, err 0x%04x
de_de: Mutex konnte nicht akquiriert werden. Status: 0x%04x
es: No se puede adquirir el mutex, error 0x%04x
fr: Echec de l'obtention de mutex, err 0x%04x
nl: Fout tijdens verkrijgen mutex, err 0x%04x
pt_br: Houve uma falha na aquisição do mutex, err 0x%04x
ru: Не удалось получить mutex, ошибка 0x%04x
sv: Det gick inte att förvärva mutex, fel 0x%04x

source: Failed to allocate RX buffer
es: Ha fallado la asignación del buffer RX
fil: Nabigong ilaan ang RX buffer
it_it: Impossibile allocare buffer RX
nl: RX buffer alloceren mislukt

source: Failed to allocate RX buffer of %d bytes
es: Falló la asignación del buffer RX de %d bytes
fil: Nabigong ilaan ang RX buffer ng %d bytes
it_it: Fallita allocazione del buffer RX di %d byte
nl: Mislukt een RX buffer van %d bytes te alloceren

source: Failed to allocate Wifi memory
de_de: Zuweisung des Wifi Speichers ist fehlgeschlagen
es: Fallo al tomar memoria Wifi
fr: Impossible d'allouer la mémoire pour Wifi
nl: Kon WiFi geheugen niet toewijzen
pt_br: Houve uma falha na alocação da memória do Wifi
ru: Не удалось выделить память Wifi
sv: Det gick inte att allokera WiFi-minne

source: Failed to allocate wifi scan memory
de_de: Zuweisung des Wifi Scan Speichers ist fehlgeschlagen
es: Fallo al tomar memoria para búsqueda wifi
fr: Impossible d'allouer la mémoire pour le scan wifi
nl: Kon WiFi scan geheugen niet toewijzen
pt_br: Houve uma falha na alocação da memória para a varredura do Wifi
ru: Не удалось выделить память для сканирования wifi
sv: Det gick inte att allokera minne för WiFi-scanning

source: Failed to buffer the sample
de_de: Pufferung des Sample fehlgeschlagen
es: Fallo al hacer el búfer de la muestra
fr: Échec du tamponage de l'échantillon
pt_br: Houve uma falha ao fazer uma memória prévia (buffer) da amostra
ru: Не удалось выполнить буферизацию образца
sv: Det gick inte att buffra samplingen

source: Failed to connect: internal error
de_de: Verbindung fehlgeschlagen: interner Fehler
es: Error al conectar: error interno
fr: Impossible de se connecter : erreur interne
nl: Verbinding mislukt: interne fout
pt_br: Falha ao conectar: erro interno
ru: Не удалось подключиться: внутренняя ошибка
sv: Det gick inte att ansluta: internt fel

source: Failed to connect: timeout
de_de: Verbindung nicht erfolgreich: timeout
es: Error al conectar: tiempo de espera agotado
fr: Impossible de se connecter: délai dépassé
nl: Verbinding mislukt: timeout
pt_br: Falha ao conectar: tempo limite
ru: Не удалось подключиться: таймаут
sv: Det gick inte att ansluta: timeout

source: Failed to init wifi
es: Fallo al inicializar wifi
nl: Kon WiFi niet initialiseren

source: Failed to parse MP3 file
de_de: MP3-Datei konnte nicht analysiert werden
es: Error al analizar el archivo MP3
fr: Impossible d'analyser le fichier MP3
nl: Mislukt om MP3 bestand te ontleden
pt_br: Falha ao analisar o arquivo MP3
ru: Не удалось распарсить файл MP3
sv: Det gick inte att tolka MP3-filen

source: Failed to release mutex, err 0x%04x
de_de: Mutex konnte nicht freigegeben werden. Status: 0x%04x
es: No se puede liberar el mutex, err 0x%04x
fr: Impossible de libérer mutex, err 0x%04x
nl: Mislukt mutex los te laten, err 0x%04x
pt_br: Houve uma falha ao liberar o mutex, err 0x%04x
ru: Не удалось освободить mutex, ошибка 0x%04x
sv: Det gick inte att frigöra mutex, fel 0x%04x

source: Failed to write internal flash.
de_de: Interner Flash konnte nicht geschrieben werden.
es: Error al escribir el flash interno.
fr: Échec de l'écriture vers flash interne.
nl: Schrijven naar interne flash mislukt.
pt_br: Falha ao gravar o flash interno.
ru: Не удалось записать внутреннюю флэш-память.
sv: Det gick inte att skriva till intern flash.

source: Fatal error.
es: Error grave.

source: File exists
de_de: Datei existiert
es: El archivo ya existe
fil: Mayroong file
fr: Le fichier existe
it_it: File esistente
nl: Bestand bestaat
pt_br: Arquivo já existe
ru: Файл существует
sv: Filen finns redan

source: Filters too complex
de_de: Filter zu komplex
es: Filtros muy complejos
fr: Filtres trop complexe
nl: Filters zijn te complex
pt_br: Os filtros são muito complexos
ru: Фильтры слишком сложные
sv: Filter för komplexa

source: Firmware image is invalid
es: La imagen de firmware es inválida
nl: Firmware image is ongeldig

source: Format not supported
de_de: Format nicht unterstützt
es: Sin capacidades para el formato
fr: Format non pris en charge
nl: Formaat wordt niet ondersteund
pt_br: O formato não é suportado
ru: Формат не поддерживается
sv: Format stöds inte

source: Framebuffer requires %d bytes
es: Framebuffer requiere %d bytes
nl: Framebuffer benodigd %d bytes

source: Frequency must match existing PWMOut using this timer
es: La frecuencia debe coincidir con PWMOut existente usando este temporizador
nl: Frequentie moet overeenkomen met bestaande PWMOut bij gebruik van deze timer
pt_br: A frequência deve coincidir com o PWMOut existente usando este temporizador

source: Function requires lock
de_de: Die Funktion erwartet, dass der 'lock'-Befehl zuvor ausgeführt wurde
es: La función requiere lock
fil: Function nangangailangan ng lock
fr: La fonction nécessite un verrou ('lock')
nl: Functie vereist lock
pt_br: A função requer bloqueio
ru: Функция требует блокировки
sv: Funktionen kräver lås

source: Generic Failure
de_de: Generischer Fehler
es: Fallo Genérico
fr: Échec génerique
pt_br: Falha Genérica
ru: Общий сбой
sv: Allmänt fel

source: Group already used
de_de: Gruppe schon benutzt
es: Grupo ya está siendo utilizado
fr: Groupe déjà utilisé
nl: Groep al gebruikt
pt_br: O grupo já está em uso
ru: Группа уже используется
sv: Grupp används redan

source: Hardware busy, try alternative pins
es: Hardware ocupado, pruebe pines alternativos
nl: Hardware bezig, probeer alternatieve pinnen

source: Hardware in use, try alternative pins
de_de: Hardware in Benutzung, probiere alternative Pins
es: Hardware en uso, pruebe pines alternativos
fr: Matériel utilisé, essayez d'autres broches
nl: Hardware in gebruik, probeer alternatieve pinnen
pt_br: O hardware está em uso, tente os pinos alternativos
ru: Оборудование используется, попробуйте использовать другие пины
sv: Hårdvaran används redan, prova alternativa pinnar

source: Hostname must be between 1 and 253 characters
es: Hostname debe ser entre 1 y 253 caracteres
nl: Hostnaam moet tussen 1 en 253 karakters zijn

source: I/O operation on closed file
de_de: Lese/Schreibe-operation an geschlossener Datei
es: Operación I/O en archivo cerrado
fil: I/O operasyon sa saradong file
fr: Opération d'E/S sur un fichier fermé
it_it: operazione I/O su file chiuso
nl: I/O actie op gesloten bestand
pt_br: Operação I/O no arquivo fechado
ru: Операция ввода-вывода на закрытом файле
sv: I/O-operation på stängd fil

source: I2C Init Error
es: I2C Error de inicio
nl: I2C Init Fout

source: I2C peripheral in use
de_de: I2C Peripherie in Verwendung
es: Dispositivo I2C en uso
fr: Périphérique I2C utilisé
pt_br: Periférico I2C em uso
ru: Периферийное устройство I2C уже используется
sv: I2C-enhet används redan

source: I2SOut not available
es: I2SOut no disponible
nl: I2SOut is niet beschikbaar

source: IV must be %d bytes long
es: IV debe tener %d bytes de longitud
nl: IV %d bytes lang zijn

source: In-buffer elements must be <= 4 bytes long
de_de: In-Puffer-Elemente müssen <= 4 Bytes lang sein
es: Los elementos del búfer de entrada deben ser de una longitud <= 4 bytes
fr: Éléments dans le tampon doivent être <= à 4 octets
pt_br: Os elementos In-buffer devem ter um comprimento de <= 4 bytes
ru: Элементы буфера должны быть длиной <= 4 байта
sv: Antal element i buffert måste vara <= 4 byte

source: Incompatible .mpy file. Please update all .mpy files. See http://adafru.it/mpy-update for more info.
es: Archivo .mpy incompatible. Actualice todos los archivos .mpy. Consulte http://adafru.it/mpy-update para más información.
fil: .mpy file hindi compatible. Maaring i-update lahat ng .mpy files. See http://adafru.it/mpy-update for more info.
it_it: File .mpy incompatibile. Aggiorna tutti i file .mpy. Vedi http://adafru.it/mpy-update per più informazioni.
nl: Incompatibel .mpy bestand. Update alle .mpy bestanden. Zie http://adafru.it/mpy-update voor meer informatie.

source: Incorrect buffer size
de_de: Inkorrekte Puffergröße
es: Tamaño incorrecto del buffer
fr: Taille de tampon incorrecte
nl: Incorrecte buffer grootte
pt_br: O tamanho do buffer está incorreto
ru: Неправильный размер буфера
sv: Fel buffertstorlek
