Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: Code done running.
de_de: Programm wird ausgeführt.
es: El código terminó de ejecutar.
fr: Exécution du code terminée.
pt_br: O código concluiu a sua execução.
ru: Программа закончила выполнение.
sv: Koden har kört klart.

source: Code stopped by auto-reload.
es: El código fue detenido por el auto-reiniciado.

source: Please file an issue with the contents of your CIRCUITPY drive at https://github.com/adafruit/circuitpython/issues
es: Presente un problema con el contenido de su unidad CIRCUITPY en https://github.com/adafruit/circuitpython/issues
nl: Meld een probleem met de inhoud van de CIRCUITPY drive op: https://github.com/adafruit/circuitpython/issues

source: File "%q"
de_de: Datei "%q"
es: Archivo "%q"
fr: Fichier "%q"
nl: Bestand
pt_br: Arquivo "%q"
ru: Файл "%q"
sv: Filen "%q"

source: File "%q", line %d
de_de: Datei "%q", Zeile %d
es: Archivo "%q", línea %d
fr: Fichier "%q", ligne %d
it_it: File "%q", riga %d
nl: Bestand "%q", regel %d
pt_br: Arquivo "%q", linha %d
ru: Файл "%q", строка %d
sv: Fil "%q", rad %d

source: is of type %q
de_de: ist vom Type %q
es: es de tipo %q
fr: est de type %q
pt_br: é do tipo %q
ru: имеет тип %q
sv: är av typen %q

source: not found.
de_de: nicht gefunden.
es: no encontrado.
fr: pas trouvé
pt_br: não encontrado.
ru: не найден.
sv: hittades inte.

source: output:
de_de: Ausgabe:
es: salida:
fr: sortie :
nl: uitvoer:
pt_br: saída:
ru: вывод:
sv: utdata:

source: %%c requires int or char
de_de: %%c erwartet Int oder Char
es: %%c requiere int o char
fil: %%c nangangailangan ng int o char
fr: %%c nécessite un chiffre entier 'int' ou un caractère 'char'
it_it: %%c necessita di int o char
nl: %%c vereist een int of char
pt_br: %%c requer int ou char
ru: %%c требует int или char
sv: %%c kräver int eller char

source: %d address pins, %d rgb pins and %d tiles indicate a height of %d, not %d
de_de: %d Adress-Pins, %d RGB-Pins und %d Kacheln indizieren eine Höhe von %d, nicht %d
es: %d pines de dirección, %d pines rgb y %d tiles indican una altura de %d, y no de %d
fr: %d broches d'adresse, %d broches RGB et %d pour tile indique une hauteur de %d, et non %d
pt_br: %d pinos de endereço, %d pinos rgb e %d blocos indicam uma altura com %d, não %d
ru: Адресные контакты %d, контакты rgb %d и плитки %d обозначают высоту %d, а не %d
sv: %d adresspinnar, %d rgb-pinnar och %d brickor anger en höjd på %d, inte %d

source: %q failure: %d
de_de: %q Fehler: %d
es: %q fallo: %d
fr: Échec de %q : %d
nl: %q fout: %d
pt_br: %q falha: %d
ru: %q сбой: %d
sv: %q-fel: %d

source: %q in use
de_de: %q in Benutzung
es: %q está siendo utilizado
fil: %q ay ginagamit
fr: %q en cours d'utilisation
it_it: %q in uso
nl: %q in gebruik
pt_br: %q em uso
ru: %q используется
sv: %q används redan

source: %q index out of range
de_de: Der Index %q befindet sich außerhalb des Bereiches
es: %q indice fuera de rango
fil: %q indeks wala sa sakop
fr: index %q hors de portée
it_it: indice %q fuori intervallo
nl: %q index buiten bereik
pt_br: O índice %q está fora do intervalo
ru: Индекс %q вне диапазона
sv: Index %q ligger utanför intervallet

source: %q indices must be integers, not %s
de_de: %q Indizes müssen Integer sein, nicht %s
es: %q indices deben ser enteros, no %s
fil: %q indeks ay dapat integers, hindi %s
fr: les indices %q doivent être des entiers, pas %s
it_it: gli indici %q devono essere interi, non %s
nl: %q indexen moeten integers zijn, niet %s
pt_br: Os índices %q devem ser inteiros, e não %s
ru: Индексы %q должны быть целыми числами, а не %s
sv: Indexet %q måste vara ett heltal, inte %s

source: %q length must be %q
es: el tamaño de %q debe ser %q

source: %q list must be a list
es: %q lista debe ser una lista
nl: %q lijst moet een lijst zijn

source: %q must <= %d
es: %q debe ser <= %d

source: %q must be %d-%d
de_de: %q muss %d-%d sein
es: %q debe ser %d-%d
fr: %q doit être %d-%d
pt_br: o %q deve ser %d-%d
ru: %q должно быть %d-%d
sv: %q måste vara %d-%d

source: %q must be 0-255
es: %q debe ser de 0-255

source: %q must be 1-255
es: %q debe estar entre 1-255

source: %q must be >= %d
de_de: %q muss >= %d sein
es: %q debe ser >= %d
fr: %q doit être >= %d
pt_br: o %q deve ser >= %d
ru: %q должно быть >= %d
sv: %q måste vara >= %d

source: %q must be >= 0
es: %q debe ser >= 0
nl: %q moet >= 0 zijn

source: %q must be >= 1
es: %q debe ser >= 1
nl: %q moet >= 1 zijn

source: %q must be None or between 1 and len(report_descriptor)-1
es: %q debe ser None o entre 1 y len(report_descriptor)-1

source: %q must be a string
es: %q debe ser una cadena

source: %q must be a tuple of length 2
es: %q debe ser una tupla de longitud 2
nl: %q moet een tuple van lengte 2 zijn

source: %q must be between %d and %d
es: %q debe estar entre %d y %d

source: %q must of type %q
es: %q debe ser de tipo %q

source: %q out of range
de_de: %q außerhalb des Bereichs
es: %q fuera de rango
fr: %q est hors de portée
nl: %q buiten bereik
pt_br: %q fora do alcance
ru: %q вне диапазона
sv: %q utanför intervallet

source: %q pin invalid
es: pin inválido %q
nl: %q pin onjuist

source: %q should be an int
es: %q debe ser un int
nl: %q moet een int zijn

source: %q() takes %d positional arguments but %d were given
de_de: %q() nimmt %d Argumente ohne Schlüsselwort an, aber es wurden %d angegeben
es: %q() toma %d argumentos posicionales pero %d fueron dados
fil: Ang %q() ay kumukuha ng %d positional arguments pero %d lang ang binigay
fr: %q() prend %d paramètres de position mais %d ont été donnés
it_it: %q() prende %d argomenti posizionali ma ne sono stati forniti %d
nl: %q() verwacht %d positionele argumenten maar kreeg %d
pt_br: %q() recebe %d argumentos posicionais, porém %d foram informados
ru: %q() принимает %d позиционных аргументов, но было передано %d
sv: % q() tar %d positionsargument men %d gavs

source: '%q' argument required
de_de: '%q' Argument erforderlich
es: argumento '%q' requerido
fil: '%q' argument kailangan
fr: paramètre '%q' requis
it_it: '%q' argomento richiesto
nl: '%q' argument vereist
pt_br: '%q' argumento(s) requerido(s)
ru: Требуется аргумент '%q'
sv: '%q' argument krävs

source: '%q' object does not support '%q'
de_de: '%q' Objekt unterstützt '%q' nicht
es: objeto '%q' no tiene capacidad '%q'
fr: l'objet '%q' ne supporte pas '%q'
nl: '%q' object ondersteunt geen '%q'
pt_br: O objeto '%q' não suporta '%q'
ru: Объект '%q' не поддерживает '%q'
sv: Objektet '%q' stöder inte '%q'

source: '%q' object is not an iterator
de_de: '%q' Objekt ist kein Iterator
es: objeto '%q' no es un iterador
fr: l'objet '%q' n'est pas un itérateur
nl: '%q' object is geen iterator
pt_br: O objeto '%q' não é um iterador
ru: Объект '%q' не является итератором
sv: Objektet '%q' är inte en iterator

source: '%q' object is not callable
de_de: '%q' Objekt ist kein callable
es: objeto '%q' no es llamable
fr: l'objet '%q' ne peut pas être appelé
nl: '%q' object is niet aanroepbaar
pt_br: O objeto '%s' não é invocável
ru: Объект '%q' не является вызываемым
sv: Objektet '%q' kan inte anropas

source: '%q' object is not iterable
de_de: '%q' Objekt ist nicht iterierbar
es: objeto '%q' no es iterable
fr: l'objet '%q' n'est pas itérable
nl: '%q' object is niet itereerbaar
pt_br: O objeto '%q' não é iterável
ru: Объект '%q' не является итерируемым
sv: Objektet '%q' är inte itererbart

source: '%s' expects a label
de_de: '%s' erwartet ein Label
es: '%s' espera una etiqueta
fil: '%s' umaasa ng label
fr: '%s' attend une étiquette
it_it: '%s' aspetta una etichetta
nl: '%s' verwacht een label
pt_br: '%s' exige um rótulo
ru: '%s' ожидает метку
sv: '%s' förväntar sig en label

source: '%s' expects a register
de_de: '%s' erwartet ein Register
es: '%s' espera un registro
fil: Inaasahan ng '%s' ang isang rehistro
fr: '%s' attend un registre
it_it: '%s' aspetta un registro
nl: '%s' verwacht een register
pt_br: '%s' exige um registro
ru: '%s' ожидает регистр
sv: '%s' förväntar sig ett register

source: '%s' expects a special register
de_de: '%s' erwartet ein Spezialregister
es: '%s' espera un registro especial
fil: Inaasahan ng '%s' ang isang espesyal na register
fr: '%s' attend un registre spécial
nl: '%s' verwacht een speciaal register
pt_br: '%s' exige um registro especial
ru: '%s' ожидает специальный регистр
sv: '%s' förväntar sig ett specialregister

source: '%s' expects an FPU register
de_de: '%s' erwartet ein FPU-Register
es: '%s' espera un registro de FPU
fil: Inaasahan ng '%s' ang isang FPU register
fr: '%s' attend un registre FPU
nl: '%s' verwacht een FPU register
pt_br: '%s' exige um registro FPU
ru: '%s' ожидает регистр FPU
sv: '%s' förväntar sig ett FPU-register

source: '%s' expects an address of the form [a, b]
de_de: '%s' erwartet eine Adresse in der Form [a, b]
es: '%s' espera una dirección de forma [a, b]
fil: Inaasahan ng '%s' ang isang address sa [a, b]
fr: '%s' attend une adresse de la forme [a, b]
nl: '%s' verwacht een adres in de vorm [a, b]
pt_br: '%s' exige um endereço no formato [a, b]
ru: '%s' ожидает адрес в формате [a, b]
sv: '%s' förväntar sig en adress i formen [a, b]

source: '%s' expects an integer
de_de: '%s' erwartet ein Integer
es: '%s' espera un entero
fil: Inaasahan ng '%s' ang isang integer
fr: '%s' attend un chiffre entier
it_it: '%s' aspetta un intero
nl: '%s' verwacht een integer
pt_br: '%s' exige um número inteiro
ru: '%s' ожидает целое число
sv: '%s' förväntar sig ett heltal

source: '%s' expects at most r%d
de_de: '%s' erwartet höchstens r%d
es: '%s' espera a lo sumo r%d
fil: Inaasahan ng '%s' ang hangang r%d
fr: '%s' attend au plus r%d
nl: '%s' verwacht op zijn meest r%d
pt_br: '%s' exige no máximo r%d
ru: '%s' ожидает не более r%d
sv: '%s' förväntar sig högst r%d

source: '%s' expects {r0, r1, ...}
de_de: '%s' erwartet {r0, r1, ...}
es: '%s' espera {r0, r1, ...}
fil: Inaasahan ng '%s' ay {r0, r1, …}
fr: '%s' attend {r0, r1, ...}
nl: '%s' verwacht {r0, r1, …}
pt_br: '%s' exige {r0, r1, ...}
ru: '%s' ожидает {r0, r1, ...}
sv: '%s' förväntar sig {r0, r1, ...}

source: '%s' integer %d isn't within range %d..%d
de_de: '%s' Die ganze Zahl %d ist nicht im Bereich %d..%d
es: '%s' entero %d no se encuentra en el rango %d..%d
fr: L'entier '%s' à %d n'est pas dans l'intervalle %d..%d
pt_br: '%s' inteiro %d não está dentro do intervalo %d..%d
ru: '%s' целое число %d не находится в пределах диапазона %d..%d
sv: '%s' heltal %d ligger inte inom intervallet %d..%d

source: '%s' integer 0x%x doesn't fit in mask 0x%x
de_de: '%s' Integer 0x%x passt nicht in Maske 0x%x
es: '%s' entero 0x%x no cabe en la máscara 0x%x
fr: L'entier '%s' à 0x%x n'entre pas dans le masque 0x%x
pt_br: O número inteiro '%s' 0x%x não cabe na máscara 0x%x
ru: '%s' целое число 0x%x не помещается в маску 0x%x
sv: '%s' heltal 0x%x ryms inte i mask 0x%x

source: '%s' object doesn't support item assignment
de_de: '%s' Objekt unterstützt keine Element-Zuordnung
es: '%s' el objeto no tiene capacidad de asignación de item
fr: l'objet %s ne supporte pas l'assignation d'éléments
pt_br: O objeto '%s' não suporta a atribuição dos itens
ru: Объект '%s' не поддерживает присвоение элементов
sv: Objektet '%s' stöder inte tilldelning

source: '%s' object doesn't support item deletion
de_de: '%s' Objekt unterstützt keine Löschung von Elementen
es: '%s' el objeto no tiene capacidad de borrado de item
fr: L'objet '%s' ne prend pas en charge la suppression d'éléments
pt_br: O objeto '%s' não é compatível com exclusão do item
ru: Объект '%s' не поддерживает удаление элементов
sv: Objektet '%s' stöder inte borttagning

source: '%s' object has no attribute '%q'
de_de: '%s' Objekt hat kein Attribut '%q'
es: objeto '%s' no tiene atributo '%q'
fil: '%s' object ay walang attribute '%q'
fr: l'objet '%s' n'a pas d'attribut '%q'
it_it: l'oggetto '%s' non ha l'attributo '%q'
nl: '%s' object heeft geen attribuut '%q'
pt_br: O objeto '%s' não possui o atributo '%q'
ru: Объект '%s' не имеет атрибута '%q'
sv: Objektet '%s' har inget attribut '%q'

source: '%s' object isn't subscriptable
de_de: '%s' Objekt ist nicht abonnierbar
es: '%s' el objeto no puede retornar índice de artículos
fr: l'objet '%s' n'est pas indexé
pt_br: O objeto '%s' não é subroteirizável
ru: Объект '%s' не может быть подписан
sv: Objektet '%s' är inte prenumererbar

source: '=' alignment not allowed in string format specifier
de_de: '='-Ausrichtung ist im String-Formatbezeichner nicht zulässig
es: '=' alineación no permitida en el especificador string format
fil: '=' Gindi pinapayagan ang alignment sa pag specify ng string format
fr: '=' alignement non permis dans la spécification du format de chaîne
nl: '=' uitlijning niet toegestaan in string format specifier
pt_br: '=' alinhamento não permitido no especificador do formato da cadeia de caracteres
ru: Выравнивание '=' недопустимо в спецификаторе формата строки
sv: '='-justering tillåts inte i strängformatspecifikation

source: 'S' and 'O' are not supported format types
de_de: 'S' und 'O' sind keine unterstützten Formattypen
es: 'S' y 'O' no son compatibles con los tipos de formato
fil: Ang 'S' at 'O' ay hindi suportadong uri ng format
fr: 'S' et 'O' ne sont pas des types de format supportés
it_it: 'S' e 'O' non sono formati supportati
nl: 'S' and 'O' zijn niet ondersteunde format types
pt_br: 'S' e 'O' não são tipos de formato suportados
ru: 'S' и 'O' не являются поддерживаемыми типами форматов
sv: 'S' och 'O' stöds inte som formattyper

source: 'align' requires 1 argument
de_de: 'align' erfordert genau ein Argument
es: 'align' requiere 1 argumento
fil: 'align' kailangan ng 1 argument
fr: 'align' nécessite 1 paramètre
it_it: 'align' richiede 1 argomento
nl: 'align' vereist 1 argument
pt_br: O 'align' exige 1 argumento
ru: «выравнивание» требует 1 аргумента
sv: 'align' kräver 1 argument

source: 'await' outside function
de_de: 'await' außerhalb einer Funktion
es: 'await' fuera de la función
fil: 'await' sa labas ng function
fr: 'await' dehors d'une fonction
it_it: 'await' al di fuori della funzione
nl: 'await' buiten de functie
pt_br: 'aguardar' fora da função
ru: «ожидание» внешняя функция
sv: 'await' utanför funktion

source: 'await', 'async for' or 'async with' outside async function
es: 'await', 'async for' o 'async with' fuera de la función async
nl: 'await', 'async for' of 'async with' buiten async functie

source: 'break' outside loop
es: 'break' fuera de un bucle
fil: 'break' sa labas ng loop
it_it: 'break' al di fuori del ciclo
nl: 'break' buiten de loop

source: 'continue' outside loop
es: 'continue' fuera de un bucle
fil: 'continue' sa labas ng loop
it_it: 'continue' al di fuori del ciclo
nl: 'continue' buiten de loop

source: 'coroutine' object is not an iterator
es: el objeto 'coroutine' no es un iterador
nl: 'coroutine' object is geen iterator

source: 'data' requires at least 2 arguments
de_de: 'data' erfordert mindestens zwei Argumente
es: 'data' requiere como mínimo 2 argumentos
fil: 'data' kailangan ng hindi bababa sa 2 argument
fr: 'data' nécessite au moins 2 paramètres
it_it: 'data' richiede almeno 2 argomento
nl: 'data' vereist op zijn minst 2 argumenten
pt_br: 'data' exige pelo menos 2 argumentos
ru: «данные» требуют как минимум 2 аргумента
sv: 'data' kräver minst 2 argument

source: 'data' requires integer arguments
de_de: 'data' erfordert Integer-Argumente
es: 'data' requiere argumentos de tipo entero
fil: 'data' kailangan ng integer arguments
fr: 'data' nécessite des paramètre de chiffres entiers
it_it: 'data' richiede argomenti interi
nl: 'data' vereist integer argumenten
pt_br: 'data' exige argumentos inteiros
ru: «данные» требуют целочисленных аргументов
sv: 'data' kräver heltalsargument

source: 'label' requires 1 argument
de_de: 'label' erfordert genau ein Argument
es: 'label' requiere 1 argumento
fil: 'label' kailangan ng 1 argument
fr: 'label' nécessite 1 paramètre
it_it: 'label' richiede 1 argomento
nl: 'label' vereist 1 argument
pt_br: 'label' exige 1 argumento
ru: «метка» требует 1 аргумент
sv: 'label' kräver 1 argument

source: 'return' outside function
de_de: 'return' außerhalb einer Funktion
es: 'return' fuera de una función
fil: 'return' sa labas ng function
fr: 'return' dehors d'une fonction
it_it: 'return' al di fuori della funzione
nl: 'return' buiten de functie
pt_br: função externa 'return'
ru: «возврат» внешняя функция
sv: 'return' utanför funktion

source: 'yield from' inside async function
de_de: 'yield from' innerhalb einer async Funktion
es: 'yield from' dentro de una función asincrónica
fr: 'yield from' dans une fonction async
nl: 'yield from' binnen asynchrone functie
pt_br: 'yield a partir' de dentro da função async
ru: «выход из» внутри асинхронной функции
sv: 'yield from' i async-funktion

source: 'yield' outside function
de_de: 'yield' außerhalb einer Funktion
es: 'yield' fuera de una función
fil: 'yield' sa labas ng function
fr: 'yield' dehors d'une fonction
it_it: 'yield' al di fuori della funzione
nl: 'yield' buiten de functie
pt_br: função externa 'yield'
ru: внешняя функция "выход"
sv: 'yield' utanför funktion

source: *x must be assignment target
de_de: *x muss Zuordnungsziel sein
es: *x debe ser objetivo de la tarea
fil: *x ay dapat na assignment target
fr: *x doit être la cible de l'assignement
nl: *x moet een assignment target zijn
pt_br: *x deve ser o destino da atribuição
ru: *x должно быть целью назначения
sv: *x måste vara mål för tilldelning

source: , in %q
es: , en %q
fil: , sa %q
fr: , dans %q
pt_br: , em %q
ru: , в %q
sv: , i %q

source: 0.0 to a complex power
de_de: 0.0 zu einer komplexen Potenz
es: 0.0 a una potencia compleja
fil: 0.0 para sa complex power
fr: 0.0 à une puissance complexe
it_it: 0.0 elevato alla potenza di un numero complesso
nl: 0.0 tot een complexe macht
pt_br: 0,0 para uma potência complexa
ru: 0.0 в комплексную степень
sv: 0,0 till ett komplext nummer

source: 3-arg pow() not supported
de_de: 3-arg pow() wird nicht unterstützt
es: pow() con 3 argumentos no soportado
fil: 3-arg pow() hindi suportado
fr: pow() non supporté avec 3 paramètres
it_it: pow() con tre argmomenti non supportata
nl: 3-arg pow() niet ondersteund
pt_br: 3-arg pow() não compatível
ru: Pow() с 3 аргументами не поддерживается
sv: 3-arguments pow() stöds inte

source: 64 bit types
es: tipos de 64 bit

source: A hardware interrupt channel is already in use
es: El canal EXTINT ya está siendo utilizado
fil: Isang channel ng hardware interrupt ay ginagamit na
it_it: Un canale di interrupt hardware è già in uso
nl: Een hardware interrupt kanaal is al in gebruik
pt_br: Um canal de interrupção de hardware já está em uso

source: ADC2 is being used by WiFi
es: ADC2 está siendo usado por WiFi
nl: ADC2 wordt gebruikt door WiFi

source: Address must be %d bytes long
de_de: Die Adresse muss %d Bytes lang sein
es: La dirección debe tener %d bytes de largo
fr: L'adresse doit être longue de %d octets
nl: Adres moet %d bytes lang zijn
pt_br: O endereço deve ter %d bytes de comprimento
ru: Адрес должен быть длиной %d байт
sv: Adressen måste vara %d byte lång

source: Address type out of range
es: Tipo de dirección fuera de rango
nl: Adres type buiten bereik

source: All CAN peripherals are in use
de_de: Alle CAN-Schnittstellen sind in Benutzung
es: Todos los periféricos CAN están en uso
fr: Tous les périphériques CAN sont utilisés
nl: Alle CAN-peripherals zijn in gebruik
pt_br: Todos os periféricos CAN estão em uso
ru: Все периферийные устройства CAN уже используются
sv: All CAN-kringutrustning används

source: All I2C peripherals are in use
de_de: Alle I2C-Peripheriegeräte sind in Benutzung
es: Todos los periféricos I2C están siendo usados
fil: Lahat ng I2C peripherals ginagamit
fr: Tous les périphériques I2C sont utilisés
it_it: Tutte le periferiche I2C sono in uso
nl: Alle I2C peripherals zijn in gebruik
pt_br: Todos os periféricos I2C estão em uso
ru: Все периферийные устройства I2C уже используются
sv: All I2C-kringutrustning används

source: All PCNT units in use
es: Todas las unidades PCNT en uso
nl: Alle PCNT-eenheden zijn in gebruik
pt_br: Todas as unidades PCNT estão em uso

source: All RX FIFOs in use
de_de: Alle RX FIFOs sind in Benutzung
es: Todos los FIFOs de RX en uso
fr: Tout les RX FIFOs sont utilisé
nl: Alle RX FIFO's zijn in gebruik
pt_br: Todos os FIFOs RX estão em uso
ru: Все RX FIFO уже используются
sv: Alla RX FIFO i bruk

source: All SPI peripherals are in use
de_de: Alle SPI-Peripheriegeräte sind in Benutzung
es: Todos los periféricos SPI están siendo usados
fil: Lahat ng SPI peripherals ay ginagamit
fr: Tous les périphériques SPI sont utilisés
it_it: Tutte le periferiche SPI sono in uso
nl: Alle SPI peripherals zijn in gebruik
pt_br: Todos os periféricos SPI estão em uso
ru: Все периферийные устройства SPI уже используются
sv: All SPI-kringutrustning används

source: All UART peripherals are in use
de_de: Alle UART-Peripheriegeräte sind in Benutzung
es: Todos los periféricos UART están siendo usados
fr: Tous les périphériques UART sont utilisés
nl: Alle UART peripherals zijn in gebruik
pt_br: Todos os periféricos UART estão em uso
ru: Все периферийные устройства UART уже используются
sv: Alla UART-kringutrustning används

source: All channels in use
de_de: Alle Kanäle werden verwendet
es: Todos los canales esta en uso
fr: Tout les canaux sont utilisés
pt_br: Todos os canais estão em uso
ru: Все каналы уже используются
sv: Alla kanaler används

source: All event channels in use
de_de: Alle Event-Kanäle werden benutzt
es: Todos los canales de eventos estan siendo usados
fil: Lahat ng event channels ginagamit
fr: Tous les canaux d'événements sont utilisés
it_it: Tutti i canali eventi utilizati
nl: Alle event kanalen zijn in gebruik
pt_br: Todos os canais de eventos em uso
ru: Все каналы событий уже используются
sv: Alla händelsekanaler används

source: All state machines in use
de_de: Alle State-Maschinen in Verwendung
es: Todas las máquinas de estado en uso
fr: Tous les automates finis sont utilisés
pt_br: O estado de todas as máquinas em uso
ru: Все машины состояний уже используются
sv: Alla tillståndsmaskiner används

source: All sync event channels in use
de_de: Alle Sync Event-Kanäle werden benutzt
es: Todos los canales de eventos de sincronización (sync event channels) están siendo utilizados
fil: Lahat ng sync event channels ay ginagamit
fr: Tout les canaux d'événements sync sont utilisés
it_it: Tutti i canali di eventi sincronizzati in uso
nl: Alle sync event kanalen zijn in gebruik
pt_br: Todos os canais dos eventos de sincronização em uso
ru: Все каналы событий синхронизации уже используются
sv: Alla synkroniseringskanaler används

source: All timers for this pin are in use
de_de: Alle Timer für diesen Pin werden bereits benutzt
es: Todos los timers para este pin están siendo utilizados
fil: Lahat ng timers para sa pin na ito ay ginagamit
fr: Tous les minuteurs pour cette broche sont utilisés
it_it: Tutti i timer per questo pin sono in uso
nl: Alle timers voor deze pin zijn in gebruik
pt_br: Todos os temporizadores para este pino estão em uso
ru: Все таймеры для этого пина уже используются
sv: Alla timers för denna pinne är i bruk

source: All timers in use
de_de: Alle Timer werden benutzt
es: Todos los timers en uso
fil: Lahat ng timer ginagamit
fr: Tous les minuteurs sont utilisés
it_it: Tutti i timer utilizzati
nl: Alle timers zijn in gebruik
pt_br: Todos os temporizadores em uso
ru: Все таймеры уже используются
sv: Alla timers används

source: Already advertising.
de_de: Bereits am Anbieten (advertising).
es: Ya se encuentra publicando.
fr: S'annonce déjà.
nl: Advertising is al bezig.
pt_br: Já está anunciando.
ru: Уже реклама.
sv: Annonserar redan.
