Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: Only Windows format, uncompressed BMP supported %d
fil: Tanging Windows format, uncompressed BMP lamang ang supportado %d
it_it: Formato solo di Windows, BMP non compresso supportato %d

source: Only bit maps of 8 bit color or less are supported
fil: Tanging bit maps na may 8 bit color o mas mababa ang supportado
it_it: Sono supportate solo bitmap con colori a 8 bit o meno

source: Only tx supported on UART1 (GPIO2).
fil: Tanging suportado ang TX sa UART1 (GPIO2).
it_it: Solo tx supportato su UART1 (GPIO2).

source: PWM not supported on pin %d
fil: Walang PWM support sa pin %d
it_it: PWM non è supportato sul pin %d

source: Pin %q does not have ADC capabilities
fil: Walang kakayahang ADC ang pin %q
it_it: Il pin %q non ha capacità ADC

source: Pin(16) doesn't support pull
fil: Walang pull support ang Pin(16)
it_it: Pin(16) non supporta pull

source: Pins not valid for SPI
fil: Mali ang pins para sa SPI
it_it: Pin non validi per SPI

source: Press any key to enter the REPL. Use CTRL-D to reload.
fil: Pindutin ang anumang key upang pumasok sa REPL. Gamitin ang CTRL-D upang i-reload.
it_it: Premi un qualunque tasto per entrare nel REPL. Usa CTRL-D per ricaricare.

source: Running in safe mode! Auto-reload is off.
fil: Tumatakbo sa safe mode! Awtomatikong pag re-reload ay OFF.
it_it: Modalità sicura in esecuzione! Auto-reload disattivato.

source: SDA or SCL needs a pull up
fil: Kailangan ng pull up resistors ang SDA o SCL
it_it: SDA o SCL necessitano un pull-up

source: STA must be active
fil: Dapat aktibo ang STA
it_it: STA deve essere attiva

source: STA required
fil: STA kailangan
it_it: STA richiesta

source: The CircuitPython heap was corrupted because the stack was too small. Please increase stack size limits and press reset (after ejecting CIRCUITPY). If you didn't change the stack, then file an issue here with the contents of your CIRCUITPY drive:
fil: Ang CircuitPython heap ay na corrupt dahil ang stack ay maliit. Maaring i-increase ang stack size limit at i-press ang reset (pagkatapos i-eject ang CIRCUITPY. Kung hindi mo pinalitan ang stack, mag file ng issue dito kasama ng laman ng CIRCUITPY drive:

source: The microcontroller's power dipped. Please make sure your power supply provides enough power for the whole circuit and press reset (after ejecting CIRCUITPY).
fil: Ang kapangyarihan ng mikrokontroller ay bumaba. Mangyaring suriin ang power supply pindutin ang reset (pagkatapos i-eject ang CIRCUITPY).

source: The reset button was pressed while booting CircuitPython. Press again to exit safe mode.
fil: Ang reset button ay pinindot habang nag boot ang CircuitPython. Pindutin ulit para lumabas sa safe mode.

source: UART(%d) does not exist
fil: Walang UART(%d)
it_it: UART(%d) non esistente

source: UART(1) can't read
fil: Hindi mabasa ang UART(1)
it_it: UART(1) non leggibile

source: USB Busy
fil: Busy ang USB
it_it: USB occupata

source: USB Error
fil: May pagkakamali ang USB
it_it: Errore USB

source: Unable to remount filesystem
fil: Hindi ma-remount ang filesystem
it_it: Imposssibile rimontare il filesystem

source: Unknown type
fil: Hindi alam ang type
it_it: Tipo sconosciuto

source: Use esptool to erase flash and re-upload Python instead
fil: Gamitin ang esptool upang burahin ang flash at muling i-upload ang Python
it_it: Usa esptool per cancellare la flash e ricaricare Python invece

source: Viper functions don't currently support more than 4 arguments
fil: Ang mga function ng Viper ay kasalukuyang hindi sumusuporta sa higit sa 4 na argumento
it_it: Le funzioni Viper non supportano più di 4 argomenti al momento

source: Voice index too high
fil: Index ng Voice ay masyadong mataas

source: You are running in safe mode which means something unanticipated happened.
fil: Ikaw ay tumatakbo sa safe mode dahil may masamang nangyari.

source: address %08x is not aligned to %d bytes
fil: address %08x ay hindi pantay sa %d bytes
it_it: l'indirizzo %08x non è allineato a %d bytes

source: bits must be 7, 8 or 9
fil: bits ay dapat 7, 8 o 9
it_it: i bit devono essere 7, 8 o 9

source: bits must be 8
fil: bits ay dapat walo (8)
it_it: i bit devono essere 8

source: buffer must be a bytes-like object
fil: buffer ay dapat bytes-like object

source: buffer too long
fil: masyadong mahaba ng buffer
it_it: buffer troppo lungo

source: buffers must be the same length
fil: ang buffers ay dapat parehas sa haba
it_it: i buffer devono essere della stessa lunghezza

source: byte code not implemented
fil: byte code hindi pa implemented
it_it: byte code non implementato

source: can only save bytecode
fil: maaring i-save lamang ang bytecode
it_it: È possibile salvare solo bytecode

source: can query only one param
fil: maaaring i-query lamang ang isang param
it_it: è possibile interrogare solo un parametro

source: can't convert address to int
fil: hindi ma i-convert ang address sa INT
it_it: impossible convertire indirizzo in int

source: can't get AP config
fil: hindi makuha ang AP config
it_it: impossibile recuperare le configurazioni dell'AP

source: can't get STA config
fil: hindi makuha ang STA config
it_it: impossibile recuperare la configurazione della STA

source: can't pend throw to just-started generator
fil: hindi mapadala ang send throw sa isang kaka umpisang generator

source: can't set AP config
fil: hindi makuha ang AP config
it_it: impossibile impostare le configurazioni dell'AP

source: can't set STA config
fil: hindi makuha ang STA config
it_it: impossibile impostare le configurazioni della STA

source: color buffer must be a buffer or int
fil: color buffer ay dapat buffer or int
it_it: il buffer del colore deve essere un buffer o un int

source: either pos or kw args are allowed
fil: pos o kw args ang pinahihintulutan
it_it: sono permesse solo gli argomenti pos o kw

source: expected a DigitalInOut
fil: umasa ng DigitalInOut
it_it: DigitalInOut atteso

source: expecting a pin
fil: umaasa ng isang pin
it_it: pin atteso

source: firstbit must be MSB
fil: firstbit ay dapat MSB
it_it: il primo bit deve essere il più significativo (MSB)

source: flash location must be below 1MByte
fil: dapat na mas mababa sa 1MB ang lokasyon ng flash
it_it: Locazione della flash deve essere inferiore a 1mb

source: frequency can only be either 80Mhz or 160MHz
fil: ang frequency ay dapat 80Mhz or 160MHz lamang
it_it: la frequenza può essere o 80Mhz o 160Mhz

source: function does not take keyword arguments
fil: ang function ay hindi kumukuha ng mga argumento ng keyword
it_it: la funzione non prende argomenti nominati

source: impossible baudrate
fil: impossibleng baudrate
it_it: baudrate impossibile

source: invalid I2C peripheral
fil: maling I2C peripheral
it_it: periferica I2C invalida

source: invalid SPI peripheral
fil: hindi wastong SPI peripheral
it_it: periferica SPI invalida

source: invalid alarm
fil: mali ang alarm
it_it: alarm non valido

source: invalid buffer length
fil: mali ang buffer length
it_it: lunghezza del buffer non valida

source: invalid data bits
fil: mali ang data bits
it_it: bit dati invalidi

source: invalid dupterm index
fil: mali ang dupterm index
it_it: indice dupterm non valido

source: invalid pin
fil: mali ang pin
it_it: pin non valido

source: invalid stop bits
fil: mali ang stop bits
it_it: bit di stop invalidi

source: len must be multiple of 4
fil: len ay dapat multiple ng 4
it_it: len deve essere multiplo di 4

source: memory allocation failed, allocating %u bytes for native code
fil: nabigo ang paglalaan ng memorya, naglalaan ng %u bytes para sa native code
it_it: allocazione di memoria fallita, allocazione di %d byte per codice nativo

source: must specify all of sck/mosi/miso
fil: dapat tukuyin lahat ng SCK/MOSI/MISO
it_it: è necessario specificare tutte le sck/mosi/miso

source: name reused for argument
fil: name muling ginamit para sa argument
it_it: nome riutilizzato come argomento

source: not a valid ADC Channel: %d
fil: hindi tamang ADC Channel: %d
it_it: canale ADC non valido: %d

source: object '%s' is not a tuple or list
fil: object '%s' ay hindi tuple o list
it_it: oggetto '%s' non è una tupla o una lista

source: object does not support item assignment
fil: ang object na '%s' ay hindi maaaring i-subscript

source: object does not support item deletion
fil: ang object ay hindi sumusuporta sa pagbura ng item

source: object is not subscriptable
fil: ang bagay ay hindi maaaring ma-subscript

source: parameter annotation must be an identifier
fil: parameter annotation ay dapat na identifier

source: pin does not have IRQ capabilities
fil: walang IRQ capabilities ang pin
it_it: il pin non implementa IRQ

source: pop from an empty set
fil: pop sa walang laman na set
it_it: pop da un set vuoto

source: pop from empty list
fil: pop galing sa walang laman na list
it_it: pop da una lista vuota

source: popitem(): dictionary is empty
fil: popitem(): dictionary ay walang laman
it_it: popitem(): il dizionario è vuoto

source: position must be 2-tuple
fil: position ay dapat 2-tuple
it_it: position deve essere una 2-tuple

source: row must be packed and word aligned
fil: row ay dapat packed at ang word nakahanay
it_it: la riga deve essere compattata e allineata alla parola

source: scan failed
fil: nabigo ang pag-scan
it_it: scansione fallita

source: schedule stack full
fil: puno na ang schedule stack

source: struct: cannot index
fil: struct: hindi ma-index
it_it: struct: impossibile indicizzare

source: time.struct_time() takes exactly 1 argument
fil: time.struct_time() kumukuha ng 1 argument
it_it: time.struct_time() prende esattamente un argomento

source: timeout >100 (units are now seconds, not msecs)
fil: timeout >100 (units ay seconds, hindi na msecs)

source: too many arguments
fil: masyadong maraming argumento
it_it: troppi argomenti

source: tuple index out of range
fil: indeks ng tuple wala sa sakop
it_it: indice della tupla fuori intervallo

source: unknown config param
fil: hindi alam na config param
it_it: parametro di configurazione sconosciuto

source: unknown format code '%c' for object of type '%s'
fil: hindi alam ang format code '%c' para sa object na ang type ay '%s'
it_it: codice di formattaione '%c' sconosciuto per oggetto di tipo '%s'

source: unknown format code '%c' for object of type 'float'
fil: hindi alam ang format code '%c' sa object na ang type ay 'float'
it_it: codice di formattazione '%c' sconosciuto per oggetto di tipo 'float'

source: unknown format code '%c' for object of type 'str'
fil: hindi alam ang format ng code na '%c' para sa object ng type ay 'str'
it_it: codice di formattazione '%c' sconosciuto per oggetto di tipo 'str'

source: unknown status param
fil: hindi alam na status param
it_it: prametro di stato sconosciuto

source: unsupported bitmap type
fil: Hindi supportadong tipo ng bitmap
it_it: tipo di bitmap non supportato

source: unsupported types for %q: '%s', '%s'
fil: hindi sinusuportahang type para sa %q: '%s', '%s'
it_it: tipi non supportati per %q: '%s', '%s'

source: wifi_set_ip_info() failed
fil: nabigo ang wifi_set_ip_info()
it_it: wifi_set_ip_info() faillito

source: You are running in safe mode which means something really bad happened.
it_it: Sei nella modalità sicura che significa che qualcosa di molto brutto è successo.

source: Looks like our core CircuitPython code crashed hard. Whoops!
it_it: Sembra che il codice del core di CircuitPython sia crashato malamente. Whoops!

source: Please file an issue here with the contents of your CIRCUITPY drive:
it_it: Ti preghiamo di compilare una issue con il contenuto del tuo drie CIRCUITPY:

source: The microcontroller's power dipped. Please make sure your power supply provides
it_it: La potenza del microcontrollore è calata. Assicurati che l'alimentazione sia attaccata correttamente

source: enough power for the whole circuit and press reset (after ejecting CIRCUITPY).
it_it: abbastanza potenza per l'intero circuito e premere reset (dopo aver espulso CIRCUITPY).

source: Not enough pins available
it_it: Non sono presenti abbastanza pin

source: C-level assert
it_it: assert a livello C

source: Invalid UUID string length
it_it: Lunghezza della stringa UUID non valida

source: Invalid UUID parameter
it_it: Parametro UUID non valido

source: Can not get temperature. status: 0x%02x
it_it: Impossibile leggere la temperatura. status: 0x%02x

source: [addrinfo error %d]
it_it: [errore addrinfo %d]

source: row buffer must be a bytearray or array of type 'b' or 'B'
it_it: buffer di riga deve essere un bytearray o un array di tipo 'b' o 'B'

source: row data must be a buffer
it_it: valori della riga devono essere un buffer

source: Group must have size at least 1
it_it: Il gruppo deve avere dimensione almeno 1

source: index must be int
it_it: l'indice deve essere int

source: Group empty
it_it: Gruppo vuoto

source: Only true color (24 bpp or higher) BMP supported %x
it_it: Solo BMP true color (24 bpp o superiore) sono supportati %x
