Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: Only one %q can be set in deep sleep.
de_de: Nur ein %q kann im Deep-Sleep gesetzt werden.
fr: Une seul %q autorisée en sommeil profond.
pt_br: Apenas um %q pode ser colocado em hibernação profunda.
ru: Только один %q может быть переведен в режим глубокого сна.
sv: Endast en %q kan sättas i djup sömn.

source: Only one %q can be set.
de_de: Es kann nur ein %q festgelegt werden.
fr: Un seul %q peut être défini.
pt_br: Apenas um %q pode ser definido.
ru: Можно установить только один %q.
sv: Endast en %q kan ställas in.

source: Only one address is allowed
de_de: Nur eine Adresse ist erlaubt
fr: Seulement une adresse est autorisée
pt_br: Apenas um endereço é permitido
ru: Разрешен только один адрес
sv: Endast en adress är tillåten

source: Only one alarm.time alarm can be set
de_de: Nur ein alarm.time Alarm kann gesetzt werden
fr: Seule une alarme alarm.time peut être définie
pt_br: Apenas um alarme alarm.time pode ser definido
ru: Можно установить только один будильник
sv: Endast ett alarm.time-larm kan ställas in

source: Operation not permitted
de_de: Operation nicht erlaubt
fr: Cette opération n'est pas permise
pt_br: A operação não é permitida
ru: Операция не разрешена
sv: Åtgärden inte tillåten

source: Out of MDNS service slots
de_de: Keine freien Slots für MDNS-Dienst mehr verfügbar
fr: À cours de services MDNS
pt_br: Sem slots do serviço MDNS
ru: Отсутствуют сервисные слоты MDNS
sv: Slut på MDNS-serviceplatser

source: PWM restart
de_de: PWM Neustart
fr: Redémarrage PWM
pt_br: Reinício do PWM
ru: PWM перезагрузка
sv: PWM omstart

source: Pins must be sequential GPIO pins
de_de: Pins müssen geordnete GPIO-Pins sein
fr: Les broches doivent être des broches GPIO à la suite
pt_br: Pinos devem ser pinos GPIO sequenciais
ru: Пины должны быть последовательными выводами GPIO
sv: Pins måste vara sekventiella GPIO-pinnar

source: Pipe error
fr: Erreur de transfert
pt_br: Erro de pipe
ru: Ошибка трубопровода
sv: Pipe-fel

source: Power dipped. Make sure you are providing enough power.
de_de: Die Stromversorgung ist abgesackt. Stelle sicher, dass du genug Strom bereitstellst.
fr: Chute de puissance. Assurez-vous de fournir suffisament de puissance.
pt_br: Falta de energia. Certifique-se que está fornecendo energia suficiente.
ru: Мощность просела. Убедитесь, что вы обеспечиваете достаточную мощность.
sv: Spänningen sjönk. Se till att du ger tillräckligt med ström.

source: Program too long
de_de: Programm zu lang
fr: Programme trop long
pt_br: Programa muito longo
ru: Слишком длинная программа
sv: Programmet är för långt

source: RISE_AND_FALL not available on this chip
de_de: RISE_AND_FALL ist auf diesem Chip nicht verfügbar
fr: RISE_AND_FALL n'est pas disponible sur cette puce
pt_br: RISE_AND_FALL não está disponível neste chip
ru: RISE_AND_FALL недоступен на этом чипе
sv: RISE_AND_FALL är inte tillgängligt på detta chip

source: Reconnecting
de_de: Wiederherstellung der Verbindungen
fr: Reconnexion
pt_br: Reconectando
ru: Повторное соединение
sv: Återansluter

source: SDCard init
de_de: SDCard-Initialisierung
fr: Initialisation SDCard
pt_br: Inicialização do cartão SD
ru: Инициализация SD-карты
sv: SDCard start

source: SPI init error
de_de: SPI-Initialisierungsfehler
fr: Erreur d'initialisation SPI
pt_br: Erro de inicialização do SPI
ru: Ошибка инициализации SPI
sv: SPI-initieringsfel

source: SPI re-init
de_de: SPI wird erneut initialisiert
fr: Ré-initialisation du SPI
pt_br: Reinicialização do SPI
ru: Повторная инициализация SPI
sv: SPI omstart

source: Scale dimensions must divide by 3
de_de: Maßstabs-Abmeßungen müssen durch 3 teilbar sein
fr: La dimension d'échelle doit être un multiple de 3
pt_br: As dimensões da escala devem ser poder ser divididas por 3
ru: Размеры шкалы необходимо разделить на 3
sv: Skaldimension måste vara delbar med 3

source: Scan already in progress. Stop with stop_scan.
de_de: Scan läuft schon. Stoppen mit stop_scan.
fr: Scan déjà en cours. Arrêtez-le avec stop_scan.
pt_br: Digitalização já em andamento. Pare com stop_scan.
ru: Сканирование уже выполняется. Остановитесь на stop_scan.
sv: Skanning pågår redan. Stoppa med stop_scan.

source: Specify exactly one of data0 or data_pins
de_de: Gib genau einen von data0 oder data_pins an
fr: Spécifiez une unique broche parmi data0 ou data_pins
pt_br: Especifique exatamente um do data0 ou do data_pins
ru: Укажите точно один из data0 или data_pins
sv: Ange en av data0 eller data_pins

source: The `microcontroller` module was used to boot into safe mode.
de_de: Das 'microcontroller'-Modul wurde benutzt, um in den Sichheitsmodus zu booten.
fr: Le module microcontroller a été utilisé pour démarrer en mode sûr.
pt_br: O módulo `microcontroller` foi usado para inicializar em modo de segurança.
ru: Модуль «микроконтроллер» использовался для загрузки в безопасном режиме.
sv: Modulen `microcontroller` användes för att starta i felsäkert läge.

source: The above exception was the direct cause of the following exception:
de_de: Die oben genannte Ausnahme war die direkte Ursache für die folgende Ausnahme:
fr: L'exception précédente est la cause directe de l'exception suivante:
pt_br: A exceção acima foi a causa direta da seguinte exceção:
ru: Вышеупомянутое исключение было непосредственной причиной следующего исключения:
sv: Ovanstående undantag var den direkta orsaken till följande undantag:

source: Third-party firmware fatal error.
de_de: Fataler Fehler bei Drittanbieter-Firmware.
fr: Erreur fatale de logiciel système tierce partie.
pt_br: Erro fatal no firmware de terceiros.
ru: Неустранимая ошибка прошивки стороннего производителя.
sv: Fel från firmware från tredje part.

source: This microcontroller does not support continuous capture.
de_de: Dieser Mikrocontroller unterstützt keine kontinuierliche Erfassung.
fr: Ce microcontrôleur ne support pas la capture continue.
pt_br: Este microcontrolador não tem suporte para captura contínua.
ru: Этот микроконтроллер не поддерживает непрерывный захват.
sv: Den här mikrokontrollern stöder inte kontinuerlig insamling.

source: This microcontroller only supports data0=, not data_pins=, because it requires contiguous pins.
de_de: Dieser Mikrocontroller unterstützt nur data0=, nicht data_pins=, da er zusammenhängende Pins benötigt.
fr: Ce microcontrôleur supporte uniquement data0=, et non data_pins=, parce qu'il nécessite des broches adjacentes.
pt_br: Este microcontrolador só suporta data0=, não data_pins=, porque requer pinos contíguos.
ru: Этот микроконтроллер поддерживает только data0=, а не data_pins=, поскольку для него требуются смежные выводы.
sv: Den här mikrokontrollern stöder endast data0=, inte data_pins=, eftersom det kräver sammanhängande stift.

source: Too many channels in sample
de_de: Zu viele Kanäle im Beispiel
fr: Trop de canaux dans l'échantillon
pt_br: Muitos canais na amostra
ru: Слишком много каналов в выборке
sv: För många kanaler i urvalet

source: Too many display busses; forgot displayio.release_displays() ?
de_de: Zu viele Display-Busse, displayio.release_displays() vergessen?
fr: Bus d'affichage trop nombreux; oubli de displayio.release_displays() ?
pt_br: Excesso de barramentos de exibição; esqueceu do displayio.release_displays() ?
ru: Слишком много шин дисплея; забыл displayio.release_displays()?
sv: För många displaybussar; glömt displayio.release_displays() ?

source: UART de-init
de_de: UART wird de-initialisiert
fr: Dé-initialisation du UART
pt_br: descontinuar o início UART
ru: Деинициализация UART
sv: UART omstart

source: UART init
de_de: UART-Initialisierung
fr: Initialisation UART
pt_br: inicialização do UART
ru: Инициализация UART
sv: UART start

source: UART peripheral in use
de_de: UART-Endgerät in Benutzung
fr: Périphérique UART utilisé
pt_br: Periférico UART em uso
ru: Используемое периферийное устройство UART
sv: UART-enhet används redan

source: UART re-init
de_de: UART wird erneut Initialisiert
fr: Ré-initialisation du UART
pt_br: Reinicialização do UART
ru: Повторная инициализация UART
sv: UART omstart

source: UART write
de_de: UART wird geschrieben
fr: Écriture UART
pt_br: Escrita UART
ru: Запись UART
sv: UART-skrivning

source: Unable to access unaligned IO register
fr: Impossible d'accéder au registre IO non aligné
pt_br: Não foi possível acessar o registro IO não solicitado
ru: Невозможно получить доступ к невыровненному регистру ввода-вывода
sv: Kan inte komma åt ojusterat IO-register

source: Unable to allocate to the heap.
pt_br: Não é possível alocar a área de alocação dinâmica de variáveis.
sv: Kan inte allokera heap.

source: Unable to start mDNS query
de_de: mDNS-Abfrage kann nicht gestartet werden
fr: Impossible de lancer la requête mDNS
pt_br: Não é possível iniciar a consulta mDNS
ru: Не удается запустить запрос mDNS
sv: Det gick inte att starta mDNS-frågan

source: Unable to write to read-only memory
de_de: schreibgeschützter Speicher kann nicht beschrieben werden
fr: Impossible d'écrire sur la mémoire en lecture seule
pt_br: Não foi possível escrever na memória de somente leitura
ru: Невозможно записать в постоянную память
sv: Kan inte skriva till skrivskyddat minne

source: Unknown BLE error at %s:%d: %d
de_de: Unbekannter BLE-Fehler bei %s:%d: %d
fr: Erreur BLE inconnue à %s:%d : %d
pt_br: Houve um erro BLE desconhecido em %s:%d: %d
ru: Неизвестная ошибка BLE в %s:%d: %d
sv: Okänt BLE-fel vid %s:%d: %d

source: Unknown BLE error: %d
de_de: Unbekannter BLE-Fehler: %d
fr: Erreur BLE inconnue : %d
pt_br: Houve um erro BLE desconhecido: %d
ru: Неизвестная ошибка BLE: %d
sv: Okänt BLE-fel: %d

source: Unknown error code %d
de_de: Unbekannter Fehlercode %d
fr: Code d'erreur inconnu %d
pt_br: Código de erro desconhecido %d
ru: Неизвестный код ошибки %d
sv: Okänd felkod %d

source: Unknown system firmware error at %s:%d: %d
de_de: Unbekannter System-Firmware-Fehler bei %s:%d: %d
fr: Erreur du logiciel système inconnue à %s:%d : %d
pt_br: Ocorreu um erro desconhecido no firmware do sistema em %s:%d: %d
ru: Неизвестная системная ошибка прошивки на %s:%d: %d
sv: Okänt fel i systemets firmware vid %s:%d: %d

source: Unknown system firmware error: %d
de_de: Unbekannter System-Firmware-Fehler: %d
fr: Erreur du logiciel système inconnue : %d
pt_br: Ocorreu um erro desconhecido no firmware do sistema: %d
ru: Неизвестная ошибка прошивки системы: %d
sv: Okänt fel i systemets firmware: %d

source: Unsupported colorspace
de_de: Nicht unterstützter Farbraum
fr: Espace de couleur non supporté
pt_br: Espaço de cor não compatível
ru: Неподдерживаемое цветовое пространство
sv: Färgrymd stöds inte

source: Unsupported hash algorithm
de_de: Hash Algorithmus wird nicht unterstützt
fr: Algorithme de hachage non supporté
pt_br: Sem compatibilidade com o algoritmo de hash
ru: Неподдерживаемый алгоритм хеширования
sv: Hash-algoritmen stöds inte

source: Welcome to Adafruit CircuitPython %s! Visit circuitpython.org for more information. To list built-in modules type `help("modules")`.
de_de: Willkommen bei Adafruit CircuitPython %s! Besuche circuitpython.org für mher Information. Um die vorhandenen Module anzuzeigen, gebe `help("modules")` ein.
fr: Bienvenue sur Adafruit CircuitPython %s ! Plus d'informations sur circuitpython.org. Pour lister les modules internes, entrez `help("modules")`.
pt_br: Bem-vindo ao Adafruit CircuitPython %s! Visite o site circuitpython.org para obter mais informações. Para listar os módulos existente digite `help("modules")`.
ru: Добро пожаловать в Adafruit CircuitPython %s! Посетите circuitpython.org для получения дополнительной информации. Чтобы получить список встроенных модулей, введите 'help("modules")'.
sv: Välkommen till Adafruit CircuitPython %s! Besök circuitpython.org för mer information. För att lista inbyggda moduler skriver du `help("modules")`.

source: Wifi is not enabled
de_de: WLAN ist nicht aktiviert
fr: Le wifi n'est pas activé
pt_br: O Wi-Fi não está ativado
ru: Wifi не включен
sv: WiFi är inte aktiverat

source: You pressed both buttons at start up.
de_de: Beide Knöpfe wurden beim Starten gedrückt.
fr: Vous avez appuyé les deux boutons au démarrage.
pt_br: Você pressionou os dois botões durante a inicialização.
ru: Вы нажали обе кнопки при запуске.
sv: Du tryckte ner båda knapparna vid start.

source: You pressed button A at start up.
de_de: Knopf A wurde beim Starten gedrückt.
fr: Vous avez appuyé le bouton A au démarrage.
pt_br: Você pressionou o botão A na inicialização.
ru: Вы нажали кнопку A при запуске.
sv: Du tryckte ner knapp A vid start.

source: You pressed button DOWN at start up.
de_de: Der DOWN-Knopf wurde beim Starten gedrückt.
fr: Vous avez appuyé sur le bouton DOWN au démarrage.
pt_br: Você pressionou o botão DOWN na inicialização.
ru: Вы нажали кнопку ВНИЗ при запуске.
sv: Du tryckte ner knapp NER vid start.

source: You pressed the BOOT button at start up
de_de: Der BOOT-Knopf wurde beim Starten gedrückt
fr: Vous avez appuyé le bouton BOOT au démarrage
pt_br: Você pressionou o botão BOOT na inicialização
ru: Вы нажали кнопку BOOT при запуске
sv: Du tryckte ner BOOT-knappen vid start

source: You pressed the GPIO0 button at start up.
de_de: Der GPIO0-Knopf wurde beim Starten gedrückt.
fr: Vous avez appuyé le bouton GPIO0 au démarrage.
pt_br: Você pressionou o botão GPIO0 durante a inicialização.
ru: Вы нажали кнопку GPIO0 при запуске.
sv: Du tryckte på GPIO0-knappen vid start.

source: You pressed the Rec button at start up.
de_de: Der Rec-Knopf wurde beim Starten gedrückt.
fr: Vous avez appuyé sur le bouton Rec au démarrage.
pt_br: Você pressionou o botão Rec durante a inicialização.
ru: Вы нажали кнопку «Запись» при запуске.
sv: Du tryckte ned Rec-knappen vid start.

source: You pressed the SW38 button at start up.
de_de: Der SW38-Knopf wurde beim Starten gedrückt.
fr: Vous avez appuyé le bouton SW38 au démarrage.
pt_br: Você pressionou o botão SW38 na inicialização.
ru: Вы нажали кнопку SW38 при запуске.
sv: Du tryckte ned SW38-knappen vid start.

source: You pressed the VOLUME button at start up.
de_de: Der VOLUME-Knopf wurde beim Starten gedrückt.
fr: Vous avez appuyé le bouton VOLUME au démarrage.
pt_br: Você pressionou o botão VOLUME na inicialização.
ru: Вы нажали кнопку ГРОМКОСТЬ при запуске.
sv: Du tryckte ned VOLYM-knappen vid start.

source: You pressed the central button at start up.
de_de: Der zentrale Knopf wurde beim Starten gedrückt.
fr: Vous avez appuyé le bouton central au démarrage.
pt_br: Você pressionou o botão central na inicialização.
ru: Вы нажали центральную кнопку при запуске.
sv: Du tryckte ned mittknappen vid start.

source: You pressed the left button at start up.
de_de: Der linke Knopf wurde beim Starten gedrückt.
fr: Vous avez appuyé le bouton gauche au démarrage.
pt_br: Você pressionou o botão esquerdo na inicialização.
ru: Вы нажали левую кнопку при запуске.
sv: Du tryckte ned vänster knapp vid start.

source: You pressed the reset button during boot.
de_de: Der Reset-Knopf wurde beim Booten gedrückt.
fr: Vous avez appuyé le bouton reset au démarrage.
pt_br: Você pressionou o botão de reinicialização durante a inicialização.
ru: Вы нажали кнопку сброса во время загрузки.
sv: Du tryckte på reset-knappen under uppstart.

source: [truncated due to length]
de_de: [abgeschnitten wegen der Länge]
fr: [taille limite atteinte]
pt_br: [truncado devido ao comprimento]
ru: [отрезается по длине]
sv: [trunkerad på grund av längd]

source: __init__() should return None, not '%s'
de_de: __init__() sollte None zurückgeben, nicht '%s'
fil: __init__() dapat magbalink na None, hindi '%s'
fr: __init__() doit retourner None, pas '%s'
it_it: __init__() deve ritornare None, non '%s'
pt_br: O __init__() deve retornar Nenhum, não '%s'
sv: __init __ () ska returnera None, inte '%s'

source: arange: cannot compute length
de_de: arange: kann Länge nicht berechnen
fr: arrange: impossible de calculer la longueur
pt_br: arange: não é possível calcular o comprimento
ru: arange: не удается вычислить длину
sv: arange: kan inte beräkna längd

source: array has too many dimensions
de_de: Das Array hat zu viele Dimensionen
fr: la tableau à trop de dimensions
pt_br: a matriz possui muitas dimensões
ru: Массив имеет слишком много измерений
sv: array har för många dimensioner

source: array is too big
de_de: Array ist zu groß
fr: array trop grand
pt_br: a array é grande demais
ru: массив слишком велик
sv: matrisen är för stor

source: asm overflow
fr: débordement asm
pt_br: estouro asm
ru: Переполнение ASM

source: async for/with outside async function
de_de: asynchrones for/with ausserhalb einer asynchronen Funktion
fr: async for/with utilisé hors d'une fonction async
pt_br: assíncrono para/com a função assíncrona externa
sv: async for/with utanför async-function

source: attributes not supported
de_de: Attribute werden nicht unterstützt
fr: attributs non pris en charge
pt_br: atributos não compatíveis
sv: Attribut stöds ej

source: background value out of range of target
de_de: Hintergrundwert außerhalb des Zielbereichs
fr: la valeur du fond est hors de l'intervalle de la cible
pt_br: valor de fundo fora do intervalo do alvo
ru: Фоновое значение вне диапазона цели
sv: värde för bakgrund utanför målintervall

source: bitmap sizes must match
de_de: Bitmap-Größen müssen übereinstimmen
fr: les tailles des images doivent correspondre
pt_br: os tamanhos do bitmap devem coincidir
ru: Размеры растровых изображений должны совпадать
sv: bitmappsstorlekar måste matcha

source: bytecode overflow
pt_br: estouro bytecode
ru: Переполнение байт-кода

source: can only have one parent
de_de: kann nur ein Elternteil haben
fr: ne peut avoir qu'un seul parent
pt_br: pode ter apenas um principal
ru: может иметь только одного родителя
sv: kan bara ha en förälder

source: can only specify one unknown dimension
de_de: nur eine einzige unbekannte Dimension kann angegeben werden
fr: une seule dimension inconnue est autorisée
pt_br: só é possível definir uma dimensão desconhecida
ru: Можно указать только одно неизвестное измерение
sv: kan enbart ange en okänd dimension

source: can't convert %s to float
de_de: kann %s nicht nach float konvertieren
fil: hindi ma-convert %s sa int
fr: ne peut convertir %s en nombre à virgule flottante 'float'
it_it: non è possibile convertire %s a float
pt_br: Não é possível converter %s para float
ru: не могу преобразовать %s в число с плавающей запятой
sv: kan inte konvertera %s till float

source: can't convert %s to int
de_de: kann %s nicht nach int konvertieren
fil: hindi ma-convert %s sa int
fr: ne peut convertir %s en entier 'int'
it_it: non è possibile convertire %s a int
pt_br: Não é possível converter %s para int
sv: kan inte konvertera %s till int

source: can't convert NaN to int
fil: hindi ma i-convert NaN sa int
it_it: impossibile convertire NaN in int
pt_br: Não é possível converter NaN para int

source: can't convert complex to float
de_de: Complex kann nicht in Float konvertiert werden
fr: ne peut convertir un complexe en flottant
pt_br: não foi possível converter complexo em flutuante
ru: Не может преобразовать сложный в плавающий
sv: kan inte konvertera complex till float

source: can't convert inf to int
fil: hindi ma i-convert inf sa int
it_it: impossibile convertire inf in int
pt_br: não é possível converter inf para int

source: can't convert to float
de_de: kann nicht nach float konvertieren
fil: hindi ma-convert sa float
fr: ne peut convertir en nombre à virgule flottante 'float'
it_it: non è possibile convertire a float
pt_br: não é possível converter para float
ru: Не удается преобразовать в float
sv: kan inte konvertera till float

source: can't import name %q
de_de: Name %q kann nicht importiert werden
fr: le nom %q ne peut être importé
pt_br: não é possível importar o nome %q
sv: Kan inte importera namn %q

source: can't perform relative import
de_de: kann keinen relativen Import durchführen
fr: ne peut importer relativement
pt_br: não é possível realizar a importação relativa
ru: Не удается выполнить относительный импорт
sv: kan inte utföra relativ import

source: can't set attribute '%q'
de_de: Attribut '%q' kann nicht gesetzt werden
fr: attribut '%q' non modifiable
pt_br: não é possível definir o atributo '%q'
ru: Не удается установить атрибут '%q'
sv: kan inte sätta attribut '%q'

source: can't truncate-divide a complex number
fr: un nombre complexe ne peut pas être tronqué/divisé
pt_br: não é possível truncar-dividir um número complexo
sv: kan inte trunker-dividera ett komplext tal

source: can't unambiguously get sizeof scalar
pt_br: não é possível obter de forma inequívoca o tamanho do escalar
sv: kan inte entydigt få fram storleken på skalären

source: can't wait
de_de: kann nicht warten
fr: impossible de mettre en attente
pt_br: não vejo a hora
ru: не может ждать
sv: kan inte vänta

source: cannot assign new shape
de_de: Kann neue shape nicht zuweisen
fr: ne peut assigner une nouvelle forme
pt_br: não é possível atribuir uma nova forma
ru: Не удается назначить новую фигуру
sv: kan inte tilldela en ny form

source: cannot convert complex to dtype
de_de: kann Komplex nicht in dtype konvertieren
fr: ne peut convertir un complexe en dtype
pt_br: não foi possível converter complexo em dtype
ru: не может превратить комплекс в dtype
sv: kan inte konvertera komplex till dtype

source: cannot convert complex type
de_de: kann komplexen Typ nicht konvertieren
fr: ne peut convertir un type complexe
pt_br: não foi possível converter o tipo complexo
ru: Не удается преобразовать сложный тип
sv: kan inte konvertera complex typer

source: cannot delete array elements
de_de: Array-Elemente können nicht gelöscht werden
fr: les éléments de la matrice ne peut être supprimés
pt_br: não é possível excluir os elementos da matriz
ru: Не удается удалить элементы массива
sv: kan inte ta bort arrayelement

source: cannot reshape array
de_de: Array kann nicht umgeformt werden
pt_br: não é possível remodelar a matriz
ru: Не удается изменить форму массива
sv: kan inte omforma matris

source: channel re-init
de_de: Kanal wird erneut initialisiert
fr: ré-initialisation du canal
pt_br: reinício do canal
ru: Реинициализация канала
sv: kanal återstart

source: complex divide by zero
de_de: komplexe Division durch null
fr: nombre complexe divisé par zéro
pt_br: divisão complexa por zero
sv: komplex division med noll

source: corrupted file
de_de: Korrupte Datei
fr: fichier corrompu
pt_br: arquivo corrompido
ru: Поврежденный файл
sv: korrupt fil

source: dtype must be float, or complex
de_de: dtype muss Float oder komplex sein
fr: le dtype doit être un flottant, ou un complexe
pt_br: dtype deve ser flutuante ou complexo
ru: Тип d должен быть плавающим или сложным
sv: dtype måste vara float eller complex

source: dtype of int32 is not supported
de_de: int32 dtype wird nicht unterstützt
fr: dtype de int32 non pris en charge
pt_br: dtype de int32 não é suportado
sv: dtype av int32 stöds ej

source: empty file
de_de: Leere Datei
fr: fichier vide
pt_br: arquivo vazio
ru: пустой файл
sv: tom fil

source: error = 0x%08lX
de_de: Fehler = 0x%08lX
fr: erreur = 0x%08lX
nl: fout = 0x%08lX
pt_br: erro = 0x%08lX
ru: ошибка = 0x%08lX
sv: fel = 0x%08lX

source: file write is not available
de_de: file write nicht verfügbar
fr: l'écriture de fichier n'est pas disponible
pt_br: a gravação de arquivos não está disponível
ru: Запись файлов недоступна
sv: Filskrivning är inte tillgängligt

source: format
pt_br: formato

source: function is implemented for ndarrays only
de_de: Funktion ist nur für ndarrays implementiert
fr: la fonction n'est implémentée que pour les ndarrays
pt_br: a função está implementada apenas para ndarrays
ru: Функция реализована только для массивов ndarrays
sv: funktionen är bara implementerad för ndarrays

source: incompatible .mpy arch
fr: archive .mpy incompatible
pt_br: é incompatível com arquivo .mpy
ru: несовместимые .mpy арка
sv: inkompatibel .mpy-arkitektur
