Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: Init program size invalid
de_de: Init Programm Größe ungültig
es: Tamaño del programa Init invalido
fr: Taille du programme d'initialisation non valide
pt_br: O tamanho do programa Init é inválido
ru: Неверный размер программы инициализации
sv: Storlek på init-program ogiltigt

source: Initial set pin direction conflicts with initial out pin direction
de_de: Die anfängliche Richtung des Pins steht im Widerspruch zur anfänglichen out-Richtung des Pins
es: La dirección configurada inicial del pin esta en conflicto con la dirección de salida inicial del pin
fr: Direction initiale de "set pin" est en conflit avec la direction initiale de "out pin"
pt_br: A direção da definição inicial do pino conflita com a direção inicial do pino de saída
ru: Исходное установленное направление штифта конфликтует с исходным направлением вывода
sv: Initial pinn-riktning står i konflikt med initial utpinns-riktning

source: Initial set pin state conflicts with initial out pin state
de_de: Anfänglicher Pin-Zustand steht im Widerspruch mit dem anfänglichen out-Zustand des Pins
es: El estado inicial del pin de configuración esta en conflicto con el estado inicial de salida del pin
fr: État initial de "set pin" est en conflit avec l'état initial de "out pin"
pt_br: A definição do estado inicial do pino está em conflito com estado do inicial do pino
ru: Исходное установленное состояние контакта конфликтует с исходным состоянием выхода
sv: Initial inställning av pinntillstånd är i konflikt med initialt utpinntillstånd

source: Initialization failed due to lack of memory
es: Inicializacion fallida por falta de memoria
nl: De initialisatie is mislukt vanwege een gebrek aan geheugen

source: Input buffer length (%d) must be a multiple of the strand count (%d)
de_de: Input buffer länge (%d) muss ein vielfaches vom Strand Count (%d) sein
es: La longitud del buffer de entrada(%d) debe ser un múltiplo del conteo de la tira (%d)
fr: La taille (%d) du tampon d'entrée doit être un multiple du nombre (%d) de brins
pt_br: O comprimento do buffer de entrada (%d) deve ser um múltiplo da contagem dos fios (%d)
ru: Длина входного буфера (%d) должна быть кратна количеству цепочек (%d)
sv: indatabuffertlängd (%d) måste vara en multipel av antal strand (%d)

source: Input taking too long
de_de: Input benötigt zu lange
es: La entrada está durando mucho tiempo
fr: L'entrée prend trop de temps
nl: Invoer duurt te lang
pt_br: A entrada está demorando demais
ru: Ввод занимает слишком много времени
sv: Indata tar för lång tid

source: Input/output error
de_de: Eingabe-/Ausgabefehler
es: error Input/output
fil: May mali sa Input/Output
fr: Erreur d'entrée/sortie
it_it: Errore input/output
nl: Input/Output fout
pt_br: Erro de entrada/saída
ru: Ошибка ввода/вывода
sv: Indata-/utdatafel

source: Instruction %d jumps on pin
es: La instruction %d salta en pin

source: Instruction %d shifts in more bits than pin count
es: La instruccion %d mueve mas bits que la cuenta del pin

source: Instruction %d shifts out more bits than pin count
es: La instruccion %d mueve mas bits que la cuenta del pin

source: Instruction %d uses extra pin
es: La instrucción %d usa un pin extra

source: Instruction %d waits on input outside of count
es: La instrucción %d espera una entrada fuera del conteo

source: Insufficient authentication
de_de: Unzureichende Authentifizierung
es: Autenticación insuficiente
fr: Authentification insuffisante
nl: Onvoldoende authenticatie
pt_br: Autenticação insuficiente
ru: Неполная аутентификация
sv: Otillräcklig autentisering

source: Insufficient encryption
de_de: Unzureichende Verschlüsselung
es: Cifrado insuficiente
fr: Chiffrement insuffisant
nl: Onvoldoende encryptie
pt_br: Criptografia insuficiente
ru: Недостаточное шифрование
sv: Otillräcklig kryptering

source: Internal define error
de_de: Interner Definitionsfehler
es: Error interno de definición
fr: Erreur de définition interne
nl: Interne define fout
pt_br: Erro interno de definição
ru: Внутренняя ошибка определения
sv: Internt define-fel

source: Internal error #%d
de_de: Interner Fehler #%d
es: Error interno #%d
fr: Erreur interne #%d
nl: Interne fout #%d
pt_br: Erro interno #%d
ru: Внутренняя ошибка #%d
sv: Internt fel #%d

source: Invalid %q
de_de: Ungültiger %q
es: %q inválido
fr: %q invalide
nl: Ongeldige %q
pt_br: %q Inválido
ru: Недопустимый %q
sv: Ogiltig %q

source: Invalid %q pin
de_de: Ungültiger %q Pin
es: Pin %q inválido
fr: Broche invalide pour '%q'
nl: Ongeldige %q pin
pt_br: Pino do %q inválido
ru: Недопустимый пин %q
sv: Ogiltig %q-pinne

source: Invalid %q pin selection
es: selección inválida de pin %q
nl: Ongeldige %q pin selectie

source: Invalid ADC Unit value
de_de: Ungültiger ADC-Einheitenwert
es: Valor de unidad de ADC no válido
fr: Valeur d'unité ADC non valide
nl: Ongeldige ADC Unit waarde
pt_br: Valor inválido da unidade ADC
ru: Недопустимое значение единицы ADC
sv: Ogiltigt ADC-enhetsvärde

source: Invalid AuthMode
es: AuthMode invalido

source: Invalid BLE parameter
de_de: Ungültiges BLE Parameter
es: Parámetro BLE invalido
fr: Paramètre BLE invalide
pt_br: Parâmetro BLE inválido
ru: Недопустимый параметр BLE
sv: Ogiltig BLE-parameter

source: Invalid BMP file
es: Archivo BMP inválido
fil: Mali ang BMP file
it_it: File BMP non valido
nl: Ongeldig BMP bestand

source: Invalid BSSID
de_de: Ungültige BSSID
es: BSSID inválido
fr: BSSID invalide
nl: Ongeldig BSSID
pt_br: BSSID Inválido
ru: Неверный BSSID
sv: Ogiltig BSSID

source: Invalid DAC pin supplied
es: Pin suministrado inválido para DAC
nl: Ongeldige DAC pin opgegeven

source: Invalid MIDI file
es: Archivo MIDI inválido

source: Invalid PWM frequency
es: Frecuencia PWM inválida
fil: Mali ang PWM frequency
it_it: Frequenza PWM non valida
nl: Ongeldige PWM frequentie

source: Invalid Pin
es: Pin inválido
nl: Ongeldige Pin

source: Invalid argument
de_de: Ungültiges Argument
es: Argumento inválido
fil: Maling argumento
fr: Paramètre invalide
it_it: Argomento non valido
nl: Ongeldig argument
pt_br: Argumento inválido
ru: Недопустимый аргумент
sv: Ogiltigt argument

source: Invalid bits per value
de_de: Ungültige Bits pro Wert
es: Inválido bits por valor
fr: Bits par valeur invalides
nl: Ongeldige bits per waarde
pt_br: Os valores por bits são inválidos
ru: Недопустимое бит-на-значение
sv: Ogiltigt värde för bitar per värde

source: Invalid buffer size
es: Tamaño de buffer inválido
fil: Mali ang buffer size
nl: Ongeldige buffer grootte

source: Invalid byteorder string
es: Cadena de byteorder inválida
nl: Ongeldige byteorder string

source: Invalid capture period. Valid range: 1 - 500
es: Inválido periodo de captura. Rango válido: 1 - 500
nl: Ongeldige vastlegging periode. Geldig bereik: 1 - 500

source: Invalid channel count
es: Cuenta de canales inválida
fil: Maling bilang ng channel
nl: Ongeldige kanaal aantallen

source: Invalid data_count %d
es: data_count inválido %d

source: Invalid data_pins[%d]
de_de: Ungültige data_pins[%d]
es: Inválidos los data_pins[%d]
fr: data_pins[%d] invalide
pt_br: data_pins[%d] inválido
ru: Неверный data_pins[%d]
sv: Ogiltig data_pins[%d]

source: Invalid direction.
es: Dirección inválida.
fil: Mali ang direksyon.
it_it: Direzione non valida.
nl: Ongeldige richting.

source: Invalid file
es: Archivo inválido
fil: Mali ang file
it_it: File non valido
nl: Ongeldig bestand

source: Invalid format chunk size
de_de: Ungültige format chunk size
es: Formato de fragmento de formato no válido
fil: Mali ang format ng chunk size
fr: Taille de bloc de formatage invalide
nl: Ongeldig formaat stuk grootte
pt_br: Tamanho do pedaço de formato inválido
ru: Неверный размер блока формата
sv: Ogiltig formatsegmentstorlek

source: Invalid frequency
es: Frecuencia inválida
nl: Onjuiste frequentie

source: Invalid memory access.
es: Acceso a memoria no válido.
nl: Ongeldig geheugen adres.

source: Invalid number of bits
es: Numero inválido de bits
fil: Mali ang bilang ng bits
it_it: Numero di bit non valido
nl: Ongeldig aantal bits

source: Invalid phase
es: Fase inválida
fil: Mali ang phase
it_it: Fase non valida
nl: Ongeldige fase

source: Invalid pin
es: Pin inválido
fil: Mali ang pin
it_it: Pin non valido
nl: Ongeldige pin

source: Invalid pin for left channel
es: Pin inválido para canal izquierdo
fil: Mali ang pin para sa kaliwang channel
it_it: Pin non valido per il canale sinistro
nl: Ongeldige pin voor linker kanaal

source: Invalid pin for right channel
es: Pin inválido para canal derecho
fil: Mali ang pin para sa kanang channel
it_it: Pin non valido per il canale destro
nl: Ongeldige pin voor rechter kanaal

source: Invalid pins
es: pines inválidos
fil: Mali ang pins
it_it: Pin non validi
nl: Ongeldige pinnen

source: Invalid polarity
es: Polaridad inválida
fil: Mali ang polarity
it_it: Polarità non valida
nl: Ongeldige polariteit

source: Invalid properties
es: Propiedades inválidas
nl: Ongeldige eigenschappen

source: Invalid run mode.
es: Modo de ejecución inválido.
fil: Mali ang run mode.
it_it: Modalità di esecuzione non valida.
nl: Ongeldige run modus.

source: Invalid security_mode
es: 'security_mode' no válido
nl: Ongeldige security_mode

source: Invalid size
de_de: Ungültige Größe
es: Tamaño incorrecto
fr: Taille invalide
pt_br: Tamanho inválido
ru: Неверный размер
sv: Ogiltig storlek

source: Invalid socket for TLS
de_de: Ungültiges Socket für TLS
es: socket invalido para TLS
fr: Socket non valide pour TLS
pt_br: Soquete inválido para o TLS
ru: Неверный сокет для TLS
sv: Ogiltig socket för TLS

source: Invalid state
de_de: Ungültiger Zustand
es: Estado invalido
fr: État invalide
pt_br: Estado inválido
ru: Неверное состояние
sv: Ogiltigt tillstånd

source: Invalid voice
es: Voz inválida
nl: Ongeldige stem

source: Invalid voice count
es: Cuenta de voces inválida
fil: Maling bilang ng voice
nl: Ongeldig stem aantal

source: Invalid wave file
es: Archivo wave inválido
fil: May hindi tama sa wave file
it_it: File wave non valido
nl: Ongeldig wave bestand

source: Invalid word/bit length
es: Tamaño no válido de palabra/bit
nl: Ongeldig woord/bit lengte

source: Key must be 16, 24, or 32 bytes long
de_de: Der Schlüssel muss 16, 24 oder 32 Byte lang sein
es: La llave debe tener 16, 24 o 32 bytes de longitud
fr: La clé doit comporter 16, 24 ou 32 octets
nl: Sleutel moet 16, 24, of 32 bytes lang zijn
pt_br: A chave deve ter 16, 24 ou 32 bytes de comprimento
ru: Ключ должен быть длинной 16, 24 или 32 байта
sv: Nyckeln måste vara 16, 24 eller 32 byte lång

source: LHS of keyword arg must be an id
de_de: LHS des Schlüsselwortarguments muss eine id sein
es: LHS del agumento por palabra clave deberia ser un identificador
fil: LHS ng keyword arg ay dapat na id
fr: La partie gauche de l'argument nommé doit être un identifiant
nl: LHS van sleutelwoord arg moet een id zijn
pt_br: O LHS da palavra-chave arg deve ser um ID
ru: LHS ключевого слова arg должен быть идентификатором(id)
sv: LHS av keword arg måste vara ett id

source: Layer already in a group.
es: La capa ya pertenece a un grupo.
nl: Laag al in groep.

source: Layer must be a Group or TileGrid subclass.
es: Layer debe ser una subclase de Group o TileGrid.
nl: Laag moet een Groep of TileGrid subklasse zijn.

source: MAC address was invalid
de_de: MAC Adresse war ungültig
es: La dirección MAC es incorrecta
fr: Adresse physique (MAC) invalide
pt_br: O endereço MAC era inválido
ru: MAC адрес был недействительным
sv: MAC-adressen var ogiltig

source: MISO pin init failed.
es: MISO pin init fallido.
fil: Hindi ma-initialize ang MISO pin.
it_it: inizializzazione del pin MISO fallita.
nl: MISO pin init mislukt.

source: MOSI pin init failed.
es: MOSI pin init fallido.
fil: Hindi ma-initialize ang MOSI pin.
it_it: inizializzazione del pin MOSI fallita.
nl: MOSI pin init mislukt.

source: Maximum x value when mirrored is %d
es: Valor máximo de x cuando se refleja es %d
nl: Maximale x waarde indien gespiegeld is %d

source: Messages limited to 8 bytes
es: Mensajes limitados a 8 bytes
nl: Berichten zijn beperkt tot 8 bytes

source: Microphone startup delay must be in range 0.0 to 1.0
es: Micrófono demora de inicio debe estar en el rango 0.0 a 1.0
fil: Ang delay ng startup ng mikropono ay dapat na nasa 0.0 hanggang 1.0
it_it: Il ritardo di avvio del microfono deve essere nell'intervallo tra 0.0 e 1.0
nl: Microfoon opstart vertraging moet in bereik van 0.0 tot 1.0 zijn
pt_br: O atraso na inicialização do microfone deve estar entre 0,0 e 1,0

source: Missing MISO or MOSI Pin
es: Falta el pin MISO o MOSI
nl: Ontbrekende MISO of MOSI Pin

source: Missing first_in_pin. Instruction %d reads pin(s)
es: first-in-pin no encontrado. La instrucción %d lee el/los pin(es)

source: Missing first_in_pin. Instruction %d shifts in from pin(s)
es: first_in_pin no encontrado. La instrucción %d desplaza de los pin(es)

source: Missing first_in_pin. Instruction %d waits based on pin
es: first_in_pin no encontrado. La instrucción %d espera basada en este pin

source: Missing first_out_pin. Instruction %d shifts out to pin(s)
es: first_in_pin no encontrado. La instrucción %d mueve hacia afuera hacia el/los pin(es)

source: Missing first_out_pin. Instruction %d writes pin(s)
es: first_in_pin no encontrado. La instrucción %d escribe pin(es)

source: Missing first_set_pin. Instruction %d sets pin(s)
es: first_set_pin no encontrado. La instrucción %d configura el/los pin(es)

source: Must be a %q subclass.
de_de: Muss eine %q Unterklasse sein.
es: Debe de ser una subclase de %q.
fr: Doit être une sous-classe de %q.
nl: %q moet een subklasse zijn.
pt_br: Deve ser uma subclasse %q.
ru: Должен быть субклассом %q.
sv: Måste vara en %q-subklass.

source: Must provide MISO or MOSI pin
de_de: Muss MISO- oder MOSI-Pin bereitstellen
es: Debe proporcionar un pin MISO o MOSI
fr: Doit fournir une broche MISO ou MOSI
nl: MISO of MOSI moeten worden gegeven
pt_br: Deve informar os pinos MISO ou MOSI
ru: Пин MISO или MOSI должен быть предоставлен
sv: Måste ange MISO- eller MOSI-pinne

source: Must use a multiple of 6 rgb pins, not %d
de_de: Muss ein Vielfaches von 6 RGB-Pins verwenden, nicht %d
es: Debe usar un múltiplo de 6 pines rgb, no %d
fr: Doit utiliser un multiple de 6 broches RVB, pas %d
nl: Een meervoud van 6 rgb pinnen moet worden gebruikt, niet %d
pt_br: Deve utilizar um múltiplo de 6 pinos rgb, não %d
ru: Количество используемых rgb-пинов должно быть кратно 6, а не %d
sv: Måste använda ett multipel av 6 rgb-pinnar, inte %d

source: NLR jump failed. Likely memory corruption.
de_de: NLR-Sprung fehlgeschlagen. Mögliche Speicher-Beschädigung.
es: Salto NLR falló. Probablemente corrupción de memoria.
fr: Saut NLR échoué. Corruption de mémoire probable.
pt_br: O salto NLR falhou. Possível corrupção da memória.
ru: Прыжок NLR не удался. Вероятно повреждение памяти.
sv: NLR jump misslyckades. Troligen korrupt minne.

source: NVS Error
de_de: NVS-Fehler
es: Error NVS
fr: Erreur NVS
nl: NVS-fout
pt_br: Erro NVS
ru: Ошибка NVS
sv: NVS-fel

source: Name too long
es: Nombre muy largo
fr: Nom trop long
nl: Naam te lang
pt_br: Nome muito longo
ru: Имя слишком длинное
sv: Name är för långt

source: No CCCD for this Characteristic
de_de: Kein CCCD für diese Charakteristik
es: No hay CCCD para esta característica
fr: Pas de CCCD pour cette caractéristique
nl: Geen CCCD voor deze Characteristic
pt_br: Não há nenhum CCCD para esta característica
ru: Для этой характеристики нет CCCD
sv: Ingen CCCD för denna karaktäristik

source: No DAC on chip
de_de: Kein DAC im Chip vorhanden
es: El chip no tiene DAC
fil: Walang DAC sa chip
fr: Pas de DAC sur la puce
it_it: Nessun DAC sul chip
nl: Geen DAC op de chip
pt_br: Nenhum DAC no chip
ru: DAC отсутствует на чипе
sv: Ingen DAC på chipet

source: No DMA channel found
de_de: Kein DMA Kanal gefunden
es: No se encontró el canal DMA
fil: Walang DMA channel na mahanap
fr: Aucun canal DMA trouvé
it_it: Nessun canale DMA trovato
nl: Geen DMA kanaal gevonden
pt_br: Nenhum canal DMA foi encontrado
ru: Канал DMA не найден
sv: Ingen DMA-kanal hittades

source: No DMA pacing timer found
de_de: Kein DMA-Pacing Timer gefunden
es: timer por establecedor de paso DMA no encontrado
fr: Aucun minuteur de rythme DMA trouvé
pt_br: Nenhum temporizador DMA foi encontrado
ru: Таймер стимуляции DMA не найден
sv: Ingen DMA pacing timer hittades

source: No I2C device at address: %x
es: No hay dispositivo I2C en la dirección: %x
nl: Geen I2C-apparaat op adres: %x

source: No MISO Pin
es: Sin pin MISO
nl: Geen MISO pin

source: No MOSI Pin
es: Sin pin MOSI
nl: Geen MOSI pin

source: No RX pin
es: Sin pin RX
fil: Walang RX pin
it_it: Nessun pin RX
nl: Geen RX pin

source: No TX pin
es: Sin pin TX
fil: Walang TX pin
it_it: Nessun pin TX
nl: Geen TX pin

source: No available clocks
es: Relojes no disponibles
nl: Geen klokken beschikbaar
pt_br: Nenhum clock disponível

source: No connection: length cannot be determined
de_de: Keine Verbindung: Länge kann nicht bestimmt werden
es: Sin conexión: no se puede determinar la longitud
fr: Pas de connexion : la longueur ne peut pas être déterminée
nl: Geen verbinding: lengte kan niet worden bepaald
pt_br: Sem conexão: o comprimento não pode ser determinado
ru: Нет соединения: длина не может быть определена
sv: Ingen anslutning: längden kan inte bestämmas

source: No default %q bus
de_de: Kein Standard %q Bus
es: Sin bus %q por defecto
fr: Pas de bus %q par défaut
nl: Geen standaard %q bus
pt_br: Nenhum barramento %q padrão
ru: Нет шины %q по умолчанию
sv: Ingen standard %q-buss

source: No free GCLKs
de_de: Keine freien GCLKs
es: Sin GCLKs libres
fil: Walang libreng GCLKs
fr: Pas de GCLK libre
it_it: Nessun GCLK libero
nl: Geen vrije GCLKs
pt_br: Não há GCLKs livre
ru: Свободные GCLK отсутствуют
sv: Inga fria GCLK: er

source: No hardware random available
de_de: Kein hardware random verfügbar
es: No hay hardware random disponible
fil: Walang magagamit na hardware random
fr: Aucunes source de valeurs aléatoire matérielle disponible
it_it: Nessun generatore hardware di numeri casuali disponibile
nl: Geen hardware random beschikbaar
pt_br: Nenhum hardware aleatório está disponível
ru: Отсутствует аппаратный генератор случайных чисел
sv: Ingen hårdvaru-random tillgänglig

source: No hardware support on clk pin
es: Sin soporte de hardware en el pin clk
nl: Geen hardware ondersteuning beschikbaar op clk pin

source: No hardware support on pin
es: Sin soporte de hardware en pin
fil: Walang support sa hardware ang pin
it_it: Nessun supporto hardware sul pin
nl: Geen hardware ondersteuning op pin

source: No in in program
de_de: Nicht in Programm
es: No hay "in" en el programa
fr: Programme n'a pas de "in"
pt_br: Sem entrada no programa
ru: Нет в программе
sv: Inget in i programmet

source: No in or out in program
de_de: Kein Ein oder Aus in Programm
es: No hay "in" o "out" en el programa
fr: Programme n'a aucun "in" ni "out"
pt_br: Sem entrada ou saída no programa
ru: В программе отсутствует ввод или вывод
sv: Inget in eller ut i programmet

source: No key was specified
es: No se especificó ninguna llave
nl: Een sleutel was niet gespecificeerd

source: No long integer support
de_de: Keine langen Integer (long) unterstützt
es: No hay soporte de entero largo
fr: Pas de support pour chiffre entier long
nl: Geen lange integer ondersteuning
pt_br: Não há compatibilidade com inteiro longo
ru: Нет поддержки длинных целых чисел (long integer)
sv: Inget stöd för långt heltal

source: No more than %d HID devices allowed
es: No se permiten más de %d dispositivos HID permitidos

source: No network with that ssid
de_de: Kein Netzwerk mit dieser SSID
es: No hay una red con ese ssid
fr: Aucun réseau avec ce ssid
nl: Geen netwerk met dat SSID gevonden
pt_br: Não há rede com este ssid
ru: Нет сети с этим ssid
sv: Inget nätverk med sådant ssid

source: No out in program
de_de: Kein Aus in Programm
es: No hay out en el programa
fr: Aucun out dans le programme
pt_br: Sem saída no programa
ru: В программе отсутствует вывод
sv: Inget out i programmet

source: No pull up found on SDA or SCL; check your wiring
de_de: Kein Pull-up gefunden an SDA oder SCL; Verkabelung prüfen
es: No se encontró pull up en SDA or SCL; verifique su cableado
fr: Aucun pull up trouvé sur SDA ou SCL; vérifiez votre câblage
pt_br: Nenhum pull up foi encontrado no SDA ou no SCL; verifique o fio das suas conexões
ru: На SDA или SCL не обнаружено подтягивания; проверь свою проводку
sv: Ingen pull-up hittades på SDA eller SCL; kontrollera inkopplingen

source: No pulldown on pin; 1Mohm recommended
de_de: Kein Pulldown-Widerstand am Pin; 1 MOhm wird vorgeschlagen
es: No hay pulldown en el pin; 1Mohm recomendado
fr: Pas de pulldown sur la broche ; 1Mohm recommandé
nl: Geen pulldown op pin; 1MOhm aangeraden
pt_br: Não há pulldown no pino; É recomendável utilizar um resistor de 1M ohm
ru: Отсутствует подтяжка к земле на пине; Рекомендуется 1 Мегаом
sv: Ingen pulldown på pinnen; 1Mohm rekommenderas

source: No space left on device
de_de: Kein Speicherplatz mehr verfügbar auf dem Gerät
es: No queda espacio en el dispositivo
fr: Aucun espace libre sur le dispositif
nl: Geen ruimte meer beschikbaar op apparaat
pt_br: Não resta espaço no dispositivo
ru: На устройстве не осталось свободного места
sv: Inget utrymme kvar på enheten

source: No such file/directory
de_de: Keine solche Datei/Verzeichnis
es: No existe el archivo/directorio
fil: Walang file/directory
fr: Fichier/répertoire introuvable
it_it: Nessun file/directory esistente
nl: Bestand/map bestaat niet
pt_br: Este arquivo/diretório não existe
ru: Файл/директория не существует
sv: Ingen sådan fil/katalog

source: No timer available
de_de: Kein Timer verfügbar
es: No hay temporizador disponible
fr: Aucun minuteur disponible
nl: Geen timer beschikbaar
pt_br: Não há um temporizador disponível
ru: Нет доступного таймера
sv: Ingen timer tillgänglig

source: Nordic system firmware failure assertion.
es: Falla en la aserción del firmware del dispositivo Nordic.

source: Nordic system firmware out of memory
de_de: Nordic System-Firmware kein Speicher verfügbar
es: El firmware del sistema Nordic no tiene memoria
fr: Logiciel système Nordic n'a plus de mémoire
pt_br: O firmware do sistema nórdico está sem memória
ru: Скандинавская система прошивки из памяти
sv: Nordic systemfirmware fick slut på minne

source: Not a valid IP string
de_de: Kein gültiger IP-String
es: No es una cadena de IP válida
fr: Chaîne IP non valide
nl: Geen geldige IP string
pt_br: Não é uma sequência válida de IP
ru: Недействительная строка IP
sv: Inte en giltig IP-sträng

source: Not connected
de_de: Nicht verbunden
es: No conectado
fr: Non connecté
nl: Niet verbonden
pt_br: Não Conectado
ru: Не подключено
sv: Inte ansluten

source: Not playing
de_de: Spielt nicht ab
es: No reproduciendo
fil: Hindi playing
fr: Ne joue pas
it_it: In pausa
nl: Wordt niet afgespeeld
pt_br: Não está jogando
ru: Не воспроизводится (Not playing)
sv: Ingen uppspelning

source: Not settable
es: No configurable
nl: Niet instelbaar

source: Object has been deinitialized and can no longer be used. Create a new object.
de_de: Objekt wurde deinitialisiert und kann nicht mehr verwendet werden. Erstelle ein neues Objekt.
es: El objeto se ha desinicializado y ya no se puede utilizar. Crea un nuevo objeto.
fil: Object ay deinitialized at hindi na magagamit. Lumikha ng isang bagong Object.
fr: L'objet a été dés-initialisé et ne peut plus être utilisé. Créez un nouvel objet.
it_it: L'oggetto è stato deinizializzato e non può essere più usato. Crea un nuovo oggetto.
nl: Object is gedeïnitialiseerd en kan niet meer gebruikt worden. Creëer een nieuw object.
pt_br: Objeto foi desinicializado e não pode ser mais usaado. Crie um novo objeto.
ru: Объект был деинициализирован и больше не может быть использован. Создайте новый объект.
sv: Objektet har deinitialiserats och kan inte längre användas. Skapa ett nytt objekt.
