Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: destination buffer must be an array of type 'H' for bit_depth = 16
de_de: Der Zielpuffer muss ein Array vom Typ 'H' für bit_depth = 16 sein
es: el buffer de destino debe ser un array de tipo 'H' para bit_depth = 16
fil: ang destination buffer ay dapat na isang array ng uri 'H' para sa bit_depth = 16
fr: le tampon de destination doit être une matrice de type 'H' pour bit_depth = 16
it_it: il buffer di destinazione deve essere un array di tipo 'H' con bit_depth = 16
nl: bestemming buffer moet een array van het type 'H' voor bit_depth = 16
pt_br: o buffer do destino deve ser uma matriz do tipo 'H' para bit_depth = 16
ru: буфер назначения должен быть массивом типа «H» для битовой_глубины = 16
sv: destinationsbufferten måste vara en matris av typen 'H' för bit_depth = 16

source: destination_length must be an int >= 0
es: destination_length debe ser un int >= 0
fil: ang destination_length ay dapat na isang int >= 0
it_it: destination_length deve essere un int >= 0
nl: destination_lengte moest een int groter dan of gelijk zijn aan 0 zijn

source: dict update sequence has wrong length
de_de: Die Wörterbuch-Aktualisierungssequenz hat eine falsche Länge
es: la secuencia de actualizacion del dict tiene una longitud incorrecta
fil: may mali sa haba ng dict update sequence
fr: la séquence de mise à jour de dict a une mauvaise longueur
it_it: sequanza di aggiornamento del dizionario ha la lunghezza errata
nl: dict update sequence heeft de verkeerde lengte
pt_br: sequência da atualização dict tem o comprimento errado
ru: последовательность обновления дикта имеет неправильную длину
sv: uppdateringssekvensen för dict har fel längd

source: diff argument must be an ndarray
de_de: diff Argument muss ein ndarray sein
es: El argumento diff debe ser un ndarray
fr: le paramêtre diff doit être un ndarray
nl: diff argument moet een ndarray zijn
pt_br: O argumento diff deve ser um ndarray
ru: аргумент DIFF должен быть массивом ndarray
sv: argumentet diff måste vara en ndarray

source: differentiation order out of range
de_de: Differenzierungsauftrag außerhalb des Bereichs
es: Orden de diferenciación fuera de rango
fr: differentiation order hors de portée
nl: differentiatievolgorde buiten bereik
pt_br: ordem de diferenciação fora do alcance
ru: Порядок дифференциации вне диапазона
sv: differentieringsordning utanför intervallet

source: dimensions do not match
de_de: Abmessungen stimmen nicht überein
es: las dimensiones no concuerdan
fr: les dimensions ne correspondent pas
pt_br: as dimensões não coincidem
ru: Размеры не совпадают
sv: dimensioner matchar inte

source: div/mod not implemented for uint
de_de: div/mod für uint nicht implementiert
es: div/mod no implementado para uint
fr: div/mod ne sont pas implémentés pour uint
pt_br: div/mod não implementado para uint
ru: div/mod не реализован для uint
sv: div/mod inte implementerat för uint

source: divide by zero
de_de: durch Null dividieren
es: divide por cero
fr: division par zéro
pt_br: divido por zero
ru: Делим на ноль
sv: division med noll

source: division by zero
de_de: Division durch Null
es: división por cero
fil: dibisyon ng zero
fr: division par zéro
it_it: divisione per zero
nl: deling door nul
pt_br: divisão por zero
ru: Деление на ноль
sv: division med noll

source: empty
de_de: leer
es: vacío
fil: walang laman
fr: vide
it_it: vuoto
nl: leeg
pt_br: vazio
ru: пусто
sv: tom

source: empty heap
de_de: leerer heap
es: heap vacío
fil: walang laman ang heap
fr: tas vide
it_it: heap vuoto
nl: lege heap
pt_br: a área de alocação dinâmica de variáveis (heap) está vazia
ru: пустая куча
sv: tom heap

source: empty separator
de_de: leeres Trennzeichen
es: separator vacío
fil: walang laman na separator
fr: séparateur vide
it_it: separatore vuoto
nl: lege seperator
pt_br: separador vazio
ru: пустой сепаратор
sv: tom separator

source: empty sequence
de_de: leere Sequenz
es: secuencia vacía
fil: walang laman ang sequence
fr: séquence vide
it_it: sequenza vuota
nl: lege sequentie
pt_br: seqüência vazia
ru: пустая последовательность
sv: tom sekvens

source: end of format while looking for conversion specifier
de_de: Ende des Formats bei der Suche nach einem Konvertierungsspezifizierer
es: el final del formato mientras se busca el especificador de conversión
fil: sa huli ng format habang naghahanap sa conversion specifier
fr: fin de format en cherchant une spécification de conversion
nl: einde van format terwijl zoekend naar conversie-specifier
pt_br: final de formato enquanto procura pelo especificador de conversão
ru: конец формата при поиске спецификатора преобразования
sv: slut på format vid sökning efter konverteringsspecificerare

source: end_x should be an int
es: end_x debe ser un int
nl: end_x moet een int zijn

source: epoch_time not supported on this board
de_de: epoch_time wird auf diesem Board nicht unterstützt
es: epoch_time no esta soportado en esta tarjeta
fr: epoch_time n'est pas supporté sur ce panneau
nl: epoch_time niet ondersteund op dit bord
pt_br: O epoch_time não é compatível com esta placa
ru: epoch_time не поддерживается на этой плате
sv: epoch_time stöds inte av detta kort

source: exceptions must derive from BaseException
de_de: Exceptions müssen von BaseException abgeleitet sein
es: las excepciones deben derivar de BaseException
fil: ang mga exceptions ay dapat makuha mula sa BaseException
fr: les exceptions doivent dériver de 'BaseException'
it_it: le eccezioni devono derivare da BaseException
nl: uitzonderingen moeten afleiden van BaseException
pt_br: as exceções devem derivar a partir do BaseException
ru: исключения должны быть производными от базового исключения
sv: exceptions måste ärvas från BaseException

source: expected '%q' but got '%q'
es: se espera '%q' pero se recibe '%q'
nl: verwachtte '%q' maar ontving '%q'

source: expected '%q' or '%q' but got '%q'
es: se espera '%q' o '%q' pero se recibe '%q'
nl: verwachtte '%q' of '%q' maar ontving '%q'

source: expected ':' after format specifier
de_de: erwarte ':' nach format specifier
es: se esperaba ':' después de un especificador de tipo format
fil: umaasa ng ':' pagkatapos ng format specifier
fr: ':' attendu après la spécification de format
it_it: ':' atteso dopo lo specificatore di formato
nl: verwachtte ':' na format specifier
pt_br: é esperado ':' após o especificador do formato
ru: Ожидаемый ':' после спецификатора формата
sv: förväntade ':' efter formatspecifikation

source: expected tuple/list
de_de: erwarte tuple/list
es: se esperaba una tupla/lista
fil: umaasa ng tuple/list
fr: un tuple ou une liste est attendu
it_it: lista/tupla prevista
nl: verwachtte een tuple/lijst
pt_br: é esperada tupla/lista
ru: Ожидаемый кортеж/список
sv: förväntade tupel/lista

source: expecting a dict for keyword args
de_de: erwarte ein dict als Schlüsselwort-Argumente
es: esperando un diccionario para argumentos por palabra clave
fil: umaasa ng dict para sa keyword args
fr: un dict est attendu pour les arguments nommés
it_it: argomenti nominati necessitano un dizionario
nl: verwacht een dict voor keyword argumenten
pt_br: esperando um dicionário para os args da palavra-chave
ru: ожидание определения аргументов ключевых слов
sv: förväntar en dict för keyword args

source: expecting an assembler instruction
de_de: erwartet eine Assembler-Anweisung
es: esperando una instrucción de ensamblador
fil: umaasa ng assembler instruction
fr: une instruction assembleur est attendue
it_it: istruzione assembler attesa
nl: verwacht een assembler instructie
pt_br: esperando uma instrução assembler
ru: Ожидание инструкции ассемблера
sv: förväntar en assemblerinstruktion

source: expecting just a value for set
de_de: Erwarte nur einen Wert für set
es: esperando solo un valor para set
fil: umaasa sa value para sa set
fr: une simple valeur est attendue pour l'ensemble 'set'
it_it: un solo valore atteso per set
nl: verwacht alleen een waarde voor set
pt_br: esperando apenas um valor para o conjunto
ru: ожидание только значения для набора
sv: förväntar bara ett värde för set

source: expecting key:value for dict
de_de: Erwarte key:value für dict
es: esperando la clave:valor para dict
fil: umaasang key: halaga para sa dict
fr: couple clef:valeur attendu pour un dictionnaire 'dict'
it_it: chiave:valore atteso per dict
nl: verwacht key:waarde for dict
pt_br: chave esperada: valor para dict
ru: ожидание ключа: значение для дикта
sv: förväntar nyckel:värde för dict

source: ext_hook is not a function
de_de: ext_hook ist keine Funktion
es: ext_hook no es una función
fr: ext_hook n'est pas une fonction
pt_br: o ext_hook não é uma função
ru: ext_hook не является функцией
sv: ext_hook är inte en funktion

source: extra keyword arguments given
de_de: Es wurden zusätzliche Schlüsselwort-Argumente angegeben
es: argumento(s) por palabra clave adicionales fueron dados
fil: dagdag na keyword argument na ibinigay
fr: argument(s) nommé(s) supplémentaire(s) donné(s)
it_it: argomento nominato aggiuntivo fornito
nl: extra keyword argumenten gegeven
pt_br: argumentos extras de palavras-chave passados
ru: Приведены дополнительные аргументы ключевых слов
sv: extra keyword-argument angivna

source: extra positional arguments given
de_de: Es wurden zusätzliche Argumente ohne Schlüsselwort angegeben
es: argumento posicional adicional dado
fil: dagdag na positional argument na ibinigay
fr: argument(s) positionnel(s) supplémentaire(s) donné(s)
it_it: argomenti posizonali extra dati
nl: extra positionele argumenten gegeven
pt_br: argumentos extra posicionais passados
ru: Приведены дополнительные позиционные аргументы
sv: extra positions-argument angivna

source: f-string expression part cannot include a '#'
es: La parte de expresión f-string no puede incluir un '#'
nl: f-string expressie deel kan geen '#' bevatten

source: f-string expression part cannot include a backslash
es: La parte de expresión f-string no puede incluir una barra invertida
nl: f-string expressie deel kan geen backslash bevatten

source: f-string: empty expression not allowed
es: cadena-f: expresión vacía no permitida
nl: f-string: lege expressie niet toegestaan

source: f-string: expecting '}'
es: f-string: esperando '}'
nl: f-string: verwacht '}'

source: f-string: single '}' is not allowed
es: cadena-f: solo '}' no está permitido
nl: f-string: enkele '}' is niet toegestaan

source: file must be a file opened in byte mode
de_de: Die Datei muss eine im Byte-Modus geöffnete Datei sein
es: el archivo deberia ser una archivo abierto en modo byte
fil: file ay dapat buksan sa byte mode
fr: le fichier doit être un fichier ouvert en mode 'byte'
nl: bestand moet een bestand zijn geopend in byte modus
pt_br: o arquivo deve ser um arquivo aberto no modo byte
ru: Файл должен быть файлом, открытым в байтовом режиме
sv: filen måste vara en fil som öppnats i byte-läge

source: filesystem must provide mount method
de_de: Das Dateisystem muss eine Mount-Methode bereitstellen
es: sistema de archivos debe proporcionar método de montaje
fil: ang filesystem dapat mag bigay ng mount method
fr: le system de fichier doit fournir une méthode 'mount'
it_it: il filesystem deve fornire un metodo di mount
nl: bestandssysteem moet een mount methode bieden
pt_br: sistema de arquivos deve fornecer método de montagem
ru: Файловая система должна предусматривать метод монтирования
sv: filsystemet måste tillhandahålla mount-metod

source: first argument must be a callable
de_de: das erste Argument muss ein aufrufbares sein
es: se debe poder llamar al primer argumento
fr: le premier argument doit être un appelable
nl: eerste argument moet een aanroepbare (callable) zijn
pt_br: o primeiro argumento deve ser chamável
ru: Первый аргумент должен быть вызываемым
sv: första argumentet måste vara en callable

source: first argument must be a function
de_de: das erste Argument muss eine Funktion sein
es: el primer argumento debe ser una función
fr: le premier argument doit être une fonction
nl: eerste argument moet een functie zijn
pt_br: o primeiro argumento deve ser uma função
ru: первый аргумент должен быть функцией
sv: första argumentet måste vara en funktion

source: first argument must be a tuple of ndarrays
de_de: das erste Argument muss ein Tupel von ndarrays sein
es: Primer argumento tiene que ser una tupla de ndarrays
fr: le premier paramêtre doit être un tuple de ndarrays
nl: eerste argument moet een tupel van ndarrays zijn
pt_br: o primeiro argumento deve ser um tuple de ndarrays
ru: Первый аргумент должен быть кортежом массива ndarrays
sv: första argumentet måste vara en tupel av ndarray

source: first argument must be an ndarray
de_de: Das erste Argument muss ein Ndarray sein
es: el primer argumento debe ser ndarray
fr: le premier paramêtre doit être un ndarray
nl: eerst argument moet een ndarray zijn
pt_br: o primeiro argumento deve ser um ndarray
ru: Первым аргументом должен быть массивом ndarray
sv: första argumentet måste vara en ndarray

source: first argument to super() must be type
de_de: Das erste Argument für super() muss type sein
es: primer argumento para super() debe ser de tipo
fil: unang argument ng super() ay dapat type
fr: le premier argument de super() doit être un type
nl: eerste argument voor super() moet een type zijn
pt_br: o primeiro argumento para super() deve ser um tipo
ru: первый аргумент супер() должен быть типом
sv: första argumentet till super() måste vara typ

source: first two arguments must be ndarrays
de_de: die ersten beiden Argumente müssen ndarrays sein
es: los primeros dos argumentos deben ser ndarrays
fr: les deux premiers paramètres doivent être des ndarrays
pt_br: os dois primeiros argumentos devem ser ndarrays
ru: Первые два аргумента должны быть массивами ndarrays
sv: De två första argumenten måste vara ndarray:er

source: flattening order must be either 'C', or 'F'
de_de: Die Abflachungsreihenfolge muss entweder "C" oder "F" sein
es: el orden de aplanamiento debe ser 'C' o 'F'
fr: l'ordre d'aplatissement doit être «C» ou «F»
nl: De afvlakkingsvolgorde moet ofwel "C", ofwel "F" zijn
pt_br: a ordem do nivelamento deve ser 'C' ou 'F'
ru: порядок сглаживания должен быть либо 'C', либо 'F'
sv: förenklingsordningen måste vara antingen "C" eller "F"

source: flip argument must be an ndarray
de_de: Das Flip-Argument muss ein Ndarray sein
es: el argumento invertido debe ser un ndarray
fr: le paramêtre flip doit être un ndarray
nl: flip argumenten moeten een ndarray zijn
pt_br: o argumento flip deve ser um ndarray
ru: Флип -аргумент должен быть массивом ndarray
sv: Argumentet flip måste vara en ndarray

source: float too big
de_de: float zu groß
es: punto flotante demasiado grande
fil: masyadong malaki ang float
fr: nombre à virgule flottante trop grand
it_it: float troppo grande
nl: float is te groot
pt_br: float muito grande
ru: Поплавок слишком большой
sv: flyttalet för stort

source: float unsupported
de_de: float (Gleitkommazahlen) nicht unterstützt
es: sin capacidades de flotante
fr: valeures flotantes non supportées
pt_br: Flutuante não compatível
ru: Плавающий без поддержки
sv: float stöds ej

source: font must be 2048 bytes long
de_de: Die Schriftart (font) muss 2048 Byte lang sein
es: font debe ser 2048 bytes de largo
fil: font ay dapat 2048 bytes ang haba
fr: la police doit être longue de 2048 octets
it_it: il font deve essere lungo 2048 byte
nl: lettertype moet 2048 bytes lang zijn
pt_br: a fonte deve ter 2048 bytes de comprimento
ru: Длина шрифта должна составлять 2048 байт
sv: typsnitt måste vara 2048 bytes långt

source: format requires a dict
de_de: Format erfordert ein Wörterbuch (dict)
es: format requiere un dict
fil: kailangan ng format ng dict
fr: le format nécessite un dict
it_it: la formattazione richiede un dict
nl: format vereist een dict
pt_br: formato requer um dict
ru: Формат требует диктата
sv: formatet kräver en dict

source: full
de_de: voll
es: lleno
fil: puno
fr: plein
it_it: pieno
nl: vol
pt_br: cheio
ru: полный

source: function doesn't take keyword arguments
de_de: Funktion nimmt keine Schlüsselwortargumente an
es: la función no toma argumentos de tipo keyword
fr: la fonction n'accepte pas de paramètre nommés
pt_br: a função não aceita palavras-chave como argumentos
ru: функция не принимает аргументы ключевых слов
sv: funktionen tar inte nyckelordsargument

source: function expected at most %d arguments, got %d
de_de: Funktion erwartet maximal %d Argumente, aber hat %d erhalten
es: la función esperaba minimo %d argumentos, tiene %d
fil: function na inaasahang %d ang argumento, ngunit %d ang nakuha
fr: la fonction attendait au plus %d arguments, reçu %d
it_it: la funzione prevede al massimo %d argmoneti, ma ne ha ricevuti %d
nl: functie verwachtte op zijn meest %d argumenten, maar kreeg %d
pt_br: função esperada na maioria dos %d argumentos, obteve %d
ru: функция, ожидаемая в большинстве %d аргументов, получила %d
sv: funktionen förväntar som mest %d argument, fick %d

source: function got multiple values for argument '%q'
de_de: Funktion hat mehrere Werte für Argument '%q'
es: la función tiene múltiples valores para el argumento '%q'
fil: ang function ay nakakuha ng maraming values para sa argument '%q'
fr: la fonction a reçu plusieurs valeurs pour l'argument '%q'
it_it: la funzione ha ricevuto valori multipli per l'argomento '%q'
nl: functie kreeg meedere waarden voor argument '%q'
pt_br: A função obteve vários valores para o argumento '%q'
ru: функция имеет несколько значений для аргументации%q "
sv: funktionen fick flera värden för argumentet '%q'

source: function has the same sign at the ends of interval
de_de: Funktion hat an den Enden des Intervalls das gleiche Vorzeichen
es: la función tiene el mismo signo a extremos del intervalo
fr: la fonction a le même signe aux extrémités de l'intervalle
nl: functie heeft hetzelfde teken aan beide uiteinden van het interval
pt_br: a função tem o mesmo sinal nas extremidades do intervalo
ru: функция имеет один и тот же знак в конце интервала
sv: funktionen har samma teckenvärden vid slutet av intervall

source: function is defined for ndarrays only
de_de: Funktion ist nur für ndarrays definiert
es: Función solo definida para ndarrays
fr: fonction définie que pour les ndarrays
nl: functie is alleen gedefinieerd voor ndarrays
pt_br: A função é definida apenas para ndarrays
ru: Функция определяется только для массивов ndarrays
sv: funktionen är enbart definierad för ndarray

source: function missing %d required positional arguments
de_de: Funktion vermisst %d benötigte Argumente ohne Schlüsselwort
es: a la función le hacen falta %d argumentos posicionales requeridos
fil: function kulang ng %d required na positional arguments
fr: il manque %d argument(s) positionnel(s) requis pour la fonction
it_it: mancano %d argomenti posizionali obbligatori alla funzione
nl: functie mist %d vereist positionele argumenten
pt_br: função ausente %d requer argumentos posicionais
ru: Функция отсутствует %d обязательные позиционные аргументы
sv: funktion saknar %d obligatoriska positionsargument

source: function missing keyword-only argument
de_de: Funktion vermisst Nur-Schlüsselwort-Argument
es: falta palabra clave para función
fil: function nangangailangan ng keyword-only argument
fr: il manque un argument nommé obligatoire
it_it: argomento nominato mancante alla funzione
nl: functie mist keyword-only argument
pt_br: falta apenas a palavra chave do argumento da função
ru: функция отсутствует аргумент только по ключевому слову
sv: funktionen saknar nyckelordsargument

source: function missing required keyword argument '%q'
de_de: Funktion vermisst benötigtes Schlüsselwort-Argumente '%q'
es: la función requiere del argumento por palabra clave '%q'
fil: function nangangailangan ng keyword argument '%q'
fr: il manque l'argument nommé obligatoire '%q'
it_it: argomento nominato '%q' mancante alla funzione
nl: functie mist vereist sleutelwoord argument "%q
pt_br: falta apenas a palavra chave do argumento '%q' da função
ru: В функции отсутствует обязательный аргумент ключевого слова '%q'
sv: funktionen saknar det obligatoriska nyckelordsargumentet '%q'

source: function missing required positional argument #%d
de_de: Funktion vermisst benötigtes Argumente ohne Schlüsselwort #%d
es: la función requiere del argumento posicional #%d
fil: function nangangailangan ng positional argument #%d
fr: il manque l'argument positionnel obligatoire #%d
it_it: mancante il #%d argomento posizonale obbligatorio della funzione
nl: functie mist vereist positie-argument #%d
pt_br: falta o argumento #%d da posição necessária da função
ru: В функции отсутствует обязательный позиционный аргумент #%d
sv: funktionen saknar det obligatoriska positionsargumentet #%d

source: function takes %d positional arguments but %d were given
de_de: Funktion nimmt %d Argumente ohne Schlüsselwort an, aber es wurden %d angegeben
es: la función toma %d argumentos posicionales pero le fueron dados %d
fil: ang function ay kumuhuha ng %d positional arguments ngunit %d ang ibinigay
fr: la fonction prend %d argument(s) positionnels mais %d ont été donné(s)
it_it: la funzione prende %d argomenti posizionali ma ne sono stati forniti %d
nl: functie vraagt %d argumenten zonder keyword maar %d argumenten werden gegeven
pt_br: função leva %d argumentos posicionais, mas apenas %d foram passadas
ru: функция принимает %d позиционные аргументы, но %d были заданы
sv: funktionen kräver %d positionsargument men %d angavs

source: function takes exactly 9 arguments
es: la función toma exactamente 9 argumentos
fil: function kumukuha ng 9 arguments
it_it: la funzione prende esattamente 9 argomenti
nl: functie vraagt precies 9 argumenten
pt_br: função leva exatamente 9 argumentos

source: generator already executing
de_de: Generator läuft bereits
es: generador ya se esta ejecutando
fil: insinasagawa na ng generator
fr: générateur déjà en cours d'exécution
nl: generator wordt al uitgevoerd
pt_br: o gerador já está em execução
ru: генератор уже работает
sv: generatorn kör redan

source: generator ignored GeneratorExit
de_de: Generator ignoriert GeneratorExit
es: generador ignorado GeneratorExit
fil: hindi pinansin ng generator ang GeneratorExit
fr: le générateur a ignoré GeneratorExit
nl: generator negeerde GeneratorExit
pt_br: ignorando o gerador GeneratorExit
ru: генератор проигнорировал Выход
sv: generatorn ignorerade GeneratorExit

source: generator raised StopIteration
de_de: Generator hat StopIteration ausgelöst
es: el generador genero StopIteration
fr: générateur (generator) à surlevé StopIteration
pt_br: gerador StopIteration elevado
ru: генератор поднят Остановить итерацию
sv: generator kastade StopIteration

source: graphic must be 2048 bytes long
de_de: graphic muss 2048 Byte lang sein
es: graphic debe ser 2048 bytes de largo
fil: graphic ay dapat 2048 bytes ang haba
fr: graphic doit être long de 2048 octets
it_it: graphic deve essere lunga 2048 byte
nl: graphic moet 2048 bytes lang zijn
pt_br: o gráfico deve ter 2048 bytes de comprimento
ru: Длина рисунка должна составлять 2048 байт
sv: graphic måste vara 2048 byte lång

source: hash is final
de_de: Hash ist endgültig
es: el hash es final
fr: hash est final
pt_br: o hash é final
ru: хэш является окончательным
sv: hash är slutgiltig

source: heap must be a list
de_de: heap muss eine Liste sein
es: heap debe ser una lista
fil: list dapat ang heap
fr: le tas doit être une liste
it_it: l'heap deve essere una lista
nl: heap moet een lijst zijn
pt_br: a área de alocação dinâmica de variáveis (heap) deve ser uma lista
ru: куча должна быть списком
sv: heap måste vara en lista
