Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: out array is too small
de_de: Ausgabe-Array ist zu klein
es: La matriz de salida es demasiado pequeña
fr: matrice de sortie est trop petite
pt_br: a matriz externa é muito pequena
ru: Наш массив слишком мал
sv: matrisen för out är för liten

source: out must be a float dense array
de_de: Ausgabe muss ein floatdichtes Array sein
es: la matriz de salida debe ser densa de números float
fr: la matrice sortante doit être de type float
pt_br: deve ser uma matriz densa flutuante
ru: Out должен быть плотным массивом с плавающей запятой
sv: out måste vara en float dense array

source: out of range of source
es: fuera de rango de fuente
nl: buiten bereik van bron

source: out of range of target
de_de: Außerhalb des Bereichs des Ziels
es: fuera de rango del objetivo
fr: hors de l'intervalle de la cible
nl: buiten bereik van doel
pt_br: fora do alcance do alvo
ru: вне досягаемости цели
sv: utanför räckvidd för target

source: overflow converting long int to machine word
de_de: Überlauf beim konvertieren von long int zu machine word
es: desbordamiento convirtiendo long int a palabra de máquina
fil: overflow nagcoconvert ng long int sa machine word
fr: dépassement de capacité en convertissant un entier long en mot machine
it_it: overflow convertendo long int in parola
nl: overloop bij converteren van long int naar machine word
pt_br: houve um transbordamento durante a conversão int longo para a palavra de máquina
ru: переполнение преобразование длинного целого в машинное слово
sv: Konvertering av long int till machine word överskred maxvärde

source: pack expected %d items for packing (got %d)
de_de: pack erwartete %d Artikel zum Packen (erhalten %d)
es: pack espera %d items para empaquetado (se recibió %d)
fr: pack attend %d element(s) (%d reçu)
nl: pack verwachtte %d elementen (ontving %d)
pt_br: o pacote previa %d itens para a empacotamento (obteve %d)
ru: Упаковка ожидаемых %d товаров для упаковки (получил %d)
sv: pack förväntade %d stycken för packning (fick %d)

source: palette must be 32 bytes long
de_de: Die Palette muss 32 Byte lang sein
es: palette debe ser 32 bytes de largo
fil: ang palette ay dapat 32 bytes ang haba
fr: la palette doit être longue de 32 octets
it_it: la palette deve essere lunga 32 byte
nl: palette moet 32 bytes lang zijn
pt_br: a paleta deve ter 32 bytes de comprimento
ru: Длина палитры должна составлять 32 байта
sv: palette måste vara 32 bytes lång

source: palette_index should be an int
es: palette_index deberia ser un int
fil: palette_index ay dapat na int
it_it: palette_index deve essere un int
nl: palette_index moet een int zijn

source: parameters must be registers in sequence a2 to a5
de_de: Die Parameter müssen Register der Reihenfolge a2 bis a5 sein
es: los parámetros deben ser registros en secuencia de a2 a a5
fil: ang mga parameter ay dapat na nagrerehistro sa sequence a2 hanggang a5
fr: les paramètres doivent être des registres dans la séquence a2 à a5
it_it: parametri devono essere i registri in sequenza da a2 a a5
nl: parameters moeten registers zijn in de volgorde a2 tot a5
pt_br: os parâmetros devem ser registradores na sequência a2 até a5
ru: Параметры должны быть регистрами в последовательности от a2 до a5
sv: parametrarna måste registreras i följd a2-a5

source: parameters must be registers in sequence r0 to r3
de_de: Parameter müssen Register im Bereich von r0 bis r3 sein
es: los parametros deben ser registros en secuencia del r0 al r3
fil: ang mga parameter ay dapat na nagrerehistro sa sequence r0 hanggang r3
fr: les paramètres doivent être des registres dans la séquence r0 à r3
nl: parameters moeten registers zijn in de volgorde r0 tot r3
pt_br: os parâmetros devem ser registradores na sequência r0 até r3
ru: Параметры должны быть регистрами в последовательности от r0 до r3
sv: parametrarna måste registreras i följd r0-r3

source: pixel coordinates out of bounds
es: coordenadas del pixel fuera de límites
nl: pixel coördinaten buiten bereik
pt_br: as coordenadas do pixel estão fora dos limites

source: pixel value requires too many bits
es: valor del pixel require demasiado bits
nl: pixel waarde vereist te veel bits

source: pixel_shader must be displayio.Palette or displayio.ColorConverter
es: pixel_shader debe ser displayio.Palette o displayio.ColorConverter
fil: pixel_shader ay dapat displayio.Palette o displayio.ColorConverter
it_it: pixel_shader deve essere displayio.Palette o displayio.ColorConverter
nl: pixel_shader moet displayio.Palette of displayio.ColorConverter zijn

source: polygon can only be registered in one parent
es: el polígono solo se puede registrar en uno de los padres
nl: polygoon kan slechts bij één object van een hoger niveau worden geregistreerd

source: pop from an empty PulseIn
de_de: pop von einem leeren PulseIn
es: pop de un PulseIn vacío
fil: pop mula sa walang laman na PulseIn
fr: 'pop' d'une entrée PulseIn vide
it_it: pop sun un PulseIn vuoto
nl: pop van een lege PulseIn
pt_br: pop a partir de um PulseIn vazio
ru: вытолкнуть из пустого импульсного входа
sv: pop från en tom PulseIn

source: pop from empty %q
de_de: Pop aus leerem %q
es: pop desde %q vacía
fr: pop sur %q vide
nl: pop van een lege %q
pt_br: pop a partir do %q vazio
ru: Всплывающее окно из пустого %q
sv: pop från tom %q

source: port must be >= 0
de_de: Port muss >= 0 sein
es: port debe ser be >= 0
fr: port doit être >= 0
pt_br: a porta deve ser > = 0
ru: порт должен быть >= 0
sv: port måste vara >= 0

source: pow() 3rd argument cannot be 0
de_de: pow() drittes Argument darf nicht 0 sein
es: el 3er argumento de pow() no puede ser 0
fil: pow() 3rd argument ay hindi maaring 0
fr: le 3e argument de pow() ne peut être 0
it_it: il terzo argomento di pow() non può essere 0
nl: derde argument van pow() mag geen 0 zijn
pt_br: O terceiro argumento pow() não pode ser 0
ru: 3-й аргумент pow() не может быть равен 0
sv: pow() 3: e argument kan inte vara 0

source: pow() with 3 arguments requires integers
de_de: pow() mit 3 Argumenten erfordert ganze Zahlen
es: pow() con 3 argumentos requiere enteros
fil: pow() na may 3 argumento kailangan ng integers
fr: pow() avec 3 arguments nécessite des entiers
it_it: pow() con 3 argomenti richiede interi
nl: pow() met 3 argumenten vereist integers
pt_br: o pow() com 3 argumentos requer números inteiros
ru: pow() с 3 аргументами требует целых чисел
sv: pow() med 3 argument kräver heltal

source: pressing boot button at start up.
es: presionando botón de arranque al inicio.
nl: druk bootknop in bij opstarten.

source: pressing both buttons at start up.
es: presionando ambos botones al inicio.
nl: druk beide knoppen in bij opstarten.

source: pressing the left button at start up
es: presione el botón izquierdo al arranque

source: pull masks conflict with direction masks
de_de: Pull-Masken kollidieren mit Richtungsmasken
es: máscara de pull en conflicto con máscara de dirección
fr: masque pull est en conflit avec les masques de direction
pt_br: puxe as máscaras em conflito com as máscaras de direção
ru: Маски вытягивания конфликтуют с масками направления
sv: pull-mask är i konflikt med riktnings-mask

source: pull_threshold must be between 1 and 32
es: pull_threshold debe esta entre 1 y 32

source: push_threshold must be between 1 and 32
es: push_threshold debe esta entre 1 y 32

source: queue overflow
es: desbordamiento de cola(queue)
fil: puno na ang pila (overflow)
it_it: overflow della coda
nl: wachtrij overloop

source: raw f-strings are not implemented
es: no está implementado cadenas-f sin procesar
nl: ruwe f-strings zijn niet geïmplementeerd

source: real and imaginary parts must be of equal length
de_de: Real- und Imaginärteile müssen gleich lang sein
es: las partes reales e imaginarias deben ser de igual longitud
fr: les parties réelles et imaginaires doivent être de longueur égale
nl: reëel en imaginair deel moeten gelijke lengte hebben
pt_br: partes reais e imaginárias devem ter o mesmo comprimento
ru: реальные и воображаемые части должны быть одинаковой длины
sv: verkliga och imaginära delar måste ha samma längd

source: relative import
de_de: relativer Import
es: import relativo
fr: import relatif
it_it: importazione relativa
nl: relatieve import
pt_br: importação relativa
ru: Относительный импорт
sv: relativ import

source: requested length %d but object has length %d
de_de: die ersuchte Länge ist %d, aber das Objekt hat eine Länge von %d
es: longitud solicitada %d pero el objeto tiene longitud %d
fil: hiniling ang haba %d ngunit may haba ang object na %d
fr: la longueur requise est %d mais l'objet est long de %d
it_it: lunghezza %d richiesta ma l'oggetto ha lunghezza %d
nl: gevraagde lengte is %d maar object heeft lengte %d
pt_br: o comprimento solicitado %d, porém o objeto tem comprimento %d
ru: запрашиваемая длина %d, но объект имеет длину %d
sv: begärd längd %d men objektet har längden %d

source: results cannot be cast to specified type
de_de: Ergebnisse können nicht in den angegebenen Typ umgewandelt werden
es: resultados no pueden aplicar cast a un tipo específico
fr: résultats ne peuvent être transformé au type spécifié
nl: resultaat kan niet naar gespecificeerd type geconverteerd worden
pt_br: os resultados não podem ser lançados para um determinado tipo
ru: Результаты не могут быть приведены к указанному типу
sv: resultaten kan inte castas till angiven typ

source: return annotation must be an identifier
de_de: Rückgabewert-Beschreibung muss ein Identifier sein
es: la anotación de retorno debe ser un identificador
fil: return annotation ay dapat na identifier
fr: l'annotation de return doit être un identifiant
nl: return annotatie moet een identifier zijn
pt_br: a anotação do retorno deve ser um identificador
ru: Возвращаемая аннотация должна быть идентификатором
sv: retur-annotation måste vara en identifierare

source: return expected '%q' but got '%q'
de_de: Rückgabe (return) erwartet '%q', hat aber '%q' erhalten
es: retorno esperado '%q' pero se obtuvo '%q'
fil: return umasa ng '%q' pero ang nakuha ay ‘%q’
fr: return attendait '%q' mais a reçu '%q'
it_it: return aspettava '%q' ma ha ottenuto '%q'
nl: return verwacht '%q' maar ontving '%q'
pt_br: o retorno esperado era '%q', porém obteve '%q'
ru: Возврат ожидался '%q', но получил '%q'
sv: retur förväntade '%q' men fick '%q'

source: rgb_pins[%d] duplicates another pin assignment
de_de: rgb_pins[%d] dupliziert eine andere Pinbelegung
es: rgb_pins[%d] duplica otra asignación de pin
fr: rgb_pins[%d] duplique une autre affectation de broches
nl: rgb_pins[%d] is hetzelfde als een andere pintoewijzing
pt_br: rgb_pins[%d] duplica outra atribuição dos pinos
ru: rgb_pins[%d] дублирует другое назначение пинов
sv: rgb_pins[%d] duplicerar en annan pinntilldelning

source: rgb_pins[%d] is not on the same port as clock
de_de: rgb_pins[%d] befindet sich nicht am selben Port wie clock
es: rgb_pins[%d] no está en el mismo puerto que el reloj
fr: rgb_pins[%d] n'est pas sur le même port que l'horloge
nl: rgb_pins[%d] bevindt zich niet op dezelfde poort als klok
pt_br: rgb_pins[%d] não está na mesma porta que o clock
ru: rgb_pins[%d] не находится на том же порту что и часы
sv: rgb_pins[%d] är inte på samma port som en klocka

source: roll argument must be an ndarray
de_de: Roll-Argument muss ein ndarray sein
es: Argumento enrolado tiene que ser un ndarray
fr: paramêtre roll doit être un ndarray
nl: roll argument moet een ndarray zijn
pt_br: argumento de enrolar deve ser um ndarray
ru: аргумент roll должен быть массивом ndarray
sv: argumentet roll måste vara en ndarray

source: sample_source buffer must be a bytearray or array of type 'h', 'H', 'b' or 'B'
es: sample_source buffer debe ser un bytearray o un array de tipo 'h', 'H', 'b' o'B'
fil: ang sample_source buffer ay dapat na isang bytearray o array ng uri na 'h', 'H', 'b' o'B'
it_it: il buffer sample_source deve essere un bytearray o un array di tipo 'h', 'H', 'b' o 'B'
nl: sample_source buffer moet een bytearray of array van type 'h', 'H', 'b' of 'B' zijn

source: sampling rate out of range
de_de: Abtastrate außerhalb der Reichweite
es: frecuencia de muestreo fuera de rango
fil: pagpili ng rate wala sa sakop
fr: taux d'échantillonage hors intervalle
it_it: frequenza di campionamento fuori intervallo
nl: bemonsteringssnelheid buiten bereik
pt_br: Taxa de amostragem fora do intervalo
ru: Частота дискретизации выходит за пределы допустимого диапазона
sv: samplingsfrekvens utanför räckvidden

source: schedule queue full
de_de: Warteschlange voll
es: cola de planificación llena
fr: file de schédule pleine
pt_br: fila de espera cheia
ru: Расписание Очередь заполнена
sv: schemakön full

source: script compilation not supported
de_de: kompilieren von Skripten nicht unterstützt
es: script de compilación no soportado
fil: script kompilasyon hindi supportado
fr: compilation de script non supportée
it_it: compilazione dello scrip non suportata
nl: scriptcompilatie wordt niet ondersteund
pt_br: compilação de script não suportada
ru: Компиляция скриптов не поддерживается
sv: skriptkompilering stöds inte

source: set unsupported
de_de: nicht unterstützt
es: sin capacidades para el conjunto
fr: set non-supporté
pt_br: conjunto não suportado
ru: Установить не поддерживается
sv: set stöds inte

source: shape must be a tuple
es: forma tiene que ser una tupla
nl: vorm moet een tupel zijn

source: short read
de_de: kurze Lektüre
es: lectura corta
fr: donnée trop petite
pt_br: leitura curta
ru: короткое чтение
sv: kort läsning

source: sign not allowed in string format specifier
de_de: Vorzeichen im Zeichenfolgenformatbezeichner nicht zulässig
es: signo no permitido en el espeficador de string format
fil: sign hindi maaring string format specifier
fr: signe non autorisé dans les spéc. de formats de chaînes de caractères
it_it: segno non permesso nello spcificatore di formato della stringa
nl: teken niet toegestaan in string formaatspecificatie
pt_br: sinal não permitido no especificador do formato da sequência
ru: Знак не разрешен в спецификаторе строкового формата
sv: tecknet tillåts inte i strängformatspecificerare

source: sign not allowed with integer format specifier 'c'
de_de: Vorzeichen mit ganzzahligem Formatbezeichner 'c' nicht erlaubt
es: signo no permitido con el especificador integer format 'c'
fil: sign hindi maari sa integer format specifier 'c'
fr: signe non autorisé avec la spéc. de format d'entier 'c'
it_it: segno non permesso nello spcificatore di formato 'c' della stringa
nl: teken niet toegestaan bij integer formaatspecificatie 'c'
pt_br: sinal não permitido com o especificador no formato inteiro 'c'
ru: Знак не разрешен со спецификатором целочисленного формата 'c'
sv: tecken tillåts inte med heltalsformatspecificeraren 'c'

source: single '}' encountered in format string
es: un solo '}' encontrado en format string
fil: isang '}' nasalubong sa format string
it_it: '}' singolo presente nella stringa di formattazione
nl: enkele '}' aangetroffen in formaat tekenreeks (string)

source: size is defined for ndarrays only
de_de: Größe ist nur für ndarrays definiert
es: el tamaño se define solo para ndarrays
fr: la taille n'est définie que pour les ndarrays
nl: omvang is alleen voor ndarrays gedefinieerd
pt_br: o tamanho é definido apenas para os ndarrays
ru: размер определен только для массива ndarrays
sv: storlek är enbart definierad ndarrays

source: sleep length must be non-negative
es: la longitud de sleep no puede ser negativa
fil: sleep length ay dapat hindi negatibo
it_it: la lunghezza di sleed deve essere non negativa
nl: de slaapduur mag niet negatief zijn
pt_br: a duração do sleep não deve ser negativo

source: slice step can't be zero
es: el tamaño de la división no puede ser cero
nl: segmentstap mag niet nul zijn

source: slice step cannot be zero
es: slice step no puede ser cero
fil: slice step ay hindi puedeng 0
it_it: la step della slice non può essere zero
nl: segmentstap mag niet nul zijn

source: slice unsupported
de_de: Slice nicht unterstützt
es: sin capacidades para rebanado
fr: slice non-supporté
pt_br: fatia não suportada
ru: Фрагмент не поддерживается
sv: slice stöds inte

source: small int overflow
de_de: small int Überlauf
es: pequeño int desbordamiento
fr: dépassement de capacité d'un entier court
nl: small int overloop
pt_br: transbordamento int pequeno
ru: Маленькое переполнение int
sv: värdet för small int överskreds

source: soft reboot
de_de: weicher reboot
es: reinicio suave
fil: malambot na reboot
fr: redémarrage logiciel
nl: zachte herstart
pt_br: reinicialização soft
ru: Мягкая перезагрузка
sv: mjuk omstart

source: sort argument must be an ndarray
de_de: Sortierungsargument muss ein ndarray sein
es: argumento de ordenado debe ser un ndarray
fr: le paramètre de «sort» doit être un ndarray
nl: sorteerargument moet een ndarray zijn
pt_br: o argumento da classificação deve ser um ndarray
ru: аргумент сортировки должен быть массивом ndarray
sv: argumentet sort måste vara en ndarray

source: sos array must be of shape (n_section, 6)
de_de: sos-Array muss die Form haben (n_section, 6)
es: el arreglo sos debe de forma (n_section, 6)
fr: la matrice sos doit être de forme (n_section, 6)
nl: sos array moet vorm (n_section, 6) hebben
pt_br: o sos da matriz deve estar na forma (n_section, 6)
ru: Массив sos должен иметь форму (n_section, 6)
sv: sos array måste ha form (n_section, 6)

source: sos[:, 3] should be all ones
de_de: sos[:, 3] sollten alle Einsen sein
es: sos[:, 3] deberían ser todos unos
fr: sos[:, 3] doivent tous être à un
nl: sos[:, 3] moeten allemaal 1 zijn
pt_br: sos[:, 3] deve ser um em todos
ru: sos[:, 3] должны быть все единицы
sv: sos[:, 3] måste vara ettor

source: sosfilt requires iterable arguments
de_de: sosfilt erfordert iterierbare Argumente
es: sosfilt requiere argumentos iterables
fr: sosfilt nécessite des argument itératifs
nl: sosfilt vereist itereerbare argumenten
pt_br: o sosfilt requer que os argumentos sejam iteráveis
ru: sosфильтр требует повторяющихся аргументов
sv: sosfilt kräver iterable argument

source: source palette too large
de_de: Quell-Palette zu groß
es: paleta fuente muy larga
fr: la palette source est trop grande
nl: bronpalet te groot
pt_br: a paleta de origem é muito grande
ru: Исходная палитра слишком велика
sv: källpalett för stor

source: start/end indices
de_de: start/end Indizes
es: índices inicio/final
fil: start/end indeks
fr: indices de début/fin
nl: start/stop indices
pt_br: os índices de início/fim
ru: Начальные/конечные индексы
sv: start-/slutindex

source: start_x should be an int
es: start_x deberia ser un int
nl: start_x moet een int zijn

source: step must be non-zero
es: paso debe ser numero no cero
fil: step ay dapat hindi zero
it_it: step deve essere non zero
nl: step mag geen nul zijn

source: stop must be 1 or 2
es: stop debe ser 1 ó 2
fil: stop dapat 1 o 2
nl: stop moet 1 of 2 zijn

source: stop not reachable from start
de_de: stop ist von start aus nicht erreichbar
es: stop no se puede alcanzar del principio
fil: stop hindi maabot sa simula
fr: stop n'est pas accessible au démarrage
it_it: stop non raggiungibile dall'inizio
nl: stop is niet bereikbaar vanaf start
pt_br: stop não está acessível a partir do início
ru: Остановка недоступна с начального запуска
sv: stop kan inte nås från start

source: stream operation not supported
de_de: stream operation ist nicht unterstützt
es: operación stream no soportada
fil: stream operation hindi sinusuportahan
fr: opération de flux non supportée
it_it: operazione di stream non supportata
nl: stream operatie niet ondersteund
pt_br: a operação do fluxo não é compatível
ru: Потоковая операция не поддерживается
sv: stream-åtgärd stöds inte

source: string indices must be integers, not %q
es: índices de cadena deben ser enteros, no %q
nl: string indices moeten integers zijn, geen %q

source: string not supported; use bytes or bytearray
es: string no soportado; usa bytes o bytearray
fil: string hindi supportado; gumamit ng bytes o kaya bytearray
nl: string niet ondersteund; gebruik bytes of bytearray

source: struct: can't index
de_de: struct: kann nicht indiziert werden
es: struct: no puede indexar
fr: struct ne peut être indexé
pt_br: struct: não é possível indexar
ru: структура: невозможно индексировать
sv: struct: kan inte indexera

source: struct: index out of range
de_de: struct: index außerhalb gültigen Bereichs
es: struct: index fuera de rango
fil: struct: index hindi maabot
fr: struct : index hors intervalle
it_it: struct: indice fuori intervallo
nl: struct: index buiten bereik
pt_br: struct: índice fora do intervalo
ru: структура: индекс вне диапазона
sv: struct: index utanför intervallet

source: struct: no fields
de_de: struct: keine Felder
es: struct: sin campos
fil: struct: walang fields
fr: struct : aucun champs
it_it: struct: nessun campo
nl: struct: geen velden
pt_br: struct: sem campos
ru: Структура: Нет полей
sv: struct: inga fält

source: substring not found
de_de: substring nicht gefunden
es: substring no encontrado
fil: substring hindi nahanap
fr: sous-chaîne non trouvée
it_it: sottostringa non trovata
nl: deelreeks niet gevonden
pt_br: a substring não foi encontrada
ru: Подстрока не найдена
sv: det gick inte att hitta delsträng

source: super() can't find self
de_de: super() kann self nicht finden
es: super() no puede encontrar self
fil: super() hindi mahanap ang sarili
fr: super() ne peut pas trouver self
nl: super() kan self niet vinden
pt_br: o super() não consegue se encontrar
ru: super() не может найти себя
sv: super() kan inte hitta self

source: syntax error in JSON
de_de: Syntaxfehler in JSON
es: error de sintaxis en JSON
fil: sintaks error sa JSON
fr: erreur de syntaxe JSON
it_it: errore di sintassi nel JSON
nl: syntaxisfout in JSON
pt_br: erro de sintaxe no JSON
ru: синтаксис ошибка в JSON
sv: syntaxfel i JSON

source: syntax error in uctypes descriptor
de_de: Syntaxfehler in uctypes Deskriptor
es: error de sintaxis en el descriptor uctypes
fil: may pagkakamali sa sintaks sa uctypes descriptor
fr: erreur de syntaxe dans le descripteur d'uctypes
it_it: errore di sintassi nel descrittore uctypes
nl: syntaxisfout in uctypes aanduiding
pt_br: houve um erro de sintaxe no descritor uctypes
ru: Синтаксическая ошибка в дескрипторе UCTYPES
sv: syntaxfel i uctypes deskriptor

source: threshold must be in the range 0-65536
es: limite debe ser en el rango 0-65536
fil: ang threshold ay dapat sa range 0-65536
it_it: la soglia deve essere nell'intervallo 0-65536
nl: drempelwaarde moet in het bereik 0-65536 liggen

source: tile must be greater than zero
es: tile debe sera mas grande que cero

source: time.struct_time() takes a 9-sequence
es: time.struct_time() toma un sequencio 9
fil: time.struct_time() kumukuha ng 9-sequence
nl: time.struct_time() accepteert een 9-rij

source: timeout duration exceeded the maximum supported value
de_de: Das Zeitlimit hat den maximal zulässigen Wert überschritten
es: la duración de tiempo de espera ha excedido la capacidad máxima del valor
fr: le délai d'expiration a dépassé la valeur maximale prise en charge
nl: time-outduur is groter dan de ondersteunde maximale waarde
pt_br: a duração do tempo limite excedeu o valor máximo suportado
ru: Продолжительность таймаута превысила максимальное поддерживаемое значение
sv: timeout-längd överskred det maximala värde som stöds

source: timeout must be 0.0-100.0 seconds
es: el tiempo de espera debe ser 0.0-100.0 segundos
nl: timeout moet tussen 0.0 en 100.0 seconden zijn

source: timeout must be < 655.35 secs
de_de: timeout muss kleiner als 655.35 Sekunden sein
es: timeout debe ser < 655.35 segundos
fr: le délai (timeout) doit être < 655.35 secondes
pt_br: o tempo limite deve ser < 655.35 seg
ru: таймаут должен быть < 655.35 сек
sv: timeout måste vara < 655,35 sekunder

source: timeout must be >= 0.0
es: tiempo muerto debe ser >= 0.0
nl: timeout moet groter dan 0.0 zijn
