Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: timeout waiting for v1 card
de_de: Zeitlimit beim warten auf v1 Karte
es: tiempo de espera agotado esperando por tarjeta v1
fr: délai d'expiration dépassé en attendant une carte v1
nl: timeout bij wachten op v1 kaart
pt_br: o tempo limite na espera pelo cartão v1
ru: Таймаут в ожидании карты v1
sv: timeout för v1-kort

source: timeout waiting for v2 card
de_de: Zeitlimit beim warten auf v2 Karte
es: tiempo de espera agotado esperando a tarjeta v2
fr: délai d'expiration dépassé en attendant une carte v2
nl: timeout bij wachten op v2 kaart
pt_br: o tempo limite na espera pelo cartão v2
ru: Таймаут ожидания карты v2
sv: timeout för v2-kort

source: timestamp out of range for platform time_t
de_de: Zeitstempel außerhalb des Bereichs für Plattform time_t
es: timestamp fuera de rango para plataform time_t
fil: wala sa sakop ng timestamp ang platform time_t
fr: timestamp hors intervalle pour le 'time_t' de la plateforme
it_it: timestamp è fuori intervallo per il time_t della piattaforma
nl: timestamp buiten bereik voor platform time_t
pt_br: timestamp fora do intervalo para a plataforma time_t
ru: Временная метка выходит за пределы допустимого диапазона для платформы time_t
sv: timestamp utom räckvidd för plattformens "time_t"

source: tobytes can be invoked for dense arrays only
de_de: tobytes kann nur für dichte Arrays aufgerufen werden
es: tobytes solo pueden ser invocados por arrays densos
fr: tobytes ne peut être appelée que pour des matrices dense
nl: tobytes kunnen alleen ingeroepen worden voor gesloten arrays
pt_br: os tobytes podem ser invocados apenas nas matrizes densas
ru: Тобайты могут быть вызваны только для плотных массивов
sv: tobyte kan enbart anropas för täta matriser

source: too many arguments provided with the given format
es: demasiados argumentos provistos con el formato dado
fil: masyadong maraming mga argumento na ibinigay sa ibinigay na format
it_it: troppi argomenti forniti con il formato specificato
nl: te veel argumenten opgegeven bij dit formaat

source: too many dimensions
de_de: zu viele Dimensionen
es: demasiadas dimensiones
fr: trop de dimensions
pt_br: dimensões demais
ru: Слишком много измерений
sv: för många dimensioner

source: too many indices
de_de: zu viele Indizes
es: demasiados índices
fr: trop d'indices
nl: te veel indices
pt_br: índices demais
ru: Слишком много индексов
sv: för många index

source: too many locals for native method
de_de: zu viele Lokale für die native Methode
es: muchas llamadas locales para método nativo
fr: trop de locals pour une méthode native
pt_br: locais demais para o método nativo
ru: Слишком много местных жителей для нативного метода
sv: för många locals för nativ metod

source: too many values to unpack (expected %d)
de_de: zu viele Werte zum Auspacken (%d erwartet)
es: demasiados valores para descomprimir (%d esperado)
fil: masyadong maraming values para i-unpact (umaasa ng %d)
fr: trop de valeur à dégrouper (%d attendues)
it_it: troppi valori da scompattare (%d attesi)
nl: te veel waarden om uit te pakken (%d verwacht)
pt_br: valores demais para descompactar (esperado %d)
ru: Слишком много значений для распаковки (ожидаемый %d)
sv: för många värden att packa upp (förväntat %d)

source: trapz is defined for 1D arrays of equal length
de_de: trapz ist für 1D-Arrays gleicher Länge definiert
es: trapz está definido para arreglos 1D de igual tamaño
fr: trapz n'est défini que pour des matrices 1D de longueur égales
nl: trapz is gedefinieerd voor eendimensionale arrays van gelijke lengte
pt_br: o trapz está definido para 1D arrays de igual tamanho
ru: ловушка определена для одномерных 1D массивов одинаковой длины
sv: trapz är definierad för 1D-matriser med samma längd

source: trapz is defined for 1D iterables
de_de: trapz ist für 1D-Iterables definiert
es: trapz está definido para iterables 1D
fr: trapz est défini pour les 1D itérables
pt_br: o trapz é definido para iteráveis 1D
ru: ловушка определена для одномерных 1D итераций
sv: trapz är definierat för 1D-iterabla

source: tuple/list has wrong length
de_de: tupel/list hat falsche Länge
es: tupla/lista tiene una longitud incorrecta
fil: mali ang haba ng tuple/list
fr: tuple/liste a une mauvaise longueur
it_it: tupla/lista ha la lunghezza sbagliata
nl: tuple of lijst heeft onjuiste lengte
pt_br: a tupla/lista está com tamanho incorreto
ru: Кортеж/список имеет неправильную длину
sv: tupel/lista har fel längd

source: twai_driver_install returned esp-idf error #%d
de_de: twai_driver_install gab esp-idf-Fehler zurück #%d
es: twai_driver_install devolvió esp-idf error #%d
fr: twai_driver_install a renvoyé l'erreur esp-idf #%d
nl: twai_driver_install geeft esp-idf fout #%d
pt_br: o twai_driver_install retornou um erro esp-idf #%d
ru: twai_driver_install вернул ошибку esp-idf #%d
sv: twai_driver_install returnerade esp-idf-fel #%d

source: twai_start returned esp-idf error #%d
de_de: twai_start gab esp-idf-Fehler zurück #%d
es: twai_start devolvió esp-idf error #%d
fr: twai_start a renvoyé l'erreur esp-idf #%d
nl: twai_start geeft esp-idf error #%d
pt_br: o twai_start retornou um erro esp-idf #%d
ru: twai_start вернул ошибку esp-idf #%d
sv: twai_start returnerade esp-idf-fel #%d

source: tx and rx cannot both be None
de_de: tx und rx können nicht beide None sein
es: Ambos tx y rx no pueden ser None
fil: tx at rx hindi pwedeng parehas na None
fr: tx et rx ne peuvent être 'None' tous les deux
it_it: tx e rx non possono essere entrambi None
nl: tx en rx kunnen niet beiden None zijn
pt_br: TX e RX não podem ser ambos
ru: tx и rx не могут быть одновременно None
sv: tx och rx kan inte båda vara None

source: type '%q' is not an acceptable base type
de_de: Typ '%q' ist kein akzeptierter Basis-Typ
es: type '%q' no es un tipo de base aceptable
fil: hindi maari ang type na '%q' para sa base type
fr: le type '%q' n'est pas un type de base accepté
it_it: il tipo '%q' non è un tipo di base accettabile
nl: type '%q' is geen aanvaardbaar basistype
pt_br: o tipo '%q' não é um tipo base aceitável
ru: Тип '%Q' не является допустимым базовым типом
sv: typ '%q' är inte en acceptabel bastyp

source: type is not an acceptable base type
de_de: Typ ist kein akzeptierter Basis-Typ
es: type no es un tipo de base aceptable
fil: hindi puede ang type para sa base type
fr: le type n'est pas un type de base accepté
it_it: il tipo non è un tipo di base accettabile
nl: type is geen aanvaardbaar basistype
pt_br: tipo não é um tipo base aceitável
ru: Тип не является приемлемым базовым типом
sv: typ är inte en acceptabel bastyp

source: type object '%q' has no attribute '%q'
de_de: Typ-Objekt '%q' hat kein Attribut '%q'
es: objeto de tipo '%q' no tiene atributo '%q'
fil: type object '%q' ay walang attribute '%q'
fr: l'objet de type '%q' n'a pas d'attribut '%q'
it_it: l'oggetto di tipo '%q' non ha l'attributo '%q'
nl: objecttype '%q' heeft geen attribuut '%q'
pt_br: o objeto tipo '%q' não possuí atributo '%q'
ru: тип объекта '%q' не имеет атрибута '%q "
sv: typobjektet '%q' har inget attribut '%q'

source: type object 'generator' has no attribute '__await__'
es: objeto tipo 'generator' no tiene un atributo '__await__'
nl: het type object 'generator' heeft geen attribuut '__await__'

source: type takes 1 or 3 arguments
de_de: Typ akzeptiert 1 oder 3 Argumente
es: type acepta 1 ó 3 argumentos
fil: type kumuhuha ng 1 o 3 arguments
fr: le type prend 1 ou 3 arguments
it_it: tipo prende 1 o 3 argomenti
nl: type accepteert 1 of 3 argumenten
pt_br: o tipo usa 1 ou 3 argumentos
ru: тип занимает 1 или 3 аргумента
sv: typen tar 1 eller 3 argument

source: ulonglong too large
de_de: ulonglong zu groß
es: ulonglong muy largo
fil: ulonglong masyadong malaki
fr: ulonglong trop grand
it_it: ulonglong troppo grande
nl: ulonglong te groot
pt_br: ulonglong é muito grande
ru: голова длинная слишком большая
sv: ulonglong för stor

source: unary op %q not implemented
de_de: Der unäre Operator %q ist nicht implementiert
es: Operación unica %q no implementada
fil: unary op %q hindi implemented
fr: opération unaire '%q' non implémentée
it_it: operazione unaria %q non implementata
nl: unair op %q niet geïmplementeerd
pt_br: op %q unário não foi implementado
ru: унарная операция %q не реализована
sv: binär op %q är inte implementerad

source: unexpected indent
de_de: unerwarteter Einzug (Einrückung) Bitte Leerzeichen am Zeilenanfang kontrollieren
es: sangría inesperada
fil: hindi inaasahang indent
fr: indentation inattendue
it_it: indentazione inaspettata
nl: onverwachte inspringing
pt_br: recuo inesperado
ru: Неожиданный отступ
sv: oväntat indrag

source: unexpected keyword argument
de_de: unerwartetes Schlüsselwort-Argument
es: argumento por palabra clave inesperado
fil: hindi inaasahang argumento ng keyword
fr: paramètre nommé inattendu
it_it: argomento nominato inaspettato
nl: onverwacht trefwoordargument
pt_br: argumento inesperado da palavra-chave
ru: Неожиданный аргумент ключевого слова
sv: oväntat nyckelordsargument

source: unexpected keyword argument '%q'
de_de: unerwartetes Schlüsselwort-Argument '%q'
es: argumento por palabra clave inesperado '%q'
fil: hindi inaasahang argumento ng keyword na '%q'
fr: paramètre nommé '%q' inattendu
it_it: argomento nominato '%q' inaspettato
nl: onverwacht trefwoordargument '%q'
pt_br: argumento inesperado da palavra-chave '%q'
ru: неожиданный аргумент ключевого слова '%q'
sv: oväntat nyckelordsargument '%q'

source: unicode name escapes
de_de: Escaping von Unicode-Namen
es: nombre en unicode escapa
fr: échappements de nom unicode
nl: op naam gebaseerde unicode escapes zijn niet geïmplementeerd
pt_br: escapar o nome unicode
ru: Экранирование имен в Юникоде
sv: unicode-namn flyr

source: unindent does not match any outer indentation level
es: sangría no coincide con ningún nivel exterior
fil: unindent hindi tugma sa indentation level sa labas
nl: inspringing komt niet overeen met hoger gelegen inspringingsniveaus

source: unknown conversion specifier %c
de_de: unbekannter Konvertierungsspezifizierer %c
es: especificador de conversión %c desconocido
fil: hindi alam ang conversion specifier na %c
fr: spécification %c de conversion inconnue
it_it: specificatore di conversione %s sconosciuto
nl: onbekende conversiespecificatie %c
pt_br: especificador de conversão desconhecido %c
ru: Неизвестный спецификатор преобразования %c
sv: okänd konverteringsspecificerare %c

source: unknown format code '%c' for object of type '%q'
de_de: Unbekannter Formatcode '%c' für Objekt vom Typ '%q'
es: formato de código desconocicdo '%c' para objeto de tipo '%q'
fr: code de formatage inconnu '%c' pour objet de type '%q'
nl: onbekende formaatcode '%c' voor object van type '%q'
pt_br: o formato do código '%c' é desconhecido para o objeto do tipo '%q'
ru: Неизвестный код формата '%c' для объекта типа '%q'
sv: okänd formatkod '%c' för objekt av typ '%q'

source: unknown type
de_de: unbekannter Typ
es: tipo desconocido
fil: hindi malaman ang type (unknown type)
fr: type inconnu
it_it: tipo sconosciuto
nl: onbekend type
pt_br: tipo desconhecido
ru: Неизвестный тип
sv: okänd typ

source: unknown type '%q'
de_de: unbekannter Typ '%q'
es: tipo desconocido '%q'
fil: hindi malaman ang type '%q'
fr: type '%q' inconnu
it_it: tipo '%q' sconosciuto
nl: onbekend type '%q'
pt_br: tipo desconhecido '%q'
ru: Неизвестный тип '%q'
sv: okänd typ '%q'

source: unmatched '{' in format
es: No coinciden '{' en format
fil: hindi tugma ang '{' sa format
it_it: '{' spaiato nella stringa di formattazione
nl: '{' zonder overeenkomst in formaat

source: unreadable attribute
de_de: nicht lesbares Attribut
es: atributo no legible
fil: hindi mabasa ang attribute
fr: attribut illisible
it_it: attributo non leggibile
nl: onleesbaar attribuut
pt_br: atributo ilegível
ru: Нечитаемый атрибут
sv: attribut kan inte läsas

source: unsupported %q type
de_de: Nicht unterstützter %q-Typ
es: tipo de %q no soportado
fr: type %q non pris on charge
nl: niet ondersteund %q type
pt_br: tipo %q não suportado
ru: Неподдерживаемый тип %Q
sv: typ %q stöds inte

source: unsupported Thumb instruction '%s' with %d arguments
de_de: nicht unterstützter Thumb-Befehl '%s' mit %d Argumenten
es: instrucción de tipo Thumb no admitida '%s' con %d argumentos
fil: hindi sinusuportahan ang thumb instruktion '%s' sa %d argumento
fr: instruction Thumb '%s' non supportée avec %d paramètres
nl: niet ondersteunde Thumb instructie '%s' met %d argumenten
pt_br: instrução Thumb '%s' não compatível com argumentos %d
ru: неподдерживаемая инструкция Thumb '%s' с аргументами %d
sv: Thumb-instruktion '%s' med %d argument stöd inte

source: unsupported Xtensa instruction '%s' with %d arguments
de_de: nicht unterstützte Xtensa-Anweisung '%s' mit %d Argumenten
es: instrucción Xtensa '%s' con %d argumentos no soportada
fil: hindi sinusuportahan ang instruction ng Xtensa '%s' sa %d argumento
fr: instruction Xtensa '%s' non supportée avec %d paramètres
it_it: istruzione '%s' Xtensa non supportata con %d argomenti
nl: niet ondersteunde Xtensa instructie '%s' met %d argumenten
pt_br: instrução Xtensa '%s' não compatível com argumentos %d
ru: неподдерживаемая инструкция Xtensa '%s' с аргументами %d
sv: Xtensa-instruktion '%s' med %d argument stöds inte

source: unsupported format character '%c' (0x%x) at index %d
de_de: nicht unterstütztes Formatzeichen '%c' (0x%x) bei Index %d
es: carácter no soportado '%c' (0x%x) en índice %d
fil: hindi sinusuportahan ang format character na '%c' (0x%x) sa index %d
fr: caractère de format '%c' (0x%x) non supporté à l'index %d
it_it: carattere di formattazione '%c' (0x%x) non supportato all indice %d
nl: niet ondersteund formaatkarakter '%c' (0x%x) op index %d
pt_br: o caractere do formato não é compatível '%c' (0x%x) no índice %d
ru: Неподдерживаемый символ формата '%c' (0x%x) при индексе %d
sv: Formattecknet '%c' (0x%x) stöds inte vid index %d

source: unsupported type for %q: '%q'
es: tipo no soportado para %q: '%q'
nl: niet ondersteund type voor %q: '%q'

source: unsupported type for operator
de_de: nicht unterstützter Typ für Operator
es: tipo de operador no soportado
fil: hindi sinusuportahang type para sa operator
fr: type non supporté pour l'opérateur
it_it: tipo non supportato per l'operando
nl: niet ondersteund type voor operator
pt_br: tipo não compatível para o operador
ru: Неподдерживаемый тип для оператора
sv: typ stöds inte för operatören

source: unsupported types for %q: '%q', '%q'
de_de: nicht unterstützte Typen für %q: '%q', '%q'
es: tipos no soportados para %q: '%q', '%q'
fr: types non supportés pour %q: '%q', '%q'
nl: niet ondersteunde types voor %q: '%q', '%q'
pt_br: tipo sem suporte para %q: '%q', '%q'
ru: Неподдерживаемые типы для %q: '%q', '%q'
sv: typen %q stöder inte '%q', '%q'

source: value must fit in %d byte(s)
de_de: Wert muss in %d Byte(s) passen
es: el valor debe caber en %d byte(s)
fr: la valeur doit tenir dans %d octet(s)
nl: waarde moet in %d byte(s) passen
pt_br: o valor deve caber em %d byte(s)
ru: Значение должно совпадать с байтами %d
sv: värdet måste passa i %d byte(s)

source: value_count must be > 0
es: value_count debe ser > 0
nl: value_count moet groter dan 0 zijn

source: watchdog not initialized
es: watchdog no inicializado
nl: watchdog niet geïnitialiseerd

source: watchdog timeout must be greater than 0
es: el tiempo de espera del perro guardián debe ser mayor a 0
nl: watchdog time-out moet groter zijn dan 0

source: width must be from 2 to 8 (inclusive), not %d
es: ancho debe estar entre 2 y 8 (inclusivamente), no %d

source: width must be greater than zero
de_de: Breite muss größer als 0 sein
es: el ancho debe ser mayor que cero
fr: width doit être plus que zero
nl: breedte moet groter dan nul zijn
pt_br: a largura deve ser maior que zero
ru: ширина должна быть больше нуля
sv: width måste vara större än noll

source: wifi is not enabled
de_de: wifi ist nicht aktiviert
es: wifi no esta habilitado
fr: wifi n'est pas activé
pt_br: o wifi não está ativo
ru: Wi-Fi не включен
sv: WiFi är inte aktiverat

source: window must be <= interval
de_de: Fenster muss <= Intervall sein
es: la ventana debe ser <= intervalo
fr: la fenêtre (window) doit être <= intervalle (interval)
nl: window moet <= interval zijn
pt_br: a janela deve ser <= intervalo
ru: окно должно быть <= интервал
sv: window måste vara <= interval

source: wrong axis index
de_de: falscher Achsenindex
es: indice de eje erróneo
fr: index d'axe incorrecte
nl: foute index voor as
pt_br: índice do eixo errado
ru: Неправильный индекс оси
sv: fel axelindex

source: wrong axis specified
de_de: falsche Achse gewählt
es: eje especificado erróneo
fr: axe incorrecte spécifiée
nl: onjuiste as gespecificeerd
pt_br: um eixo errado foi definido
ru: Указана неправильная ось
sv: fel axel angiven

source: wrong input type
de_de: falscher Eingabetyp
es: tipo de entrada incorrecta
fr: type d'entrée incorrect
nl: onjuist invoertype
pt_br: tipo da entrada incorreta
ru: Неправильный тип ввода
sv: fel indatatyp

source: wrong number of arguments
de_de: falsche Anzahl an Argumenten
es: numero erroneo de argumentos
fil: mali ang bilang ng argumento
fr: mauvais nombres d'arguments
it_it: numero di argomenti errato
nl: onjuist aantal argumenten
pt_br: quantidade errada dos argumentos
ru: неправильное количество аргументов
sv: fel antal argument

source: wrong number of values to unpack
de_de: falsche Anzahl zu entpackender Werte
es: numero erroneo de valores a descomprimir
fil: maling number ng value na i-unpack
fr: mauvais nombre de valeurs à dégrouper
it_it: numero di valori da scompattare non corretto
nl: verkeerd aantal waarden om uit te pakken
pt_br: quantidade incorreta dos valores para descompressão
ru: Неправильное количество значений для распаковки
sv: fel antal värden för att packa upp

source: wrong output type
de_de: Falscher Ausgabetyp
es: tipo de salida incorrecta
fr: type de sortie incorrect
nl: onjuist uitvoer type
pt_br: tipo da saída incorreta
ru: неверный тип вывода
sv: fel utdatatyp

source: x value out of bounds
es: valor x fuera de límites
nl: x-waarde buiten bereik

source: xTaskCreate failed
es: fallo en xTaskCreate

source: y should be an int
es: y deberia ser un int
fil: y ay dapat int
it_it: y dovrebbe essere un int
nl: y moet een int zijn

source: y value out of bounds
es: valor y fuera de límites
nl: y-waarde buiten bereik

source: zero step
es: paso cero
nl: nul-stap

source: zi must be an ndarray
de_de: zi muss ein ndarray sein
es: zi debe ser un ndarray
fr: zi doit être un ndarray
nl: zi moet een ndarray zijn
pt_br: zi deve ser um ndarray
ru: зи, должно быть, массивом ndarray
sv: zi måste vara en ndarray

source: zi must be of float type
de_de: zi muss eine Gleitkommazahl sein
es: zi debe ser de tipo flotante
fr: zi doit être de type float
nl: zi moet van type float zijn
pt_br: zi deve ser de um tipo float
ru: zi должно быть типа float
sv: zi måste vara av typ float

source: zi must be of shape (n_section, 2)
de_de: zi muss die Form (n_section, 2) haben
es: zi debe ser una forma (n_section,2)
fr: zi doit être de forme (n_section, 2)
nl: zi moet vorm (n_section, 2) hebben
pt_br: zi deve estar na forma (n_section, 2)
ru: zi должен иметь форму (n_section, 2)
sv: zi måste vara i formen (n_section, 2)

source: Code stopped by auto-reload. Reloading soon.
de_de: Code wurde durch automatisches Neuladen gestoppt. Wird bald neu geladen.
fr: Le code a été arrêté par l'actualisation automatique. Rechargement prochain.
pt_br: O código parou pela recarga automática. Recarregando em breve.
ru: Программа остановлена автоматической перезагрузкой. Скоро перезагрузка.
sv: Koden stoppades av automatisk laddning. Omladdning sker strax.

source: Please file an issue with your program at github.com/adafruit/circuitpython/issues.
de_de: Reiche bitte ein Problem mit deinem Programm bei github.com/adafruit/circuitpython/issues ein.
fr: Merci de créer un incident avec votre programme sur github.com/adafruit/circuitpython/issues.
pt_br: Registre um problema com o seu programa em github.com/adafruit/circuitpython/issues.
ru: Пожалуйста подайте вопрос с вашей программой на github.com/adafruit/circuitpython/issues.
sv: Skapa ett ärende med ditt program på https://github.com/adafruit/circuitpython/issues.

source: Press reset to exit safe mode.
de_de: Drücke Reset, um den Sicherheitsmodus zu beenden.
fr: Appuyer sur reset pour sortir du mode sûr.
pt_br: Pressione reset para sair do modo de segurança.
ru: Нажмите на сброс чтобы выйти из безопасного режима.
sv: Tryck reset för att lämna säkert läge.

source: You are in safe mode because:
de_de: Sie befinden sich im abgesicherten Modus, weil:
fr: Le mode sûr est actif pour cette raison:
pt_br: Você está no modo de segurança porque:
ru: Вы в безопасном режиме потому что:
sv: Du är i säkert läge eftersom:

source: %q and %q contain duplicate pins
de_de: %q und %q enthalten doppelte Pins
fr: %q et %q contiennent des broches en double
pt_br: %q e %q contêm pinos duplicados
ru: %q и %q содержат пины дупликаты
sv: %q och %q innehåller duplicerade pinnar

source: %q and %q must be different
de_de: %q und %q müssen unterschiedlich sein
fr: %q et %q doivent être différents
pt_br: %q e %q devem ser diferentes
ru: %q и %q должны быть разными
sv: %q och %q måste vara olika

source: %q contains duplicate pins
de_de: %q enthält doppelte Pins
fr: %q contient des broches en double
pt_br: %q contém pinos duplicados
ru: %q содержит пины дупликаты
sv: %q innehåller dubblettstift

source: %q in %q must be of type %q, not %q
de_de: %q in %q muss von Typ %q sein, nicht %q
fr: %q dans %q doit être de type %q, pas %q
pt_br: %q em %q deve ser do tipo %q e não %q
ru: %q в %q должно быть типа %q, а не %q
sv: %q i %q måste vara av typen %q, inte %q

source: %q init failed
de_de: %q Initialisierung ist gescheitert
fr: échec de l'initialisation %q
pt_br: a inicialização do %q falhou
ru: Инициализация %q не удалась
sv: %q init misslyckades

source: %q is %q
de_de: %q ist %q
fr: %q est %q
pt_br: %q é %q
ru: %q является %q
sv: %q är %q

source: %q is read-only for this board
de_de: %q ist für diese Platine schreibgeschützt
fr: %q est en lecture seule sur cette carte
pt_br: %q é de somente leitura para esta placa
ru: %q читается только для этой доски
sv: %q är skrivskyddad för det här kortet

source: %q length must be %d
de_de: %q länge muss %d betragen
fr: La longueur de %q doit être %d
pt_br: O comprimento de %q deve ser %d
ru: Длинна %q должна быть %d
sv: längden på %q måste vara %d

source: %q length must be %d-%d
de_de: %q Länge muss %d-%d sein
fr: La longueur de %q doit être %d-%d
pt_br: o comprimento %q deve ser %d-%d
ru: Длинна %q должна быть %d-%d
sv: längden på %q måste vara %d-%d

source: %q length must be <= %d
de_de: %q länge muss kleiner oder gleich %d sein
fr: La longueur de %q doit être <= %d
pt_br: o comprimento de %q deve ser <= %d
ru: Длинна %q должна быть <= %d
sv: längden på %q måste vara <= %d

source: %q length must be >= %d
de_de: %q länge muss größer oder gleich %d sein
fr: La longueur de %q doit être >= %d
pt_br: o comprimento de %q deve ser >= %d
ru: Длинна %q должна быть >= %d
sv: längden på %q måste vara >= %d

source: %q moved from %q to %q
de_de: %q von %q nach %q versetzt
fr: % déplacé de %q à %q
pt_br: %q foi movido de %q para %q
sv: %q flyttad från %q till %q

source: %q must be %d
de_de: %q muss %d entsprechen
fr: %q doit être %d
pt_br: %q deve ser %d
ru: %q должно быть %d
sv: %q måste vara %d

source: %q must be 1 when %q is True
de_de: %q muss 1 sein, wenn %q wahr ist
fr: %q doit être 1 quand %q est True
pt_br: %q deve ser 1 quando %q for verdadeiro
ru: %q должен быть равен 1, если %q имеет значение True
sv: %q måste vara 1 när %q är sann

source: %q must be <= %d
de_de: %q muss <= %d sein
fr: %q doit être <= %d
pt_br: %q deve ser <= %d
ru: %q должно быть <= %d
sv: %q måste vara <= %d
