Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: %q must be <= %u
de_de: %q muss <= %u sein
fr: %q doit être <=%u
pt_br: %q deve ser <= %u
ru: %q должно быть <= %u
sv: %q måste vara <= %u

source: %q must be a bytearray or array of type 'H' or 'B'
de_de: %q muss ein Bytearray oder ein Array vom Typ 'H' oder 'B' sein
fr: %q doit être un bytearray ou un array de type 'H' ou 'B'
pt_br: %q deve ser um bytearray ou uma matriz do tipo 'H' ou 'B'
ru: %q должен быть массивом байтов или массивом типа «H» или «B»
sv: %q måste vara en bytearray eller array av typen 'H' eller 'B'

source: %q must be a bytearray or array of type 'h', 'H', 'b', or 'B'
de_de: %q muss ein Byte-Array oder ein array vom Typ 'h', 'H', 'b', oder 'B' sein
fr: %q doit être un bytearray ou un array de type 'h', 'H', 'b', ou 'B'
pt_br: %q deve ser um bytearray ou uma matriz do tipo 'h', 'H', 'b', ou 'B'
ru: %q должен быть массивом байтов или массивом типа «h», «H», «b» или «B»
sv: %q måste vara en bytearray eller en array av typen "h", "H", "b" eller "B"

source: %q must be a subclass of %q
de_de: %q muss eine Unterklasse von %q sein
fr: %q doit être une sous-classe de %q
pt_br: %q deve ser uma subclasse de %q
sv: %q måste vara en subklass av %q

source: %q must be array of type 'H'
de_de: %q muss ein Array vom Typ 'H' sein
fr: %q doit être un array de type 'H'
pt_br: %q deve ser uma matriz do tipo 'H'
ru: %q должен быть массивом типа 'H "
sv: %q måste vara en array av typen 'H'

source: %q must be array of type 'h'
de_de: %q muss ein Array vom Typ 'h' sein
fr: %q doit être un array de type 'h'
pt_br: %q deve ser uma matriz do tipo 'h'
ru: %q должен быть массивом типа 'h "
sv: %q måste vara en matris av typen 'h'

source: %q must be of type %q or %q, not %q
de_de: %q muss von Typ %q oder %q sein, nicht %q
fr: %q doit être de type %q ou %q, pas %q
pt_br: %q deve ser do tipo %q ou %q e não %q
ru: %q должно быть типа%q или%q, а не%q
sv: %q måste vara av typen %q eller %q, inte %q

source: %q must be of type %q, not %q
de_de: %q muss von Typ %q sein, nicht %q
fr: %q doit être de type %q, pas %q
pt_br: %q deve ser do tipo %q e não %q
ru: %q должно быть типа %q, а не %q
sv: %q måste vara av typen %q, inte %q

source: %q must be power of 2
de_de: %q muss eine Potenz von 2 sein
fr: %q doit être une puissance de 2
pt_br: %q deve ser a potência de 2
ru: %q должен быть во 2-й степени
sv: %q måste vara en potens av 2

source: %q out of bounds
de_de: %q außerhalb der Grenzen
fr: %q est hors intervalle
pt_br: %q fora dos limites
ru: %q за пределом
sv: %q är utanför gränserna

source: %q renamed %q
de_de: %q umbenannt zu %q
fr: %q renommé %q
pt_br: %q foi renomeado para %q
sv: %q omdöpt till %q

source: %q step cannot be zero
de_de: Schritt %q kann nicht Null sein
fr: le pas ne peut être zéro dans %q
pt_br: A etapa %q não pode ser zero
ru: Шаг %q не может быть нулём
sv: %q steg kan inte vara noll

source: %q, %q, and %q must all be the same length
de_de: %q, %q und %q müssen alle die gleiche Länge haben
fr: %q, %q, et %q doivent tous être de la même longueur
pt_br: todos os %q, %q, e %q devem ter mesmo comprimento
ru: %q, %q, и %q должны быть одной длинны
sv: %q, %q och %q måste vara lika långa

source: %q[%u] shifts in more bits than pin count
de_de: %q[%u] schiebt mehr Bits rein als Pins vorhanden sind
fr: %q[%u] décale vers l'intérieur de plus de bits que le nombre de broches
pt_br: %q[%u] desloca mais bits na entrada do que a contagem de pinos
ru: %q [%u] смещается в большем количестве чем количество пинов
sv: %q[%u] skiftar in fler bita än antal pinnar

source: %q[%u] shifts out more bits than pin count
de_de: %q[%u] schiebt mehr Bits raus als Pins vorhanden sind
fr: %q[%u] décale vers l'extérieur de plus de bits que le nombre de broches
pt_br: %q[%u] desloca mais bits na saída do que a contagem de pinos
ru: %q[%u] смещает больше битов чем количество выводов
sv: %q[%u] skiftar ut fler bits än antal pinnar

source: %q[%u] uses extra pin
fr: %q[%u] utilise des broches supplémentaires
pt_br: %q[%u] usa pino extra
ru: %q[%u] использует дополнительный контакт
sv: %q[%u] använder extra pinnar

source: %q[%u] waits on input outside of count
de_de: %q[%u] wartet auf Eingang ausserhalb der Anzahl
fr: %q[%u] attend sur une entrée hors du compte
pt_br: %q[%u] espera na entrada fora da contagem
ru: %q [%u] ожидает ввода за пределами графа
sv: %q[%u] väntar på input utanför count

source: %s error 0x%x
de_de: %s Fehler 0x%x
fr: %s erreur 0x%x
pt_br: %s erro 0x%x
ru: %s ошибка 0x%x
sv: %s fel 0x%x

source: 'break'/'continue' outside loop
de_de: 'break'/'continue' ausserhalb einer Schleife
fr: 'break'/'continue' utilisé hors d'une boucle
pt_br: 'break'/'continue' fora do loop
ru: 'прервать'/'продолжить' вне цикла
sv: 'break'/'continue' utanför loop

source: * arg after **
de_de: * arg nach **
fr: * arg après **
pt_br: * arg após **
ru: * аргумент после **
sv: * arg efter **

source: .show(x) removed. Use .root_group = x
de_de: .show(x) wurde entfernt. Benutze .root_group = x
pt_br: .show(x) foi removido. Use .root_group = x
sv: .show(x) borttagen. Använd .root_group = x

source: AP could not be started
de_de: Access Point konnte nicht gestartet werden
fr: Le point d'accès n'a pas pu être démarré
pt_br: Não foi possível iniciar o AP
ru: AP не может быть запущен
sv: Kunde inte starta AP

source: Address range not allowed
de_de: Adressbereich nicht erlaubt
fr: Plage d'adresses non autorisée
pt_br: Intervalo de endereços não permitido
ru: Диапазон адресов не разрешен
sv: Adressintervallet är inte tillåtet

source: Address range wraps around
fr: La plage d'adresses fait une boucle
pt_br: O intervalo de endereços envolve
ru: Обертывание диапазона адресов
sv: Adressintervall ger överflödesfel

source: All dma channels in use
de_de: All DMA-Kanäle in Verwendung
fr: Toutes les canals DMA sont utilisées
pt_br: Todos os canais dma estão em uso
ru: Все используемые каналы dma
sv: Alla dma-kanaler används

source: An error occurred while retrieving '%s':
de_de: Ein Fehler ist aufgetreten beim Abfragen von '%s':
fr: Erreur survenue en récupérant '%s':
pt_br: Ocorreu um erro ao recuperar '%s':
ru: Произошла ошибка при получении '%s':
sv: Ett fel uppstod vid hämtning av '%s':

source: Audio conversion not implemented
de_de: Audio-Konvertierung nicht implementiert
fr: La conversion audio n'est pas implémentée
pt_br: A conversão de áudio ainda não foi implementada
ru: Преобразование звука не реализовано
sv: Ljudkonvertering inte implementerad

source: Bit clock and word select must be sequential GPIO pins
fr: Les broches Bit clock et word doivent être successives
pt_br: O clock bit e a seleção da palavra devem ser pinos GPIO sequenciais
ru: Несколько часов и слов должны быть последовательными GPIO пинами
sv: Bit clock och word select måste vara sekventiella GPIO-pinnar

source: Bitmap size and bits per value must match
de_de: Bitmap-Grösse und Bits pro Wert müssen übereinstimmen
fr: La dimension et la taille en bits de l'image doivent correspondre
pt_br: O tamanho do bitmap e os bits por valor devem coincidir
ru: Размер растрового изображения и число битов на значение должны совпадать
sv: Bitmappstorlek och bitar per värde måste överensstämma

source: Boot device must be first (interface #0).
de_de: Boot-Device muss an erster Stelle kommen (Interface #0).
fr: Le périphérique de démarrage doit être le premier (interface #0).
pt_br: O dispositivo de inicialização deve ser o primeiro (interface #0).
ru: Загрузочное устройство должно быть первым (интерфейс #0).
sv: Boot-enhet måste vara först (gränssnitt #0).

source: Buffer too small
de_de: Puffer ist zu klein
fr: Tampon trop court
pt_br: Buffer pequeno demais
ru: Слишком маленький буфер
sv: Buffert för liten

source: Buffers must be same size
fr: Les tampons doivent avoir la même taille
pt_br: Os buffers devem ter o mesmo tamanho

source: CIRCUITPY drive could not be found or created.
de_de: CIRCUITPY-Laufwerk konnte nicht gefunden oder erzeugt werden.
fr: L'appareil CIRCUITPY ne peut pas être trouvé ou créé.
pt_br: A unidade CIRCUITPY não pôde ser encontrada nem criada.
ru: Диск CIRCUTPY не удалось найти или создать.
sv: CIRCUITPY-enheten kunde inte hittas eller skapas.

source: Camera init
de_de: Kamera Initialiserung
fr: Initialisation de la caméra
pt_br: Inicialização da câmera
ru: Иницализация камеры
sv: Kamera init

source: Cannot reset into bootloader because no bootloader is present
pt_br: Não é possível redefinir no bootloader pois nenhum bootloader está presente

source: Cannot wake on pin edge, only level
de_de: Kann nicht durch Flanke an Pin geweckt werden, sondern nur durch Pegel
fr: Impossible de réveiller via une bordure d'une broche, seulement via un niveau
pt_br: Não é possível acordar na borda do pino, nível apenas
ru: Невозможно проснуться по изменению логического уровня, только по уровню
sv: Kan inte vakna på pin edge, bara nivå

source: Coordinate arrays have different lengths
de_de: Koordinaten-Arrays haben unterschiedliche Längen
fr: Les tableaux de coordonnées sont de longueur différentes
pt_br: As coordenadas das matrizes possuem comprimentos diferentes
ru: Координатные массивы имеют разные длины
sv: Arrayer för koordinater har olika längd

source: Coordinate arrays types have different sizes
de_de: Typen der Koordinaten-Arrays haben unterschiedliche Längen
fr: Les types des matrices de coordonnées sont de longueur différentes
pt_br: Os tipos das coordenadas das matrizes possuem tamanhos diferentes
ru: Типы массивов координат имеют разные размеры
sv: Arrayer för koordinater har olika storlek

source: Done
de_de: Fertig
fr: Terminé
pt_br: Feito
ru: Выполнено
sv: Klar

source: During handling of the above exception, another exception occurred:
de_de: Während der Behandlung der oben genannten Ausnahme trat eine weitere Ausnahme auf:
fr: Pendant la gestion de cette exception, un autre s'est produite:
pt_br: Outra exceção ocorreu durante o tratamento da exceção acima:
ru: При обращении с вышеуказанным исключением произошло еще одно исключение:
sv: Under hanteringen av ovanstående undantag inträffade ett annat undantag:

source: Error in safemode.py.
de_de: Fehler in safemode.py.
fr: Erreur dans safemode.py.
pt_br: Erro no safemode.py.
ru: Ошибка в сейфе. py.
sv: Fel i safemode.py.

source: Expected a kind of %q
de_de: Erwartete eine Art von %q
fr: Argument de type %q attendu
pt_br: Era esperado uma espécie de %q
ru: Ожидаемый вид %q
sv: Förväntade en typ av %q

source: Failed to add service TXT record
fr: Echec de l'ajout de l'enregistrement TXT
pt_br: Houve uma falha ao adicionar o registro TXT do serviço
sv: Det gick inte att lägga TXT-post till tjänsten

source: Failed to add service TXT record; non-string or bytes found in txt_records
fr: Echec de l'ajout de l'enregistrement TXT; caractères non-octets ni texte trouvés dans txt_records
pt_br: Houve uma falha ao adicionar o registro TXT do serviço; nenhum texto ou bytes foram encontrados em txt_records
sv: Det gick inte att lägga TXT-post till tjänsten, icke-sträng eller byte i txt_records

source: Failed to allocate %q buffer
de_de: Allokieren des %q Buffers ist fehlgeschlagen
fr: Échec d'allocation du tampon %q
pt_br: Houve uma falha ao alocar o buffer %q
ru: Не удалось выделить буфер %q
sv: Det gick inte att allokera buffert för %q

source: File not found
de_de: Datei nicht gefunden
fr: Fichier non trouvé
pt_br: Arquivo não encontrado
ru: Файл не найден
sv: Filen hittades inte

source: Firmware is duplicate
de_de: Die Firmware ist doppelt vorhanden
fr: Le logiciel est identique
pt_br: O firmware está duplicado
ru: Прошивка дублируется
sv: Firmware är en dubblett

source: Firmware is invalid
de_de: Die Firmware ist ungültig
fr: Logiciel invalide
pt_br: O firmware é inválido
ru: Недопустимая прошивка
sv: Firmware är ogiltig

source: Firmware is too big
de_de: Die Firmware ist zu groß
fr: Logiciel trop volumineux
pt_br: O firmware é muito grande
ru: Прошивка слишком большая
sv: Firmware är för stor

source: For L8 colorspace, input bitmap must have 8 bits per pixel
de_de: Für den L8-Farbraum muss die Eingabe-Bitmap 8 Bit pro Pixel aufweisen
fr: Avec l'espace de couleur L8, l'image d'entrée doit avoir 8 bits par pixel
pt_br: Para o espaço de cor L8, o bitmap da entrada deve ter 8 bits por pixel
ru: Для цветового пространства L8 входное растровое изображение должно иметь 8 бит на пиксель
sv: För L8-färgrymden måste indatabitmappen ha 8 bitar per pixel

source: For RGB colorspaces, input bitmap must have 16 bits per pixel
de_de: Für RGB-Farbräume muss die Eingabe-Bitmap 16 Bit pro Pixel haben
fr: Avec l'espace de couleur RVB, l'image d'entrée doit avoir 16 bits par pixel
pt_br: Para espaços de cor RGB, o bitmap da entrada deve ter 16 bits por pixel
ru: Для цветовых пространств RGB входное растровое изображение должно иметь 16 бит на пиксель
sv: För RGB-färgrymder måste indatabitmappen ha 16 bitar per pixel

source: Frequency must be 24, 150, 396, 450, 528, 600, 720, 816, 912, 960 or 1008 Mhz
de_de: Die Frequenz muss 24, 150, 396, 450, 528, 600, 720, 816, 912, 960 oder 1008 MHz betragen
fr: La fréquence doit être 24, 150, 396, 450, 528, 600, 720, 816, 912, 960 ou 1008 MHz
pt_br: A frequência deve ser 24, 150, 396, 450, 528, 600, 720, 816, 912, 960 ou 1008 Mhz
ru: Частота должна быть 24, 150, 396, 450, 528, 600, 720, 816, 912, 960 или 1008 МГц
sv: Frekvens måste vara en av 24, 150, 396, 450, 528, 600, 720, 816, 912, 960 eller 1008 Mhz

source: GNSS init
de_de: GNSS-Initialisierung
fr: Initialisation GNSS
pt_br: Inicialização do GNSS
ru: Инициализация GNSS
sv: GNSS start

source: Half duplex SPI is not implemented
pt_br: O SPI half duplex ainda não está implementado

source: Hard fault: memory access or instruction error.
fr: Hard fault: erreur d'instruction ou d'accès mémoire.
pt_br: Falha grave: acesso à memória ou erro de instrução.
ru: Жесткая ошибка: доступ к памяти или ошибка инструкции.
sv: Hårt fel: minnesåtkomst eller instruktionsfel.

source: Heap allocation when VM not running.
de_de: Allokation auf Heap während VM nicht läuft.
fr: Allocation du tas en dehors de la MV.
pt_br: Alocação dinâmica de variáveis quando a VM não estiver funcionando.
ru: Выделение кучи, когда виртуальная машина не запущена.
sv: Heap-allokering när VM inte körs.

source: Heap was corrupted because the stack was too small. Increase stack size.
pt_br: A área de alocação dinâmica de variáveis foi corrompida porque a pilha de funções era muito pequena. Aumente o tamanho da pilha.

source: I2C init error
de_de: I2C-Initialisierungsfehler
fr: Erreur d'initialisation I2C
pt_br: Erro de inicialização do I2C
ru: Ошибка инициализации I2C
sv: I2C-initieringsfel

source: Interface must be started
de_de: Schnittstelle muss gestartet sein
fr: L'interface doit être lancée
pt_br: A interface deve ser iniciada
ru: Интерфейс должен быть запущен
sv: Gränssnittet måste vara startat

source: Internal audio buffer too small
de_de: Interner Audio-Buffer zu klein
fr: Le tampon interne pour l'audio est trop petit
pt_br: O buffer interno de áudio é muito pequeno
ru: Внутренний звуковой буфер слишком мал
sv: Intern ljudbuffert för liten

source: Internal error
de_de: Interner Fehler
fr: Erreur interne
pt_br: Erro interno
ru: Внутренняя ошибка
sv: Internt fel

source: Internal watchdog timer expired.
de_de: Der Interne WatchDog Timer ist abgelaufen.
fr: Le minuteur du watchdog interne a expiré.
pt_br: O temporizador do watchdog interno expirou.
ru: Внутренний сторожевой таймер истек.
sv: Intern watchdog-timer har löpt ut.

source: Interrupt error.
de_de: Interrupt Fehler.
fr: Erreur d'interruption.
pt_br: Erro de interrupção.
ru: Прерванная ошибка.
sv: Interrupt-fel.

source: Invalid MAC address
de_de: Ungültige MAC-Adresse
fr: Adresse MAC invalide
pt_br: Endereço MAC inválido
ru: Неверный MAC-адрес
sv: Ogiltig MAC-adress

source: Invalid byte %.*s
de_de: Ungültiges Byte %.*s
fr: Octet invalide %.*s
pt_br: Byte %.*s inválido
ru: Неверный байт %.*s
sv: Ogiltig byte %.*s

source: Invalid format
de_de: Ungültiges Format
fr: Format invalide
pt_br: Formato inválido
ru: Недопустимый формат
sv: Ogiltigt format

source: Invalid hex password
de_de: Ungültiges Hex-Passwort
fr: Mot de passe hexadécimal invalide
pt_br: Senha hexadecimal inválida
ru: Неверный шестнадцатеричный пароль
sv: Ogiltigt hex-lösenord

source: Invalid multicast MAC address
de_de: Ungültige Multicast-MAC-Adresse
fr: Adresse MAC multicast invalide
pt_br: Endereço MAC multicast inválido
ru: Неверный MAC-адрес многоадресной рассылки
sv: Ogiltig MAC-adress för multicast

source: Invalid unicode escape
de_de: Ungültiges Unicode-Escape-Zeichen
fr: Séquence unicode invalide
pt_br: Escape unicode inválido
ru: Недопустимое экранирование Юникода
sv: Ogiltig unicode escape

source: Key not found
de_de: Schlüssel nicht gefunden
fr: Clé non trouvée
pt_br: Chave não encontrada
ru: Ключ не найден
sv: Nyckeln hittades inte

source: LED mappings must match display size
de_de: LED-Zuordnungen müssen der Display-Größe entsprechen
fr: La disposition des LED doit correspondre à la taille de l'écran
pt_br: Os mapeamentos do led devem corresponder ao tamanho do display
ru: Светодиодные сопоставления должны соответствовать размеру дисплея
sv: LED-mappning måste matcha displaystorlek

source: Layer already in a group
de_de: Ebene ist bereits in der Gruppe
fr: Ce calque est déjà dans un groupe
pt_br: Camada já está num grupo
ru: Слой уже в группе (Group)
sv: Layer är redan med i en grupp

source: Layer must be a Group or TileGrid subclass
de_de: Ebene muss eine Gruppe oder eine TileGrid Subklasse sein
fr: Le calque doit être une sous-classe de Group ou TileGrid
pt_br: A camada deve ser uma subclasse Group ou TileGrid
ru: Слой должен быть группой (Group) или субклассом TileGrid
sv: Layer måste vara en underklass av Group eller TileGrid

source: Mapping must be a tuple
de_de: Zuordnung muss ein Tupel sein
fr: Le mapping doit être un tuple
pt_br: O mapeamento deve ser uma tupla
ru: Сопоставление должно быть кортежом
sv: Mappning måste vara en tuple

source: Mismatched data size
de_de: Nicht übereinstimmende Datengröße
fr: La taille des données ne correspond pas
pt_br: O tamanho dos dados é incompatível
ru: Размер данных различается
sv: Datastorlek matchar inte

source: Mismatched swap flag
de_de: Nicht übereinstimmendes Swap-Flag
fr: Le drapeau d'échange ne correspond pas
pt_br: Sinalizador de troca incompatível
ru: Несоответствующий флаг подкачки
sv: Felaktig swapflagga

source: Missing first_in_pin. %q[%u] reads pin(s)
de_de: first_in_pin fehlt. %q[%u] liest Pin(s)
fr: Broche first_in_pin manquante. Le programme %q[%u] lit ce(s) broche(s)
pt_br: Faltando first_in_pin. %q[%u] lê pino(s)
ru: Отсутствует first_in_pin. %q[%u] читает выводы
sv: Saknad first_in_pin. %q[%u] läser pin(s)

source: Missing first_in_pin. %q[%u] shifts in from pin(s)
de_de: first_in_pin fehlt. %q[%u] schiebt Daten über Pin(s) rein
fr: Broche first_in_pin manquante. Le programme %q[%u] décale à partir de ce(s) broche(s)
pt_br: Faltando first_in_pin. %q[%u] muda de pino(s)
ru: Отсутствует first_in_pin. %q[%u] смещается от контакта (контактов)
sv: Saknad first_in_pin. %q[%u] skiftar in från pinne

source: Missing first_in_pin. %q[%u] waits based on pin
de_de: first_in_pin fehlt. %q[%u] wartet basierend auf Pin
fr: Broche first_in_pin manquante. Le programme %q[%u] attend sur la base de cette broche
pt_br: Faltando first_in_pin. %q[%u] espera com base no pino
ru: Отсутствует first_in_pin. Инструкция %d ожидает на основе пина
sv: Saknad first_in_pin. %q[%u] väntar baserat på pin

source: Missing first_out_pin. %q[%u] shifts out to pin(s)
de_de: first_out_pin fehlt. %q[%u] schiebt über Pin(s) raus
fr: Broche first_out_pin manquante. Le programme %q[%u] décale la sortie vers ce(s) broche(s)
pt_br: Faltando first_out_pin. %q[%u] desloca para fora dos pino(s)
ru: Отсутствует first_out_pin. %q[%u] переключается на контакты
sv: Saknad first_in_pin. %q[%u] skiftar ut från pinne

source: Missing first_out_pin. %q[%u] writes pin(s)
de_de: first_out_pin fehlt. %q[%u] schreibt Pin(s)
fr: Broche first_out_pin manquante. Le programme %q[%u] écrit sur ce(s) broche(s)
pt_br: Faltando first_out_pin. %q[%u] escreve pino(s)
ru: Отсутствует first_out_pin. %q[%u] записывает выводы
sv: Saknad first_out_pin. %q[%u] skriver pin(s)

source: Missing first_set_pin. %q[%u] sets pin(s)
de_de: first_set_pin fehlt. %q[%u] setzt Pin(s)
fr: Broche first_set_pin manquante. Le programme %q[%u] définit ce(s) broche(s)
pt_br: Faltando first_set_pin. %q[%u] define pino(s)
ru: Отсутствует first_set_pin. %q[%u] устанавливает контакты
sv: Saknad first_set_pin. %q[%u] sätter pin(s)

source: Missing jmp_pin. %q[%u] jumps on pin
de_de: jmp_pin fehlt. %q[%u] springt basierend auf dem Pin
pt_br: Falta jmp_pin. %q[%u] jumper no pino
ru: Не хватает jmp_pin.%q [%u] прыгает на пин
sv: Saknad jmp_pin. %q[%u] hoppar på pin

source: Must provide 5/6/5 RGB pins
de_de: Es müssen 5/6/5 RGB Pins zur Verfügung gestellt werden
fr: 5/6/5 broches RGB doivent être fournies
pt_br: É preciso fornecer os pinos RGB 5/6/5
ru: Должен иметь 5/6/5 контактов RGB
sv: Måset ange 5/6/5 RGB-pinnar

source: Name or service not known
de_de: Name oder Dienst nicht bekannt
fr: Nom ou service inconnu
pt_br: Nome ou serviço desconhecido
ru: Имя или услуга не известны
sv: Namn eller tjänst inte känd

source: New bitmap must be same size as old bitmap
de_de: Neue Bitmap muss die gleiche Größe wie alte Bitmap haben
fr: La taille du nouveau bitmap doit être la même que l'ancien
pt_br: O novo bitmap deve ter o mesmo tamanho que o bitmap antigo
ru: Новое растровое изображение должно быть того же размера, что и старое растровое изображение
sv: Ny bitmapp måste ha samma storlek som tidigare bitmapp

source: Nimble out of memory
de_de: Kein Speicher mehr für Nible vorhanden
pt_br: Ágil fora da memória
ru: Изображение памяти
sv: Nimble har inget minne kvar

source: No %q pin
de_de: Kein %q-Pin
fr: Pas de broche %q
pt_br: Sem pin %q
ru: Нет пина %q
sv: Ingen %q-pinne

source: No I2C device at address: 0x%x
de_de: Kein I2C-Gerät an Adresse: 0x%x
fr: Aucun périphérique I2S à l'adresse : 0x%x
pt_br: Não há nenhum dispositivo I2C no endereço: 0x%x
ru: Нет устройства I2C по адресу: %x
sv: Ingen I2C-enhet på adress: 0x%x

source: No IP
de_de: Keine IP
fr: Aucune IP
pt_br: Sem IP
ru: Нет IP
sv: Ingen IP

source: No capture in progress
fr: Aucune capture en cours
pt_br: Não há nenhuma captura em andamento

source: No configuration set
de_de: Keine Konfiguration vorhanden
fr: Pas de configuration définie
pt_br: Nenhum conjunto de configuração
ru: Нет конфигураций
sv: Ingen konfiguration gjord

source: No such device
de_de: Kein solches Gerät
fr: Aucun périphérique correspondant
pt_br: Não existe tal dispositivo
ru: Нет такого устройства
sv: Ingen sådan enhet

source: No usb host port initialized
fr: Pas de port usb hôte initialisé
pt_br: Nenhuma porta do host usb foi inicializada
ru: Порт USB-хоста не инициализирован
sv: Ingen usb värdport initialiserad

source: Number of data_pins must be 8 or 16, not %d
de_de: Anzahl von data_pins muss 8 oder 16 sein, nicht %d
fr: Le nombre de data_pins doit être 8 ou 16, et non %d
pt_br: A quantidade dos data_pins deve ser 8 ou 16, não %d
ru: Количество data_pins должно быть 8 или 16, а не %d
sv: Antal data_pins måste vara 8 eller 16, inte %d

source: Off
de_de: Aus
fr: Inactif
pt_br: Desligado
ru: Выключено
sv: Av

source: Only 8 or 16 bit mono with %dx oversampling supported.
de_de: Es wird nur 8 oder 16 bit mono mit %dx Oversampling unterstützt.
pt_br: Somente mono de 8 ou 16 bits com %dx de sobreamostragem são suportados.
sv: Endast 8 eller 16 bitars mono med %dx översampling stöds.
