Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: can't convert %q to int
es: no se puede convertir %q a int

source: can't convert %s to complex
de_de: kann %s nicht nach complex konvertieren
es: no se puede convertir %s a complejo
fil: hindi ma-convert %s sa complex
fr: ne peut convertir %s en nombre complexe
it_it: non è possibile convertire a complex
nl: kan %s niet converteren naar een complex
pt_br: Não é possível converter %s para complex
ru: не может преобразовать %s в сложный
sv: kan inte konvertera %s till komplex

source: can't convert '%q' object to %q implicitly
de_de: Kann '%q' Objekt nicht implizit nach %q konvertieren
es: no se puede convertir el objeto '%q' a %q implícitamente
fil: hindi maaaring i-convert ang '%q' na bagay sa %q nang walang pahiwatig
fr: impossible de convertir l'objet '%q' en '%q' implicitement
it_it: impossibile convertire l'oggetto '%q' implicitamente in %q
nl: kan '%q' object niet omzetten naar %q impliciet
pt_br: não é possível converter implicitamente o objeto '%q' para %q
ru: не может конвертировать «%q» в% q косвенно
sv: kan inte konvertera '%q' objekt implicit till %q

source: can't convert to %q
es: no puede convertir a %q
nl: kan niet naar %q converteren

source: can't convert to complex
de_de: kann nicht nach complex konvertieren
es: no se puede convertir a complejo
fil: hindi ma-convert sa complex
fr: ne peut convertir en nombre complexe
it_it: non è possibile convertire a complex
nl: kan niet omzetten naar complex
pt_br: não é possível converter para complex
ru: не может быть преобразован в сложный
sv: kan inte konvertera till komplex

source: can't convert to int
de_de: kann nicht nach int konvertieren
es: no se puede convertir a int
fil: hindi ma-convert sa int
fr: ne peut convertir en entier 'int'
it_it: non è possibile convertire a int
nl: kan niet omzetten naar int
pt_br: não é possível converter para int
ru: Не удается преобразовать в int
sv: kan inte konvertera till int

source: can't convert to str implicitly
de_de: Kann nicht implizit nach str konvertieren
es: no se puede convertir a str implícitamente
fil: hindi ma i-convert sa string ng walang pahiwatig
fr: impossible de convertir en chaine 'str' implicitement
it_it: impossibile convertire a stringa implicitamente
nl: kan niet omzetten naar str impliciet
pt_br: não é possível converter implicitamente para str
ru: не может превратиться в полосу неявно
sv: kan inte implicit konvertera till str

source: can't declare nonlocal in outer code
de_de: kann im äußeren Code nicht als nonlocal deklarieren
es: no se puede declarar nonlocal
fil: hindi madeclare nonlocal sa outer code
fr: ne peut déclarer de 'nonlocal' dans un code externe
it_it: impossibile dichiarare nonlocal nel codice esterno
nl: kan geen nonlocal in buitenste code declareren
pt_br: não é possível declarar nonlocal no código externo
ru: не может объявить нелокальный во внешнем коде
sv: kan inte deklarera icke-lokalt i yttre kod

source: can't delete expression
de_de: Ausdruck kann nicht gelöscht werden
es: no se puede borrar la expresión
fil: hindi mabura ang expression
fr: ne peut pas supprimer l'expression
it_it: impossibile cancellare l'espessione
nl: kan expressie niet verwijderen
pt_br: não é possível excluir a expressão
ru: Не удается удалить выражение
sv: kan inte ta bort uttryck

source: can't do binary op between '%q' and '%q'
de_de: Eine binäre Operation zwischen '%q' und '%q' ist nicht möglich
es: no se puede hacer una operacion binaria entre '%q' y '%q'
fil: hindi magawa ang binary op sa gitna ng '%q' at '%q'
fr: opération binaire impossible entre '%q' et '%q'
it_it: impossibile eseguire operazione binaria tra '%q' e '%q'
nl: kan geen een binaire operatie doen tussen '%q' en '%q'
pt_br: não é possível executar uma operação binária entre '%q' e '%q'
ru: Не могу выполнить двоичную операцию между '%q' и '%q'
sv: kan inte göra binära op mellan '%q' och '%q'

source: can't do truncated division of a complex number
es: no se puede hacer la división truncada de un número complejo
fil: hindi maaaring gawin ang truncated division ng isang kumplikadong numero
it_it: impossibile fare il modulo di un numero complesso
nl: kan geen afgekapte deling doen van een comlex nummer

source: can't have multiple **x
es: no puede tener multiples *x
fil: hindi puede ang maraming **x
it_it: impossibile usare **x multipli
nl: kan niet meerdere **x hebben

source: can't have multiple *x
es: no puede tener multiples *x
fil: hindi puede ang maraming *x
it_it: impossibile usare *x multipli
nl: kan geen meerdere *x hebben

source: can't implicitly convert '%q' to 'bool'
de_de: Kann '%q' nicht implizit nach 'bool' konvertieren
es: no se puede convertir implícitamente '%q' a 'bool'
fil: hindi maaaring ma-convert ang '% qt' sa 'bool'
fr: impossible de convertir implicitement '%q' en 'bool'
it_it: non è possibile convertire implicitamente '%q' in 'bool'
nl: kan '%q niet impliciet converteren naar 'bool'
pt_br: não é possível converter implicitamente '%q' em 'bool'
ru: не может неявно преобразовать '%q' в 'bool'
sv: kan inte implicit konvertera '%q' till 'bool'

source: can't load from '%q'
de_de: Laden von '%q' nicht möglich
es: no se puede cargar desde '%q'
fil: hidi ma i-load galing sa '%q'
fr: impossible de charger depuis '%q'
it_it: impossibile caricare da '%q'
nl: kan niet laden van '%q'
pt_br: não é possível carregar a partir de '%q'
ru: Не удается загрузить из '%q'
sv: kan inte ladda från '%q'

source: can't load with '%q' index
de_de: Laden mit '%q' index nicht möglich
es: no se puede cargar con el índice '%q'
fil: hindi ma i-load gamit ng '%q' na index
fr: impossible de charger avec l'indice '%q'
it_it: impossibile caricare con indice '%q'
nl: kan niet met '%q' index laden
pt_br: não é possível carregar com o índice '%q'
ru: Не удается загрузить с индексом '%q'
sv: kan inte ladda med '%q' index

source: can't send non-None value to a just-started generator
de_de: Nicht-None-Wert kann nicht an einen gerade gestarteten Generator gesendet werden
es: no se puede enviar un valor que no sea None a un generador recién iniciado
fil: hindi mapadala ang non-None value sa isang kaka umpisang generator
fr: on ne peut envoyer une valeur autre que 'None' à un générateur fraîchement démarré
nl: kan geen niet-'None' waarde naar een net gestartte generator sturen
pt_br: Não é possível enviar algo que não seja um valor para um gerador recém-iniciado
ru: не может отправить значение, отличное от None, только что запущенному генератору
sv: kan inte skicka icke-None värde till nystartad generator

source: can't set 512 block size
de_de: Kann Blockgröße von 512 nicht setzen
es: no se puede definir un tamaño de bloque de 512
fr: impossible de définir une taille de bloc de 512
nl: kan geen 512 blokgrootte instellen
pt_br: não é possível definir o tamanho de 512 blocos
ru: Не удается установить размер блока 512
sv: kan inte sätta blockstorlek 512

source: can't set attribute
de_de: kann Attribut nicht setzen
es: no se puede asignar el atributo
fil: hindi ma i-set ang attribute
fr: attribut non modifiable
it_it: impossibile impostare attributo
nl: kan attribute niet instellen
pt_br: não é possível definir o atributo
ru: Не удается установить атрибут
sv: kan inte att ange attribut

source: can't store '%q'
de_de: Speichern von '%q' nicht möglich
es: no se puede almacenar '%q'
fil: hindi ma i-store ang '%q'
fr: impossible de stocker '%q'
it_it: impossibile memorizzare '%q'
nl: kan '%q' niet opslaan
pt_br: não é possível armazenar '%q'
ru: Не удается сохранить '%q'
sv: kan inte lagra '%q'

source: can't store to '%q'
de_de: Speichern in/nach '%q' nicht möglich
es: no se puede almacenar para '%q'
fil: hindi ma i-store sa '%q'
fr: impossible de stocker vers '%q'
it_it: impossibile memorizzare in '%q'
nl: kan niet naar '%q' opslaan
pt_br: não é possível armazenar em '%q'
ru: невозможно сохранить в «%q»
sv: kan inte spara till '%q'

source: can't store with '%q' index
de_de: Speichern mit '%q' Index nicht möglich
es: no se puede almacenar con el indice '%q'
fil: hindi ma i-store gamit ng '%q' na index
fr: impossible de stocker avec un indice '%q'
it_it: impossibile memorizzare con indice '%q'
nl: kan niet opslaan met '%q' als index
pt_br: não é possível armazenar com o índice '%q'
ru: не может хранить с индексом%q
sv: kan inte lagra med '%q'-index

source: can't switch from automatic field numbering to manual field specification
de_de: kann nicht von der automatischen Feldnummerierung zur manuellen Feldspezifikation wechseln
es: no se puede cambiar de la numeración automática de campos a la especificación de campo manual
fil: hindi mapalitan ang awtomatikong field numbering sa manual field specification
fr: impossible de passer d'une énumération auto des champs à une spécification manuelle
nl: kan niet schakelen tussen automatische en handmatige veld specificatie
pt_br: não é possível alternar entre a numeração automática dos campos para a manual
ru: Не удается переключиться с автоматической нумерации полей на ручную спецификацию полей
sv: kan inte byta från automatisk fältnumrering till manuell fältspecifikation

source: can't switch from manual field specification to automatic field numbering
de_de: kann nicht von der manuellen Feldspezifikation zur automatischen Feldnummerierung wechseln
es: no se puede cambiar de especificación de campo manual a numeración automática de campos
fil: hindi mapalitan ang manual field specification sa awtomatikong field numbering
fr: impossible de passer d'une spécification manuelle des champs à une énumération auto
nl: kan niet schakelen tussen handmatige en automatische veld specificatie
pt_br: não é possível alternar da especificação de campo manual para a automática
ru: не может переключаться с ручного поля на автоматическую нумерацию поля
sv: kan inte byta från manuell fältspecifikation till automatisk fältnumrering

source: cannot cast output with casting rule
de_de: Kann die Ausgabe nicht mit der Umwandlungsregel umwandeln
es: No se puede realizar cast de la salida sin una regla de cast
fr: output ne peut être projeté sans règle de projection
nl: kan uitvoer niet converteren zonder conversieregel
pt_br: não pode lançar a saída com a regra de fundição
ru: Не удается привести выходные данные с помощью правила приведения
sv: kan inte casta utdata med regel

source: cannot create '%q' instances
de_de: Kann '%q' Instanzen nicht erstellen
es: no se pueden crear '%q' instancias
fil: hindi magawa '%q' instances
fr: ne peut pas créer une instance de '%q'
it_it: creare '%q' istanze
nl: kan geen instanties van '%q' creëren
pt_br: não é possível criar instâncias '%q'
ru: Не удается создать экземпляры '%q'
sv: kan inte skapa instanser av '%q'

source: cannot create instance
de_de: Kann Instanz nicht erstellen
es: no se puede crear instancia
fil: hindi magawa ang instance
fr: ne peut pas créer une instance
it_it: impossibile creare un istanza
nl: kan geen instantie creëren
pt_br: não é possível criar instância
ru: Не удается создать экземпляр
sv: kan inte skapa instans

source: cannot import name %q
es: no se puede importar name '%q'
fil: hindi ma-import ang name %q
it_it: impossibile imporate il nome %q
nl: kan naam %q niet importeren

source: cannot perform relative import
es: no se puedo realizar importación relativa
fil: hindi maaring isagawa ang relative import
it_it: impossibile effettuare l'importazione relativa
nl: kan geen relatieve import uitvoeren

source: cannot unambiguously get sizeof scalar
es: no se puede sin ambiguedades traer el sizeof del escalar

source: casting
de_de: Umwandlung (cast)
es: convirtiendo tipo
fr: typage
pt_br: fundição
ru: кастинг
sv: casting inte implementerad

source: chars buffer too small
de_de: Zeichenpuffer zu klein
es: chars buffer es demasiado pequeño
fil: masyadong maliit ang buffer
fr: tampon de caractères trop petit
it_it: buffer dei caratteri troppo piccolo
nl: chars buffer te klein
pt_br: o buffer dos caracteres é muito pequeno
ru: Слишком маленький буфер символов
sv: teckenbuffert för liten

source: chr() arg not in range(0x110000)
de_de: chr() arg ist nicht in range(0x110000)
es: El argumento de chr() esta fuera de rango(0x110000)
fil: chr() arg wala sa sakop ng range(0x110000)
fr: paramètre de chr() hors intervalle (0~0x10FFF)
it_it: argomento di chr() non è in range(0x110000)
nl: chr() arg niet binnen bereik (0x110000)
pt_br: o arg chr() está fora do intervalo(0x110000)
ru: chr() аргумент вне диапазона (0x110000)
sv: chr() arg är inte i intervallet(0x110000)

source: chr() arg not in range(256)
de_de: chr() arg ist nicht in range(256)
es: El argumento de chr() no esta en el rango(256)
fil: chr() arg wala sa sakop ng range(256)
fr: paramètre de chr() hors intervalle (0~255)
it_it: argomento di chr() non è in range(256)
nl: chr() arg niet binnen bereik (256)
pt_br: o arg chr() está fora do intervalo(256)
ru: chr() аргумент вне диапазона (256)
sv: chr() arg är inte i intervallet(256)

source: circle can only be registered in one parent
es: circulo solo puede ser registrado con un pariente
nl: cirkel kan slechts bij één object van een hoger niveau worden geregistreerd

source: clip point must be (x,y) tuple
de_de: clip Punkt muss ein (x,y) Tupel sein
es: El punto de recorte debe ser una tupla (x, y)
fr: point de coupure doît être un tuple (x,y)
pt_br: O ponto do clipe deve ser uma tupla (x, y)
ru: Точка клипа должна быть кортежом (x,y)
sv: klipppunkten måste vara en tuple (x,y)

source: code outside range 0~127
de_de: code außerhalb des Wertebereichs 0~127
es: código fuera del rango 0~127
fr: code hors intervalle 0~127
pt_br: código fora do alcance 0~127
ru: код вне диапазона 0~127
sv: kod utanför intervallet 0~127

source: color buffer must be 3 bytes (RGB) or 4 bytes (RGB + pad byte)
de_de: Farbpuffer muss 3 Bytes (RGB) oder 4 Bytes (RGB + pad byte) sein
es: color buffer debe ser 3 bytes (RGB) ó 4 bytes (RGB + pad byte)
fil: color buffer ay dapat na 3 bytes (RGB) o 4 bytes (RGB + pad byte)
fr: le tampon de couleur doit faire 3 octets (RVB) ou 4 (RVB + pad byte)
it_it: il buffer del colore deve esseer di 3 byte (RGB) o 4 byte (RGB + pad byte)
nl: kleurbuffer moet 3 bytes (RGB) of 4 bytes (RGB + pad byte) zijn
pt_br: o buffer das cores deve ter 3 bytes (RGB) ou 4 bytes (RGB + pad byte)
ru: Цветовой буфер должен иметь размер 3 байта (RGB) или 4 байта (RGB + байт заполнения)
sv: färgbuffert måste vara 3 byte (RGB) eller 4 byte (RGB + pad byte)

source: color buffer must be a buffer, tuple, list, or int
de_de: Der Farbpuffer muss ein Puffer, ein Tupel, eine Liste oder ein Int sein
es: el búfer de color debe ser un búfer, una tupla, una lista o un entero
fr: le tampon de couleur doit être un tampon, un tuple, une liste ou un entier
nl: kleurbuffer moet een buffer, tuple, list, of int zijn
pt_br: O buffer das cores deve ser um buffer, tupla, lista ou int
ru: Цветовой буфер должен быть буфером, кортежом, списком или целым числом
sv: färgbuffert måste vara en buffert, tupel, en lista, eller int

source: color buffer must be a bytearray or array of type 'b' or 'B'
de_de: Farbpuffer muss ein Byte-Array oder ein Array vom Typ 'b' oder 'B' sein
es: color buffer deberia ser un bytearray o array de tipo 'b' o 'B'
fil: ang color buffer ay dapat bytearray o array na type ‘b’ or ‘B’
fr: le tampon de couleurs doit être un bytearray ou une matrice de type 'b' ou 'B'
it_it: buffer del colore deve essere un bytearray o un array di tipo 'b' o 'B'
nl: kleurbuffer moet een bytearray of array van type 'b' of 'B' zijn
pt_br: O buffer das cores deve ser uma matriz de bytes ou uma matriz do tipo 'b' ou 'B'
ru: цветовой буфер должен быть байтом массива или массивом типа "b" или "B"
sv: färgbuffert måste vara en bytearray eller matris av typ 'b' eller 'B'

source: color must be between 0x000000 and 0xffffff
de_de: Farbe muss zwischen 0x000000 und 0xffffff liegen
es: color debe estar entre 0x000000 y 0xffffff
fil: color ay dapat mula sa 0x000000 hangang 0xffffff
fr: la couleur doit être entre 0x000000 et 0xffffff
it_it: il colore deve essere compreso tra 0x000000 e 0xffffff
nl: kleur moet tussen 0x000000 en 0xffffff liggen
pt_br: cor deve estar entre 0x000000 e 0xffffff
ru: Цвет должен быть от 0x000000 до 0xffffff
sv: färg måste vara mellan 0x000000 och 0xffffff

source: color should be an int
es: color deberia ser un int
fil: color ay dapat na int
it_it: il colore deve essere un int
nl: kleur moet een int zijn

source: comparison of int and uint
de_de: Vergleich von int und uint
es: comparación entre int y uint
fr: comparaison entre int et uint
pt_br: comparação de int e uint
ru: сравнение int и uint
sv: jämförelse av int och uint

source: complex division by zero
es: división compleja por cero
fil: kumplikadong dibisyon sa pamamagitan ng zero
it_it: complex divisione per zero
nl: complexe deling door 0

source: complex values not supported
de_de: Komplexe Zahlen nicht unterstützt
es: valores complejos no soportados
fil: kumplikadong values hindi sinusuportahan
fr: valeurs complexes non supportées
it_it: valori complessi non supportai
nl: complexe waardes niet ondersteund
pt_br: os valores complexos não compatíveis
ru: Комплексные значения не поддерживаются
sv: komplexa värden stöds inte

source: compression header
de_de: kompression header
es: encabezado de compresión
fr: entête de compression
it_it: compressione dell'header
nl: compressie header
pt_br: compressão do cabeçalho
ru: Заголовок сжатия
sv: komprimeringsheader

source: constant must be an integer
es: constant debe ser un entero
fil: constant ay dapat na integer
it_it: la costante deve essere un intero
nl: constant moet een integer zijn

source: conversion to object
de_de: Umwandlung zu Objekt
es: conversión a objeto
fil: kombersyon to object
fr: conversion en objet
it_it: conversione in oggetto
nl: conversie naar object
pt_br: conversão para o objeto
ru: Преобразование в объект
sv: konvertering till objekt

source: convolve arguments must be linear arrays
de_de: Convolve-Argumente müssen lineare Arrays sein
es: los argumentos para convolve deben ser arreglos lineares
fr: les paramêtres pour convolve doivent être des matrices linéaires
nl: convolutie argumenten moeten lineaire arrays zijn
pt_br: os argumentos convolutivos devem ser matrizes lineares
ru: Аргументы свертки должны быть линейными массивами
sv: Argumenten convolve måste vara linjära matriser

source: convolve arguments must be ndarrays
de_de: Convolve-Argumente müssen ndarrays sein
es: los argumentos para convolve deben ser ndarrays
fr: les paramêtres pour convolve doivent être des ndarrays
nl: convolutie argumenten moeten ndarrays zijn
pt_br: os argumentos convolutivos devem ser ndarrays
ru: переплетение аргументов должно быть массивами ndarrays
sv: Argumenten convolve måste vara ndarray:er

source: convolve arguments must not be empty
de_de: Faltungsargumente dürfen nicht leer sein
es: los argumentos para convolve no deben estar vacíos
fr: les arguments convolve ne doivent pas être vides
nl: convolutie argumenten mogen niet leeg zijn
pt_br: os argumentos convolutivos não devem estar vazios
ru: аргументы свертки не должны быть пустыми
sv: Argumenten convolve kan inte vara tomma

source: could not invert Vandermonde matrix
de_de: Vandermonde-Matrix konnte nicht invertiert werden
es: no se pudo invertir la matriz de Vandermonde
fr: n'a pas pu inverser la matrice Vandermonde
nl: kon de Vandermonde matrix niet omkeren
pt_br: não foi possível inverter a matriz Vandermonde
ru: не удалось инвертировать матрицу Вандермонда
sv: kan inte invertera Vandermonde-matris

source: couldn't determine SD card version
de_de: Konnte SD-Karten Version nicht ermitteln
es: no se pudo determinar la versión de la tarjeta SD
fr: impossible de déterminer la version de la carte SD
nl: kon SD kaart versie niet bepalen
pt_br: não foi possível determinar a versão do cartão SD
ru: Не удалось определить версию SD карты
sv: kan inte avgöra SD-kortversion

source: cross is defined for 1D arrays of length 3
de_de: cross ist definiert für 1-Dimensionale Arrays der Länge 3
es: Cruce está definido para un array 1D de longitud 3
fr: cross est défini pour les matrices 1D de longueur 3
nl: kruis wordt gedefinieerd voor 1D-arrays van lengte 3
pt_br: a cruz é definida para matrizes 1D de comprimento 3
ru: крест определяется для 1D массивов длины 3
sv: cross är definierad för 1D-matriser med längd 3

source: data must be iterable
de_de: data muss iterierbar sein
es: los datos deben permitir iteración
fr: les données doivent être les objets iterables
nl: data moet itereerbaar zijn
pt_br: os dados devem ser iteráveis
ru: Данные должны быть итерируемыми
sv: data måste vara itererbar

source: data must be of equal length
de_de: data muss von gleicher Länge sein
es: los datos deben ser de igual tamaño
fr: les données doivent être de longueur égale
nl: data moet van gelijke lengte zijn
pt_br: os dados devem ser de igual comprimento
ru: Данные должны быть одинаковой длины
sv: data måste vara av samma längd

source: data pin #%d in use
de_de: Datenpin #%d ist in Benutzung
es: pin de datos #%d en uso
fr: broche de donnée #%d utilisée
pt_br: o pino de dados #%d está em uso
ru: data-пин #%d уже используется
sv: data pin #%d används redan

source: data type not understood
de_de: Datentyp nicht verstanden
es: tipo de dato no comprendido
fr: le type de donnée n'est pas reconnu
pt_br: o tipo do dado não foi compreendido
ru: Тип данных не понят
sv: datatyp inte förstådd

source: decimal numbers not supported
de_de: Dezimalzahlen nicht unterstützt
es: números decimales no soportados
fil: decimal numbers hindi sinusuportahan
fr: nombres décimaux non supportés
it_it: numeri decimali non supportati
nl: decimale getallen zijn niet ondersteund
pt_br: os números decimais não são compatíveis
ru: Десятичные числа не поддерживаются
sv: decimaltal stöds inte

source: default 'except' must be last
de_de: Die Standart-Ausnahmebehandlung muss als letztes sein
es: 'except' por defecto deberia estar de último
fil: default 'except' ay dapat sa huli
fr: l''except' par défaut doit être en dernier
it_it: 'except' predefinito deve essere ultimo
nl: standaard 'expect' moet laatste zijn
pt_br: a predefinição 'exceto' deve ser o último
ru: по умолчанию "за исключением" должно быть последним
sv: standard "except" måste ligga sist

source: default is not a function
de_de: default ist keine Funktion
es: default no es una función
fr: default n'est pas une fonction
pt_br: o padrão não é uma função
ru: По умолчанию не является функцией
sv: default är inte en funktion

source: destination buffer must be a bytearray or array of type 'B' for bit_depth = 8
de_de: Zielpuffer muss ein Bytearray oder ein Array vom Typ 'B' für bit_depth = 8 sein
es: el buffer de destino debe ser un bytearray o array de tipo 'B' para bit_depth = 8
fil: ang destination buffer ay dapat na isang bytearray o array ng uri na 'B' para sa bit_depth = 8
fr: le tampon de destination doit être une matrice de type 'B' pour bit_depth = 8
it_it: il buffer di destinazione deve essere un bytearray o un array di tipo 'B' con bit_depth = 8
nl: bestemming buffer moet een bytearray of array van het type 'B' voor bit_depth = 8
pt_br: o buffer do destino deve ser um bytearray ou matriz do tipo 'B' para bit_depth = 8
ru: буфер назначения должен быть байтоммассива или массивом типа "B" для бит_глубины = 8
sv: destinationsbuffert måste vara en bytearray eller matris av typ 'B' för bit_depth = 8
