Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: identifier redefined as global
de_de: Bezeichner als global neu definiert
es: identificador redefinido como global
fil: identifier ginawang global
fr: identifiant redéfini comme global
it_it: identificatore ridefinito come globale
nl: identifier is opnieuw gedefinieerd als global
pt_br: o identificador foi redefinido como global
ru: идентификатор переопределен как глобальный
sv: identifieraren omdefinierad till global

source: identifier redefined as nonlocal
de_de: Bezeichner als nonlocal definiert
es: identificador redefinido como nonlocal
fil: identifier ginawang nonlocal
fr: identifiant redéfini comme nonlocal
it_it: identificatore ridefinito come nonlocal
nl: identifier is opnieuw gedefinieerd als nonlocal
pt_br: o identificador foi redefinido como não-local
ru: идентификатор переопределен как нелокальный
sv: identifieraren omdefinierad som icke-lokal

source: import * not at module level
de_de: import * nicht auf Modulebene
es: import * no a nivel de módulo
fr: import * n'est pas au niveau du module
pt_br: importação * não está no nível do módulo
ru: Импорт * не на уровне модуля
sv: import * inte på modulnivå

source: incompatible native .mpy architecture
es: arquitectura nativa de .mpy incompatible

source: incomplete format
de_de: unvollständiges Format
es: formato incompleto
fil: hindi kumpleto ang format
fr: format incomplet
it_it: formato incompleto
nl: incompleet formaat
pt_br: formato incompleto
ru: Неполный формат
sv: ofullständigt format

source: incomplete format key
de_de: unvollständiger Formatschlüssel
es: formato de llave incompleto
fil: hindi kumpleto ang format key
fr: clé de format incomplète
nl: incomplete formaatsleutel
pt_br: a chave do formato está incompleto
ru: Неполный ключ форматирования
sv: ofullständig formatnyckel

source: incorrect padding
de_de: padding ist inkorrekt
es: relleno (padding) incorrecto
fil: mali ang padding
fr: espacement incorrect
it_it: padding incorretto
nl: vulling (padding) is onjuist
pt_br: preenchimento incorreto
ru: Неправильная набивка
sv: felaktig utfyllnad

source: index is out of bounds
de_de: Index ist außerhalb der Grenzen
es: el índice está fuera de límites
fr: l'index est hors limites
nl: index is buiten bereik
pt_br: o índice está fora dos limites
ru: индекс выходит из границ
sv: index är utanför gränserna

source: index out of range
de_de: index außerhalb der Reichweite
es: index fuera de rango
fil: index wala sa sakop
fr: index est hors intervalle
it_it: indice fuori intervallo
nl: index is buiten bereik
pt_br: Índice fora do intervalo
ru: индекс вне диапазона
sv: index utanför intervallet

source: indices must be integers
de_de: Indizes müssen Integer sein
es: indices deben ser enteros
fil: ang mga indeks ay dapat na integer
fr: les indices doivent être des entiers
it_it: gli indici devono essere interi
nl: indices moeten integers zijn
pt_br: os índices devem ser inteiros
ru: индексы должны быть целыми числами
sv: index måste vara heltal

source: indices must be integers, slices, or Boolean lists
de_de: Indizes müssen Integer, Slices oder Boolesche Listen sein
es: los índices deben ser enteros, particiones o listas de booleanos
fr: les indices doivent être des entiers, des tranches ou des listes booléennes
nl: indices moeten integers, segmenten (slices) of Boolean lijsten zijn
pt_br: os índices devem ser números inteiros, fatias ou listas booleanas
ru: индексы должны быть целыми числами, срезами или логическими списками
sv: index måste vara heltal, slices, eller Boolean-listor

source: initial values must be iterable
de_de: Ausgangswerte müssen iterierbar sein
es: los valores iniciales deben permitir iteración
fr: les valeurs initiales doivent être itérables
nl: oorspronkelijke waarden moeten itereerbaar zijn
pt_br: os valores iniciais devem ser iteráveis
ru: Начальные значения должны быть итерируемыми
sv: initialvärden måste vara iterable

source: initial_value length is wrong
de_de: Länge von initial_value ist falsch
es: el tamaño de initial_value es incorrecto
fr: la longueur de initial_value est incorrecte
nl: lengte van initial_value is onjuist
pt_br: O comprimento do initial_value está errado
ru: длина первоначального_значения ошибочна
sv: initial_value-längd är fel

source: inline assembler must be a function
de_de: inline assembler muss eine function sein
es: ensamblador en línea debe ser una función
fil: inline assembler ay dapat na function
fr: l'assembleur doit être une fonction
it_it: inline assembler deve essere una funzione
nl: inline assembler moet een functie zijn
pt_br: o assembler em linha deve ser uma função
ru: Встроенный ассемблер должен быть функцией
sv: inline assembler måste vara en funktion

source: input and output shapes are not compatible
es: Formas de entrada y salida no son compatibles
nl: in- en uitvoervormen zijn niet compatibel

source: input argument must be an integer, a tuple, or a list
de_de: das Eingabeargument muss ein Integer, Tupel oder eine Liste sein
es: argumento de entrada debe ser un entero, una tupla o una lista
fr: le paramètre entrant doit être un nombre entier, un tuple, ou une liste
pt_br: argumento da entrada deve ser um número inteiro, uma tupla ou uma lista
ru: Входной аргумент должен быть целым числом, кортежом или списком
sv: indataargument måste vara integer, en tuple eller list

source: input array length must be power of 2
de_de: Die Länge des Eingabearrays muss eine Potenz von 2 sein
es: el tamaño del arreglo de entrada debe ser potencia de 2
fr: longueur de la matrice d'entrée doit être une puissance de 2
nl: invoer array lengte moet een macht van 2 zijn
pt_br: comprimento da matriz da entrada deve ter potência de 2
ru: Длина входного массива должна быть равна степени 2
sv: indataarraylängden måste vara en multipel av 2

source: input arrays are not compatible
de_de: Eingabe-Arrays sind nicht kompatibel
es: Arrays de entrada no son compactibles
fr: les matrices d'entrée ne sont pas compatibles
nl: input arrays zijn niet compatibel
pt_br: as matrizes da entrada não são compatíveis
ru: Входные массивы несовместимы
sv: indatamatriser är inte kompatibla

source: input data must be an iterable
de_de: Eingabedaten müssen iterierbar sein
es: los datos de entrada deben ser iterables
fr: les données d'entrée doivent être un itérable
nl: invoerdata moet itereerbaar zijn
pt_br: os dados da entrada devem ser iteráveis
ru: Входные данные должны быть итерируемыми
sv: indata måste vara en iterable

source: input matrix is asymmetric
de_de: Eingabematrix ist asymmetrisch
es: la matriz de entrada es asimétrica
fr: la matrice d'entrée est asymétrique
nl: invoermatrix is asymmetrisch
pt_br: a matriz da entrada é assimétrica
ru: Входная матрица асимметрична
sv: indatamatrisen är asymmetrisk

source: input matrix is singular
de_de: Eingabematrix ist singulär
es: la matriz de entrada es singular
fr: la matrice d'entrée est singulière
nl: invoermatrix is singulier
pt_br: a matriz da entrada é singular
ru: Входная матрица является сингулярной
sv: indatamatrisen är singulär

source: input must be a dense ndarray
de_de: Eingabe muss ein dichtes ndarray sein
es: Entrada tiene que ser un ndarray denso
fr: l'entrée doit être un ndarray dense
nl: invoer moet een gesloten ndarray zijn
pt_br: a entrada deve ser um ndarray denso
ru: Ввод должен быть плотным массивом ndarray
sv: indata måste vara en dense ndarray

source: input must be a tensor of rank 2
es: Entrada tiene que ser un tensor de rango 2
nl: invoer moet een tensor van rang 2 zijn

source: input must be an ndarray
de_de: Eingabe muss ein ndarray sein
es: Entrada tiene que ser un ndarray
fr: l'entrée doit être un ndarray
nl: invoer moet een ndarray zijn
pt_br: a entrada deve ser um ndarray
ru: Ввод должен быть массивом ndarray
sv: indata måste vara en ndarray

source: input must be one-dimensional
de_de: die Eingabe muss ein-Dimensional sein
es: Entrada tiene que ser unidimensional
fr: l'entrée doit être uni-dimensionelle
nl: invoer moet eendimensionaal zijn
pt_br: a entrada deve ser unidimensional
ru: Входные данные должны быть одномерными
sv: indata måste vara endimensionell

source: input must be square matrix
de_de: Die Eingabe muss eine quadratische Matrix sein
es: la entrada debe ser una matriz cuadrada
fr: l'entrée doit être une matrice carrée
nl: invoer moet een vierkante matrix zijn
pt_br: a entrada deve ser uma matriz quadrada
ru: Входные данные должны быть квадратной матрицей
sv: indata måste vara kvadratmatris

source: input must be tuple, list, range, or ndarray
de_de: Die Eingabe muss Tupel, Liste, Bereich oder Ndarray sein
es: la entrada debe ser una tupla, lista, rango o ndarray
fr: l'entrée 'input' doit être tuple, list, range ou ndarray
nl: invoer moet een tuple, lijst, bereik of ndarray zijn
pt_br: A entrada deve ser tupla, lista, intervalo ou matriz
ru: Ввод должен быть кортеж, список, диапазон или массивом ndarray
sv: indata måste vara tupel, lista, range, eller ndarray

source: input vectors must be of equal length
de_de: Eingabevektoren müssen gleich lang sein
es: los vectores de entrada deben ser de igual tamaño
fr: les vecteurs d'entrée doivent être de longueur égale
nl: invoervectors moeten van gelijke lengte zijn
pt_br: os vetores da entrada devem ter o mesmo comprimento
ru: Входные векторы должны быть одинаковой длины
sv: indatavektorer måste ha samma längd

source: inputs are not iterable
es: Entradas no son iterables
nl: invoer is niet itereerbaar

source: int() arg 2 must be >= 2 and <= 36
es: int() arg 2 debe ser >= 2 y <= 36
fil: int() arg 2 ay dapat >=2 at <= 36
it_it: il secondo argomanto di int() deve essere >= 2 e <= 36
nl: int() argument 2 moet >=2 en <= 36 zijn

source: integer required
es: Entero requerido
fil: kailangan ng int
it_it: intero richiesto
nl: integer vereist

source: interp is defined for 1D iterables of equal length
de_de: interp ist für 1D-Iterables gleicher Länge definiert
es: interp está definido para iterables 1D de igual tamaño
fr: interp n'est défini que pour les 1D itérables de taille identique
pt_br: o interp é definido para iteráveis 1D com comprimento igual
ru: interp определен для 1D-итераций одинаковой длины
sv: interp är definierad för 1D-iterabla med samma längd

source: interval must be in range %s-%s
de_de: Das Intervall muss im Bereich %s-%s sein
es: el intervalo debe ser der rango %s-%s
fr: interval doit être dans la portée %s-%s
nl: interval moet binnen bereik %s-%s vallen
pt_br: o intervalo deve estar entre %s-%s
ru: Интервал должен находиться в диапазоне %s-%s
sv: interval måste vara i intervallet %s-%s

source: invalid architecture
es: arquitectura inválida

source: invalid arguments
es: argumentos inválidos
fil: mali ang mga argumento
it_it: argomenti non validi
nl: ongeldige argumenten

source: invalid bits_per_pixel %d, must be, 1, 4, 8, 16, 24, or 32
es: los bits_per_pixel %d no son validos, deben ser 1, 4, 8, 16, 24 o 32

source: invalid element size %d for bits_per_pixel %d
de_de: Ungültige Elementgröße %d für bits_per_pixel %d
es: el tamaño del elemento no es valido%d por bits_per_pixel %d
fr: taille d'élément %d est invalide pour bits_per_pixel %d
pt_br: tamanho do elemento %d é inválido para bits_per_pixel %d
ru: недопустимый размер элемента %d для битов на_пиксель %d
sv: ogiltig elementstorlek %d för bits_per_pixel %d

source: invalid element_size %d, must be, 1, 2, or 4
de_de: ungültige Elementgröße %d, muss 1, 2 oder 4 sein
es: el element_size %d,no es valido, debe ser 1,2 ó 4
fr: element_size %d est invalide, doit être 1, 2 ou 4
pt_br: element_size %d é inválido, deve ser, 1, 2, ou 4
ru: аннулированный элемент_размер %d, должен быть, 1, 2 или 4
sv: ogiltig element_size %d, måste vara, 1, 2 eller 4

source: invalid format
es: formato inválido
fil: hindi wastong pag-format
it_it: formato non valido
nl: ongeldig formaat

source: invalid format specifier
de_de: ungültiger Formatbezeichner
es: especificador de formato inválido
fil: mali ang format specifier
fr: spécification de format invalide
it_it: specificatore di formato non valido
nl: ongeldige formaatspecificatie
pt_br: o especificador do formato é inválido
ru: Недопустимый спецификатор формата
sv: ogiltig formatspecificerare

source: invalid hostname
de_de: ungültiger Hostname
es: hostname inválido
fr: hostname incorrect
nl: onjuiste hostnaam
pt_br: o nome do host é inválido
ru: Недопустимое имя хоста
sv: Ogiltigt värdnamn

source: invalid micropython decorator
de_de: ungültiger micropython decorator
es: decorador de micropython inválido
fil: mali ang micropython decorator
fr: décorateur micropython invalide
it_it: decoratore non valido in micropython
nl: ongeldige micropython decorator
pt_br: o decorador micropython é inválido
ru: неверный декоратор микропитона
sv: ogiltig mikropython-dekorator

source: invalid step
de_de: ungültiger Schritt (step)
es: paso inválido
fil: mali ang step
fr: pas invalide
it_it: step non valida
nl: ongeldige stap
pt_br: passo inválido
ru: недействительный шаг
sv: ogiltigt steg

source: invalid syntax
de_de: ungültige Syntax
es: sintaxis inválida
fil: mali ang sintaks
fr: syntaxe invalide
it_it: sintassi non valida
nl: ongeldige syntax
pt_br: sintaxe inválida
ru: недействительный синтаксис
sv: ogiltig syntax

source: invalid syntax for integer
de_de: ungültige Syntax für integer
es: sintaxis inválida para entero
fil: maling sintaks sa integer
fr: syntaxe invalide pour un entier
it_it: sintassi invalida per l'intero
nl: ongeldige syntax voor integer
pt_br: sintaxe inválida para o número inteiro
ru: недействительный синтаксис для целых чисел
sv: ogiltig syntax för heltal

source: invalid syntax for integer with base %d
de_de: ungültige Syntax für integer mit Basis %d
es: sintaxis inválida para entero con base %d
fil: maling sintaks sa integer na may base %d
fr: syntaxe invalide pour un entier de base %d
it_it: sintassi invalida per l'intero con base %d
nl: ongeldige syntax voor integer met grondtal %d
pt_br: sintaxe inválida para o número inteiro com base %d
ru: недействительный синтаксис для целых чисел с основанием %d
sv: ogiltig syntax för heltal med bas %d

source: invalid syntax for number
de_de: ungültige Syntax für number
es: sintaxis inválida para número
fil: maling sintaks sa number
fr: syntaxe invalide pour un nombre
it_it: sintassi invalida per il numero
nl: ongeldige syntax voor nummer
pt_br: sintaxe inválida para o número
ru: недействительный синтаксис для номера
sv: ogiltig syntax för tal

source: issubclass() arg 1 must be a class
de_de: issubclass() arg 1 muss eine Klasse sein
es: issubclass() arg 1 debe ser una clase
fil: issubclass() arg 1 ay dapat na class
fr: l'argument 1 de issubclass() doit être une classe
it_it: il primo argomento di issubclass() deve essere una classe
nl: issubclass() argument 1 moet een klasse zijn
pt_br: issubclass() arg 1 deve ser uma classe
ru: issubclass() arg 1 должен быть классом
sv: issubclass() arg 1 måste vara en klass

source: issubclass() arg 2 must be a class or a tuple of classes
de_de: issubclass() arg 2 muss eine Klasse oder ein Tupel von Klassen sein
es: issubclass() arg 2 debe ser una clase o tuple de clases
fil: issubclass() arg 2 ay dapat na class o tuple ng classes
fr: le deuxième argument de issubclass() doit être une classe ou un tuple de classes
it_it: il secondo argomento di issubclass() deve essere una classe o una tupla di classi
nl: issubclass() argument 2 moet een klasse of tuple van klassen zijn
pt_br: issubclass() arg 2 deve ser uma classe ou uma tupla de classes
ru: issubclass() arg 2 должен быть классом или кортежом классов
sv: issubclass() arg 2 måste vara en klass eller en tupel av klasser

source: iterations did not converge
de_de: Iterationen sind nicht konvergiert
es: las iteraciones no convergen
fr: les itérations n'ont pas convergé
nl: itereerbare objecten convergeren niet
pt_br: as iterações não convergiram
ru: итерации не сходятся
sv: iterations konvergerar inte

source: join expects a list of str/bytes objects consistent with self object
de_de: join erwartet eine Liste von str/bytes-Objekten, die mit dem self-Objekt übereinstimmen
es: join espera una lista de objetos str/bytes consistentes con el mismo objeto
fil: join umaaasang may listahan ng str/bytes objects na naalinsunod sa self object
fr: 'join' s'attend à une liste d'objets str/bytes cohérents avec l'objet self
it_it: join prende una lista di oggetti str/byte consistenti con l'oggetto stesso
nl: join verwacht een lijst van str/byte objecten die consistent zijn met het self-object
pt_br: join espera uma lista de objetos str/bytes consistentes com o próprio objeto
ru: присоединяйтесь к ожидающему список стр/байт объектов, совместимых с самообъектом
sv: join förväntar sig en lista över str/bytes-objekt som överensstämmer med objektet self

source: keyword argument(s) not yet implemented - use normal args instead
es: argumento(s) por palabra clave aún no implementados - usa argumentos normales en su lugar
fil: kindi pa ipinapatupad ang (mga) argument(s) ng keyword - gumamit ng normal args
it_it: argomento(i) nominati non ancora implementati - usare invece argomenti normali
nl: trefwoord argument(en) zijn niet geïmplementeerd, gebruik normale argumenten

source: keywords must be strings
es: palabras clave deben ser strings
fil: ang keywords dapat strings
it_it: argomenti nominati devono essere stringhe
nl: trefwoorden moeten van type string zijn

source: label '%q' not defined
de_de: Label '%q' nicht definiert
es: etiqueta '%q' no definida
fil: label '%d' kailangan na i-define
fr: label '%q' non supporté
it_it: etichetta '%q' non definita
nl: label '%q' is niet gedefinieerd
pt_br: o rótulo '%q' não foi definido
ru: Метка '%q' не определена
sv: etiketten '%q' har inte definierats

source: label redefined
de_de: Label neu definiert
es: etiqueta redefinida
fil: ang label ay na-define ulit
fr: étiquette redéfinie
it_it: etichetta ridefinita
nl: label opnieuw gedefinieerd
pt_br: o rótulo foi redefinido
ru: Метка переопределена
sv: etiketten omdefinierad

source: length argument not allowed for this type
es: argumento length no permitido para este tipo
fil: length argument ay walang pahintulot sa ganitong type
nl: voor dit type is length niet toegestaan

source: level must be between 0 and 1
de_de: Der Pegel muss zwischen 0 und 1 liegen
es: el nivel debe ser entre 0 y 1
fr: le niveau doit être compris entre 0 et 1
nl: level moet tussen 0 en 1 liggen
pt_br: o nível deve estar entre 0 e 1
ru: уровень должен быть между 0 и 1
sv: level ska ligga mellan 0 och 1

source: lhs and rhs should be compatible
de_de: lhs und rhs sollten kompatibel sein
es: lhs y rhs deben ser compatibles
fil: lhs at rhs ay dapat magkasundo
fr: les parties gauches et droites doivent être compatibles
it_it: lhs e rhs devono essere compatibili
nl: lhs en rhs moeten compatibel zijn
pt_br: o lhs e rhs devem ser compatíveis
ru: lhs и rhs должны быть совместимыми
sv: lhs och rhs måste vara kompatibla

source: local '%q' has type '%q' but source is '%q'
de_de: Lokales '%q' hat den Typ '%q', aber die Quelle ist '%q'
es: la variable local '%q' tiene el tipo '%q' pero la fuente es '%q'
fil: local '%q' ay may type '%q' pero ang source ay '%q'
fr: la variable locale '%q' a le type '%q' mais la source est '%q'
it_it: local '%q' ha tipo '%q' ma sorgente è '%q'
nl: lokale '%q' is van type '%q' maar bron is '%q'
pt_br: o local '%q' tem o tipo '%q', porém a origem é '%q'
ru: Локальный '%q' имеет тип '%q', но источник '%q'
sv: lokala '%q' har typ '%q' men källan är '%q'

source: local '%q' used before type known
de_de: Lokales '%q' verwendet bevor Typ bekannt
es: variable local '%q' usada antes del tipo conocido
fil: local '%q' ginamit bago alam ang type
fr: variable locale '%q' utilisée avant d'en connaitre le type
it_it: locla '%q' utilizzato prima che il tipo fosse noto
nl: lokale '%q' gebruikt voordat type bekend is
pt_br: o local '%q' usado antes do tipo conhecido
ru: местный '%q' используется перед типом
sv: lokal '%q' används innan typen är känd

source: local variable referenced before assignment
de_de: Es wurde versucht auf eine Variable zuzugreifen, die es (noch) nicht gibt. Variablen immer zuerst Zuweisen
es: variable local referenciada antes de la asignación
fil: local variable na reference bago na i-assign
fr: variable locale référencée avant d'être assignée
it_it: variabile locale richiamata prima di un assegnamento
nl: verwijzing naar een (nog) niet toegewezen lokale variabele
pt_br: a variável local referenciada antes da atribuição
ru: локальная переменная, на которую ссылается перед присвоением
sv: lokal variabel refererad före tilldelning

source: long int not supported in this build
es: long int no soportado en esta compilación
fil: long int hindi sinusuportahan sa build na ito
it_it: long int non supportata in questa build
nl: long int wordt niet ondersteund in deze build

source: loopback + silent mode not supported by peripheral
de_de: Loopback + Silent Mode wird vom Peripheriegerät nicht unterstützt
es: Loopback + modo silencioso no están soportados por periférico
fr: loopback + silent mode non pris en charge par le périphérique
nl: loopback + silent mode wordt niet ondersteund door randapparaat
pt_br: o loopback + o modo silencioso não é suportado pelo periférico
ru: Замыкание на себя + бесшумный режим, не поддерживаемый периферийными устройствами
sv: loopback + tyst läge stöds inte av kringutrustning

source: malformed f-string
de_de: fehlerhafter F-String
es: cadena-f mal formada
fr: f-string mal formé
nl: onjuist gevormde f-string
pt_br: f-string malformado
ru: Неправильно сформированная F-строка
sv: f-sträng har felaktigt format

source: map buffer too small
de_de: map buffer zu klein
es: map buffer muy pequeño
fil: masyadong maliit ang buffer map
fr: tampon trop petit
it_it: map buffer troppo piccolo
nl: map buffer te klein
pt_br: o mapa do buffer é muito pequeno
ru: Слишком маленький буфер карты
sv: map-buffert för liten

source: math domain error
de_de: Mathe-Domain-Fehler
es: error de dominio matemático
fil: may pagkakamali sa math domain
fr: erreur de domaine math
it_it: errore di dominio matematico
nl: fout in het wiskundig domein (math domain error)
pt_br: erro de domínio matemático
ru: Ошибка математической области
sv: matematikdomänfel

source: matrix is not positive definite
de_de: Matrix ist nicht positiv definitiv
es: matrix no es definida positiva
fr: la matrice n'est pas définie positive
nl: matrix is niet positief-definiet
pt_br: a matriz não é definitiva positiva
ru: матрица не является положительно определенной
sv: matrisen är inte positiv bestämd

source: max_length must be 0-%d when fixed_length is %s
de_de: max_length muss 0-%d sein, wenn fixed_length %s ist
es: max_length debe ser 0-%d cuando fixed_length es %s
fr: max_length doit être 0-%d lorsque fixed_length est %s
nl: max_length moet 0-%d zijn als fixed_length %s is
pt_br: o max_length deve ser 0-%d quando Fixed_length for %s
ru: максимальная_длина должна быть 0-%d когда фиксированная длина %s
sv: max_length måste vara 0-%d när fixed_length är %s

source: max_length must be >= 0
es: max_length debe ser >= 0

source: maximum number of dimensions is 4
es: Máximo número de dimensiones es 4
nl: maximaal aantal dimensies is 4

source: maximum recursion depth exceeded
de_de: maximale Rekursionstiefe überschritten
es: profundidad máxima de recursión excedida
fil: lumagpas ang maximum recursion depth
fr: profondeur maximale de récursivité dépassée
it_it: profondità massima di ricorsione superata
nl: maximale recursiediepte overschreden
pt_br: a recursão máxima da profundidade foi excedida
ru: Превышена максимальная глубина рекурсии
sv: maximal rekursionsdjup överskriden

source: maxiter must be > 0
de_de: maxiter muss > 0 sein
es: maxiter tiene que ser > 0
fr: maxiter doit être > 0
nl: maxiter moet groter dan 0 zijn
pt_br: maxiter deve ser > 0
ru: maxiter должен быть > 0
sv: maxiter måste vara > 0
