Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: Unsupported format
de_de: Nicht unterstütztes Format
es: Formato no soportado
fil: Hindi supportadong format
fr: Format non pris en charge
it_it: Formato non supportato
nl: Niet-ondersteunde format
pt_br: Formato não suportado
ru: Неподдерживаемый формат
sv: Format stöds inte

source: Unsupported operation
es: Operación no soportada
fil: Hindi sinusuportahang operasyon
it_it: Operazione non supportata
nl: Niet-ondersteunde operatie

source: Unsupported pull value.
es: valor pull no soportado.
fil: Hindi suportado ang pull value.
it_it: Valore di pull non supportato.
nl: Niet-ondersteunde pull-waarde.

source: Update Failed
es: La actualización fallo
fr: Mise-à-jour échouée
nl: Update Mislukt
pt_br: A atualização falou
ru: Ошибка обновления
sv: Uppdateringen misslyckades

source: Value length != required fixed length
de_de: Länge des Wertes != Erforderliche feste Länge
es: Tamaño del valor != del tamaño fijo requerido
fr: Longueur de valeur != Longueur fixe requise
nl: Waarde lengte != vereist vaste lengte
pt_br: Comprimento do valor != comprimento fixo necessário
ru: Длина значения! = требуемая фиксированная длина
sv: Värdets längde ! = krävd fast längd

source: Value length > max_length
de_de: Länge des Wertes > max_length
es: Tamaño de valor > max_length
fr: Longueur de la valeur > max_length
nl: Waarde length > max_length
pt_br: O comprimento do valor é > max_length
ru: Длина значения > максимальная_длина
sv: Värdets längd > max_length

source: Version was invalid
de_de: Version ist ungültig
es: La versión era invalida
fr: Version est invalide
pt_br: A versão era inválida
ru: Версия была недействительной
sv: Versionen var ogiltig

source: Voltage read timed out
de_de: Zeitüberschreitung beim Lesen der Spannung
es: Tiempo de espera agotado para lectura de voltaje
fr: La lecture de la tension a expiré
nl: Voltage lees time-out
pt_br: O tempo limite de leitura da tensão expirou
ru: Истекло время ожидания считывания напряжения
sv: Avläsning av spänning tog för lång tid

source: WARNING: Your code filename has two extensions
de_de: WARNUNG: Der Dateiname deines Programms hat zwei Dateityperweiterungen
es: ADVERTENCIA: El nombre de archivo de tu código tiene dos extensiones
fil: BABALA: Ang pangalan ng file ay may dalawang extension
fr: ATTENTION : le nom de fichier de votre code a deux extensions
it_it: ATTENZIONE: Il nome del sorgente ha due estensioni
nl: WAARSCHUWING: De bestandsnaam van de code heeft twee extensies
pt_br: AVISO: Seu arquivo de código tem duas extensões
ru: ВНИМАНИЕ: Имя файла кода имеет два расширения
sv: VARNING: Ditt filnamn för kod har två tillägg

source: WatchDogTimer cannot be deinitialized once mode is set to RESET
de_de: WatchDogTimer kann nicht deinitialisiert werden, wenn der Modus auf RESET gesetzt ist
es: WatchDogTimer no se puede desinicializar luego de definirse en modo RESET
fr: WatchDogTimer ne peut pas être dés-initialisé une fois que le mode est réglé sur RESET
nl: WatchDogTimer kan niet worden gedeïnitialiseerd zodra de modus in ingesteld op RESET
pt_br: O WatchDogTimer não pode ser não-inicializado uma vez que o modo é definido como RESET
ru: Сторожевой таймер не может быть деинициализирован, если установлен режим RESET
sv: WatchDogTimer kan inte avinitialiseras när läget är inställt på RESET

source: WatchDogTimer is not currently running
es: WatchDogTimer no se está ejecutando en este momento
nl: WatchDogTimer is momenteel niet actief

source: WatchDogTimer.mode cannot be changed once set to WatchDogMode.RESET
es: WatchDogTimer.mode no se puede modificar luego de configurar WatchDogMode.RESET
nl: WatchDogTimer.mode kan niet worden gewijzigd zodra de modus is ingesteld op WatchDogMode.RESET

source: WatchDogTimer.timeout must be greater than 0
es: WatchDogTimer.timeout debe ser mayor a 0
nl: WatchDogTimer.timeout moet groter dan 0 zijn

source: Watchdog timer expired.
es: Temporizador de perro guardián expirado.
nl: Watchdog-timer verstreken.

source: Welcome to Adafruit CircuitPython %s! Please visit learn.adafruit.com/category/circuitpython for project guides. To list built-in modules please do `help("modules")`.
es: Bienvenido a Adafruit CircuitPython %s! Visita learn.adafruit.com/category/circuitpython para obtener guías de proyectos. Para listar los módulos incorporados por favor haga `help("modules")`.
fil: Mabuhay sa Adafruit CircuitPython %s! Mangyaring bisitahin ang learn.adafruit.com/category/circuitpython para sa project guides. Para makita ang listahan ng modules, `help(“modules”)`.
nl: Welkom bij Adafruit CircuitPython %s! Bezoek learn.adafruit.com/category/circuitpython voor projectgidsen. Voor een lijst van ingebouwde modules, gebruik `help("modules")`.

source: WiFi password must be between 8 and 63 characters
es: La clave de WiFi debe ser entre 8 y 63 caracteres
nl: WiFi wachtwoord moet tussen 8 en 63 karakters bevatten

source: Woken up by alarm.
de_de: Aufgeweckt durch Alarm.
es: Despertado por la alarma.
fr: Réveil par alarme.
nl: Gewekt door alarm.
pt_br: Foi despertado através do alarme.
ru: Проснулся по тревоге.
sv: Vaknade av larm.

source: Writes not supported on Characteristic
de_de: Schreiben für diese Charakteristik nicht unterstützt
es: Escrituras no admitidas en Characteristic
fr: Écritures non supporté vers les Characteristic
nl: Schrijven niet ondersteund op Characteristic
pt_br: A escrita não é compatível na Característica
ru: Запись не поддерживается в Характеристика
sv: Skrivning stöds inte på karaktäristik

source: You are in safe mode because:
es: Estás en modo seguro por la razón:

source: You pressed the reset button during boot. Press again to exit safe mode.
es: Has presionado el botón de reset durante el arranque. Presiones de nuevo para salir del modo seguro.

source: You requested starting safe mode by
es: Solicitaste iniciar en modo seguro por
fil: Ikaw ang humiling sa safe mode sa pamamagitan ng
it_it: È stato richiesto l'avvio in modalità sicura da
nl: Je hebt aangeven de veilige modus te starten door

source: __init__() should return None
de_de: __init__() sollte None zurückgeben
es: __init__() deberia devolver None
fil: __init __ () dapat magbalik na None
fr: __init__() doit retourner None
it_it: __init__() deve ritornare None
nl: __init __ () zou None moeten retourneren
pt_br: O __init__() deve retornar Nenhum
ru: __init__() должен возвращать значение None
sv: __init __() ska returnera None

source: __init__() should return None, not '%q'
es: __init__() debe retornar None, no '%q'
nl: __init__() moet None teruggeven, niet '%q'

source: __new__ arg must be a user-type
de_de: __new__ arg muss user-type sein
es: __new__ arg debe ser un user-type
fil: __new__ arg ay dapat na user-type
fr: l'argument __new__ doit être d'un type défini par l'utilisateur
nl: __new__ arg moet een user-type zijn
pt_br: O argumento __new__ deve ser um tipo usuário
ru: __new__ arg должен быть пользовательского типа
sv: __new__ arg måste vara en användartyp

source: a bytes-like object is required
de_de: ein Byte-ähnliches Objekt ist erforderlich
es: se requiere un objeto bytes-like
fil: a bytes-like object ay kailangan
fr: un objet 'bytes-like' est requis
it_it: un oggetto byte-like è richiesto
nl: een bytes-achtig object is vereist
pt_br: é necessário objetos tipo bytes
ru: Требуется байтоподобный объект
sv: ett bytesliknande objekt krävs

source: abort() called
es: se llamó abort()
fil: abort() tinawag
it_it: abort() chiamato
nl: abort() aangeroepen

source: address out of bounds
es: address fuera de límites
fil: wala sa sakop ang address
it_it: indirizzo fuori limite
nl: adres buiten bereik

source: addresses is empty
de_de: addresses ist leer
es: addresses esta vacío
fil: walang laman ang address
fr: adresses vides
it_it: gli indirizzi sono vuoti
nl: adressen zijn leeg
pt_br: os endereços estão vazios
ru: адреса пусты
sv: adresserna är tomma

source: annotation must be an identifier
de_de: Die Annotation muss ein Bezeichner sein
es: la anotación debe ser un identificador
fr: l'annotation doit être un identificateur
pt_br: a anotação deve ser um identificador
ru: Аннотация должна быть идентификатором
sv: Annoteringen måste vara en identifierare

source: arg is an empty sequence
de_de: arg ist eine leere Sequenz
es: argumento es una secuencia vacía
fil: arg ay walang laman na sequence
fr: l'argument est une séquence vide
it_it: l'argomento è una sequenza vuota
nl: arg is een lege sequentie
pt_br: o arg é uma sequência vazia
ru: arg - пустая последовательность
sv: arg är en tom sekvens

source: arg must be user-type
de_de: arg muss ein Nutzer-Typ sein
es: arg debe ser tipo-user
fr: l’argument doit être du type utilisateur
pt_br: o arg deve ser do tipo usuário
ru: arg должен быть пользовательского типа
sv: arg måste vara av användartyp

source: argsort argument must be an ndarray
de_de: Das Argument argsort muss ein ndarray sein
es: El argumento para argsort debe ser un ndarray
fr: le paramêtre argsort doit être un ndarray
nl: argsort argument moet een ndarray zijn
pt_br: O argumento argsort deve ser um ndarray
ru: аргумент сортировки должен быть аргументом массива ndarray
sv: argumentet argsort måste vara en ndarray

source: argsort is not implemented for flattened arrays
de_de: argsort ist für flattened Arrays nicht implementiert
es: El argot no está implementado para arrays aplanados
fr: argsort n'est pas implémenté pour les arrays aplatis
nl: argsort wordt niet geïmplementeerd voor vlakke arrays
pt_br: argsort não é implementado para matrizes achatadas
ru: сортировка arg не реализована для сглаженных массивов
sv: argsort är inte implementerad för tillplattade matriser

source: argument has wrong type
es: el argumento tiene un tipo erroneo
fil: may maling type ang argument
it_it: il tipo dell'argomento è errato
nl: argument heeft onjuist type
pt_br: argumento tem tipo errado

source: argument name reused
de_de: Name des Arguments wiederverwendet
es: nombre de argumento reutilizado
fr: le nom de l'argument est réutilisé
pt_br: nome do argumento reutilizado
ru: Повторное использование имени аргумента
sv: argumentnamn återanvänt

source: argument num/types mismatch
de_de: Anzahl/Typen der Argumente passen nicht
es: argumento número/tipos no coinciden
fil: hindi tugma ang argument num/types
fr: nombre/types de paramètres ne correspondent pas
it_it: discrepanza di numero/tipo di argomenti
nl: argument num/typen komen niet overeen
pt_br: o argumento num/tipos não combinam
ru: Аргумент Несоответствие числа/типов
sv: argument antal/typ matchar inte

source: argument should be a '%q' not a '%q'
es: argumento deberia ser un '%q' no un '%q'
fil: argument ay dapat na '%q' hindi '%q'
it_it: l'argomento dovrebbe essere un '%q' e non un '%q'
nl: argument moet een '%q' zijn en niet een '%q'
pt_br: o argumento deve ser um '%q' e não um '%q'

source: arguments must be ndarrays
de_de: Argumente müssen ndarrays sein
es: argumentos deben ser ndarrays
fr: les paramètres doivent être des ndarrays
nl: argumenten moeten ndarrays zijn
pt_br: os argumentos devem ser ndarrays
ru: Аргументы должны быть массивами ndarrays
sv: argumenten måste vara ndarray

source: array and index length must be equal
de_de: Array- und Indexlänge müssen gleich sein
es: Longitud del array e índice tienen que ser iguales
fr: la taille de l'array et de l'index doivent être égaux
nl: array en indexlengte moeten gelijk zijn
pt_br: a matriz e comprimento do índice devem ser iguais
ru: Длина массива и индекса должна быть равна
sv: array och indexlängd måste vara lika

source: array/bytes required on right side
de_de: Array/Bytes auf der rechten Seite erforderlich
es: array/bytes requeridos en el lado derecho
fil: array/bytes kinakailangan sa kanang bahagi
fr: matrice/octets requis à la droite
nl: array/bytes vereist aan de rechterkant
pt_br: matriz/bytes são necessários no lado direito
ru: массив/байты, необходимые справа
sv: array/bytes krävs på höger sida

source: attempt to get (arg)min/(arg)max of empty sequence
de_de: Versuch (arg)min/(arg)max einer leeren Sequenz zu holen
es: Intendo de obteber (arg)min/(arg)max de secuencia vacía
fr: tentative d'obtenir (arg)min/(arg)max d'une séquence vide
nl: verzoek om (arg)min.(arg)max te krijgen van lege reeks
pt_br: tentativa de obter (arg)min/(arg)max da sequência vazia
ru: Попытка получить (аргумент)минимальный/(аргумент)максимальный пустой последовательности
sv: försök att läsa (arg)min/(arg)max av tom sekvens

source: attempt to get argmin/argmax of an empty sequence
de_de: Versuch, argmin/argmax einer leeren Sequenz zu ermitteln
es: intento de obtener argmin/argmax de una secuencia vacía
fr: tenter d'obtenir argmin / argmax d'une séquence vide
nl: poging om argmin/argmax van een lege sequentie te krijgen
pt_br: tente obter argmin/argmax de uma sequência vazia
ru: Попытка получить аргумент минимальный/аргумент максимальный пустой последовательности
sv: försök att få argmin/argmax för en tom sekvens

source: attributes not supported yet
es: atributos aún no soportados
fil: attributes hindi sinusuportahan
it_it: attributi non ancora supportati
nl: attributen nog niet ondersteund

source: axis is out of bounds
de_de: Achse außerhalb des Wertebereichs
es: Eje está fuera de sus límites
fr: axis est hors limites
nl: as is buiten bereik
pt_br: o eixo está fora dos limites
ru: Ось выходит за пределы
sv: axis är utanför gränsen

source: axis must be None, or an integer
de_de: Achse muss Nichts, oder ein Integer sein
es: Eje tiene que ser None, o un entero
fr: axis doit être None ou un entier
nl: as moet None of een integer zijn
pt_br: eixo deve ser Nenhum ou um número inteiro
ru: ось должна быть None или целым числом
sv: axis måste vara None eller ett heltal

source: axis too long
de_de: Achse zu lang
es: Eje demasiado largo
fr: axis trop long
nl: as te lang
pt_br: o eixo é muito longo
ru: Слишком длинная ось
sv: axis för lång

source: bad compile mode
de_de: schlechter Kompilierungsmodus
es: modo de compilación erroneo
fil: masamang mode ng compile
fr: mauvais mode de compilation
nl: verkeerde compileer modus
pt_br: modo de compilação ruim
ru: Неверный режим компиляции
sv: Ogiltigt kompileringsläge

source: bad conversion specifier
de_de: schlechter Konvertierungsspezifizierer
es: especificador de conversion erroneo
fil: masamang pag convert na specifier
fr: mauvaise spécification de conversion
it_it: specificatore di conversione scorretto
nl: slechte conversie specificatie
pt_br: especificador de conversão incorreto
ru: Неверный спецификатор преобразования
sv: Ogiltig konverteringsspecifikation

source: bad format string
de_de: Falscher Formatstring
es: formato de string erroneo
fil: maling format ang string
fr: chaîne mal-formée
it_it: stringa di formattazione scorretta
nl: string met verkeerde indeling
pt_br: formato da string incorreta
ru: Строка неверного формата
sv: Ogiltig formatsträng

source: bad typecode
de_de: Falscher Typcode
es: typecode erroneo
fil: masamang typecode
fr: mauvais code type
nl: verkeerde typecode
pt_br: typecode incorreto
ru: Неверный шрифт
sv: Ogiltig typkod

source: binary op %q not implemented
de_de: Der binäre Operator %q ist nicht implementiert
es: operacion binaria %q no implementada
fil: binary op %q hindi implemented
fr: opération binaire '%q' non implémentée
it_it: operazione binaria %q non implementata
nl: binaire op %q niet geïmplementeerd
pt_br: a operação binário %q não foi implementada
ru: двоичная операция %q не реализована
sv: binär op %q är inte implementerad

source: bits must be 32 or less
de_de: bits müssen 32 oder kleiner sein
es: los bits deben ser 32 o menos
fr: les bits doivent être 32 ou moins
pt_br: bits deve ser 32 ou menos
ru: биты должны быть 32 или менее
sv: bits måste vara 32 eller färre

source: bits must be in range 5 to 9
es: los bits deben estar en el rango de 5 a 9

source: bits_per_sample must be 8 or 16
de_de: Es müssen 8 oder 16 bits_per_sample sein
es: bits_per_sample debe ser 8 ó 16
fil: bits_per_sample ay dapat 8 o 16
fr: 'bits_per_sample' doivent être 8 ou 16
nl: bits_per_sample moet 8 of 16 zijn
pt_br: bits_per_sample deve ser 8 ou 16
ru: bits_per_sample должно быть 8 или 16
sv: bits_per_sample måste vara 8 eller 16

source: branch not in range
de_de: Zweig ist außerhalb der Reichweite
es: la rama no está dentro del rango
fil: branch wala sa range
fr: branche hors intervalle
nl: pad (branch) niet binnen bereik
pt_br: ramo fora do alcance
ru: Ветвь не в пределах досягаемости
sv: branch utanför räckvidd

source: buffer is smaller than requested size
de_de: Der Puffer ist kleiner als die angefragte Größe
es: El buffer es mas pequeño que el requerido
fr: tampon est plus petit que la taille demandée
pt_br: o tamanho do buffer é menor do que o tamanho que foi solicitado
ru: Размер буфера меньше запрошенного
sv: bufferten är mindre än begärd storlek

source: buffer size must be a multiple of element size
de_de: Die Puffergröße muss ein vielfaches der Elementgröße sein
es: El tamaño del buffer debe ser un múltiplo del tamaño del elemento
fr: taille du tampon doit être un multiple de la taille de l'élément
pt_br: o tamanho do buffer deve ser um múltiplo do tamanho do elemento
ru: Размер буфера должен быть кратен размеру элемента
sv: buffertstorlek måste vara en multipel av elementstorlek

source: buffer size must match format
de_de: Die Puffergröße muss zum Format passen
es: el tamaño del buffer debe de coincidir con el formato
fr: la taille du tampon doit correspondre au format
nl: grootte van de buffer moet overeenkomen met het formaat
pt_br: o tamanho do buffer deve coincidir com o formato
ru: Размер буфера должен соответствовать формату
sv: buffertstorleken måste matcha formatet

source: buffer slices must be of equal length
de_de: Puffersegmente müssen gleich lang sein
es: Las secciones del buffer necesitan tener longitud igual
fil: aarehas na haba dapat ang buffer slices
fr: les tranches de tampon doivent être de longueurs égales
it_it: slice del buffer devono essere della stessa lunghezza
nl: buffer slices moeten van gelijke grootte zijn
pt_br: as fatias do buffer devem ter o mesmo comprimento
ru: Буферные фрагменты должны быть одинаковой длины
sv: buffertsegmenten måste vara lika långa

source: buffer too small
de_de: Puffer zu klein
es: buffer demasiado pequeño
fil: masyadong maliit ang buffer
fr: tampon trop petit
it_it: buffer troppo piccolo
nl: buffer te klein
pt_br: o buffer é muito pequeno
ru: буфер слишком мал
sv: buffert för liten

source: buffer too small for requested bytes
de_de: Der Puffer ist zu klein für die angefragten Bytes
es: búfer muy pequeño para los bytes solicitados
fr: tampon trop petit pour le nombre d'octets demandé
nl: buffer te klein voor gevraagde bytes
pt_br: o buffer é pequeno demais para os bytes requisitados
ru: Слишком маленький буфер для запрашиваемых байтов
sv: buffert för liten för begärd längd

source: buttons must be digitalio.DigitalInOut
es: los botones necesitan ser digitalio.DigitalInOut
nl: buttons moeten digitalio.DigitalInOut zijn

source: byteorder is not a string
es: byteorder no es una cadena
nl: byteorder is geen string

source: bytes > 8 bits not supported
es: bytes > 8 bits no soportados
fil: hindi sinusuportahan ang bytes > 8 bits
it_it: byte > 8 bit non supportati
nl: butes > 8 niet ondersteund

source: bytes length not a multiple of item size
de_de: Byte-Länge ist kein vielfaches der Item-Größe
es: el tamaño en bytes no es un múltiplo del tamaño del item
fr: bytes length n'est pas un multiple de la taille d'un élément
nl: bytes lengte is geen veelvoud van itemgrootte
pt_br: o comprimento dos bytes não é um múltiplo do tamanho do item
ru: длина байтов, не кратная размеру элемента
sv: bytelängd inte en multipel av storlek

source: bytes value out of range
de_de: Byte-Wert außerhalb des Bereichs
es: valor de bytes fuera de rango
fil: bytes value wala sa sakop
fr: valeur des octets hors intervalle
it_it: valore byte fuori intervallo
nl: bytes waarde buiten bereik
pt_br: o valor dos bytes estão fora do alcance
ru: Значение байтов вне диапазона
sv: bytevärde utanför intervallet

source: calibration is out of range
de_de: Kalibrierung ist außerhalb der Reichweite
es: calibration esta fuera de rango
fil: kalibrasion ay wala sa sakop
fr: étalonnage hors intervalle
it_it: la calibrazione è fuori intervallo
nl: calibration is buiten bereik
pt_br: Calibração está fora do intervalo
ru: Калибровка выходит за пределы допустимого диапазона
sv: kalibrering är utanför intervallet

source: calibration is read only
de_de: Kalibrierung ist Schreibgeschützt
es: calibration es de solo lectura
fil: pagkakalibrate ay basahin lamang
fr: étalonnage en lecture seule
it_it: la calibrazione è in sola lettura
nl: calibration is alleen-lezen
pt_br: Calibração é somente leitura
ru: Калибровка доступна только для чтения
sv: kalibrering är skrivskyddad

source: calibration value out of range +/-127
es: Valor de calibración fuera del rango +/-127
fil: ang halaga ng pagkakalibrate ay wala sa sakop +/-127
it_it: valore di calibrazione fuori intervallo +/-127
nl: calibration waarde buiten bereik +/-127

source: can only have up to 4 parameters to Thumb assembly
de_de: kann nur bis zu 4 Parameter für die Thumb assembly haben
es: solo puede tener hasta 4 parámetros para ensamblar Thumb
fil: maaari lamang magkaroon ng hanggang 4 na parameter sa Thumb assembly
fr: il ne peut pas y avoir plus de 4 paramètres pour l'assemblage Thumb
nl: kan slechts 4 parameters aan Thumb assembly geven
pt_br: só pode haver até 4 parâmetros para a montagem Thumb
ru: может иметь только до 4 параметров для сборки большого пальца
sv: kan bara ha upp till 4 parametrar för Thumbs assembly

source: can only have up to 4 parameters to Xtensa assembly
de_de: kann nur bis zu 4 Parameter für die Xtensa assembly haben
es: solo puede tener hasta 4 parámetros para ensamblador Xtensa
fil: maaari lamang magkaroon ng hanggang 4 na parameter sa Xtensa assembly
fr: il ne peut pas y avoir plus de 4 paramètres pour l'assemblage Xtensa
it_it: sono disponibili fino a 4 parametri per il Xtensa assembly
nl: kan slechts 4 parameters aan Xtensa assembly geven
pt_br: só pode haver até 4 parâmetros para a montagem Xtensa
ru: может иметь только до 4 параметров для сборки Xtensa
sv: kan bara ha upp till 4 parametrar att Xtensa assembly

source: can't add special method to already-subclassed class
de_de: Der bereits untergeordneten Klasse kann keine spezielle Methode hinzugefügt werden
es: no se puede agregar un método a una clase ya subclasificada
fil: hindi madagdag ang isang espesyal na method sa isang na i-subclass na class
fr: impossible d'ajouter une méthode spéciale à une classe déjà sous-classée
nl: kan geen speciale methode aan een al ge-subkwalificeerde klasse toevoegen
pt_br: não é possível adicionar o método especial à classe já subclassificada
ru: Не удается добавить специальный метод к уже имеющемуся подклассу классу
sv: kan inte lägga till särskild metod för redan subklassad klass

source: can't assign to expression
de_de: kann keinem Ausdruck zuweisen
es: no se puede asignar a la expresión
fil: hindi ma i-assign sa expression
fr: ne peut pas assigner à une expression
it_it: impossibile assegnare all'espressione
nl: kan niet toewijzen aan expressie
pt_br: a expressão não pode ser atribuída
ru: Не удается назначить выражение
sv: kan inte tilldela uttryck

source: can't cancel self
de_de: kann self nicht abbrechen
es: no se puede cancelar a si mismo
fr: ne peut pas s'annuler soi-même
pt_br: não é possível cancelar a si mesmo
ru: Не могу отменить себя
sv: kan inte avbryta sig själv

source: can't convert %q to %q
de_de: kann %q nicht zu %q konvertieren
es: no puede convertir %q a %q
fr: impossible de convertir %q en %q
nl: kan %q niet naar %q converteren
pt_br: não é possível converter %q para %q
ru: Не удается преобразовать %q в %q
sv: kan inte konvertera %q till %q
