Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: incompatible .mpy file
de_de: inkompatible .mpy Datei
fr: fichier .mpy incompatible
pt_br: arquivo .mpy incompatível
ru: несовместимый файл .mpy
sv: inkompatibel .mpy-fil

source: index must be tuple or int
de_de: Index muss tuple oder int sein
fr: l'index doit être un tuple ou entier
pt_br: o índice deve ser tupla ou int
ru: Индекс должен быть кортежом или целым кортежом
sv: index måste vara tuple eller int

source: init I2C
de_de: initialisiere I2C
fr: initialisation I2C
pt_br: inicialização do I2C
ru: инициализация I2C
sv: I2C start

source: input and output dimensions differ
de_de: Eingabe- und Ausgabedimensionen unterscheiden sich
fr: les dimensions de sortie et d'entrée sont différentes
pt_br: as dimensões da entrada e da saída diferem
ru: Входные и выходные размеры различаются
sv: In- och utdimensionerna skiljer sig åt

source: input and output shapes differ
de_de: Eingabe- und Ausgabeformen unterscheiden sich
fr: les formes d'entrée et de sortie sont différentes
pt_br: as formas da entrada e da saída diferem
ru: Входные и выходные формы различаются
sv: In- och utdataformerna skiljer sig åt

source: input dtype must be float or complex
de_de: Eingabe dtype muss float oder complex sein
fr: le dtype d'entrée doit être un flottant ou un complexe
pt_br: o tipo da entrada dtype deve ser flutuante ou complexo
ru: Входной тип dtype должен быть плавающим или сложным
sv: indatatyp måste vara float eller complex

source: input is not iterable
de_de: Eingabe ist nicht iterierbar
fr: impossible d'itérer sur l'entrée
pt_br: a entrada não é iterável
ru: Ввод не является итерируемым
sv: indata är inte itererbar

source: input must be 1- or 2-d
de_de: Eingabe muss 1- oder 2-d sein
fr: l'entrée doit être 1D ou 2D
pt_br: a entrada deve ser 1- ou 2-d
ru: Вход должен быть 1- или 2-D
sv: input måste vara 1- eller 2-d

source: input must be a 1D ndarray
de_de: Eingabe muss ein 1D ndarray sein
fr: l'entrée doit être un ndarray 1D
pt_br: a entrada deve ser um 1D ndarray
ru: Ввод должен быть 1D массивом ndarray
sv: indata måste vara en 1D ndarray

source: input must be an ndarray, or a scalar
de_de: Eingabe muss ein ndarray oder ein Skalar sein
fr: l'entrée doit être un ndarray, ou un scalaire
pt_br: a entrada deve ser um ndarray ou um escalar
ru: Ввод должен быть массивом ndarray или скаляр
sv: indata måste vara en ndarray eller en scalar

source: invalid arch
pt_br: arco inválido
sv: ogiltig arch

source: invalid bits_per_pixel %d, must be, 1, 2, 4, 8, 16, 24, or 32
de_de: ungültige Bits_pro_Pixel %d, muss 1, 2, 4, 8, 16, 24 oder 32 sein
fr: %d est invalide pour bits_per_pixel, doit être 1, 2, 4, 8, 16, 24, ou 32
pt_br: bits_per_pixel %d inválido, deve ser, 1, 2, 4, 8, 16, 24, ou 32
ru: неверный бит_на_пиксель %d, должно быть 1, 2, 4, 8, 16, 24 или 32
sv: ogiltig bits_per_pixel %d, måste vara, 1, 2, 4, 8, 16, 24 eller 32

source: invalid cert
de_de: ungültiges cert
fil: mali ang cert
fr: certificat invalide
it_it: certificato non valido
pt_br: certificado inválido
ru: Неверный сертификат
sv: ogiltigt certifikat

source: invalid exception
de_de: ungültige Ausnahme
fr: exception invalide
pt_br: exceção inválida
ru: Недопустимое исключение
sv: Ogiltig exception

source: invalid key
de_de: ungültiger Schlüssel
fil: mali ang key
fr: clé invalide
it_it: chiave non valida
pt_br: chave inválida
ru: Неверный ключ
sv: ogiltig nyckel

source: invalid setting
de_de: Invalide Einstellung
fr: réglage invalide
pt_br: configuração inválida
ru: Недопустимый параметр
sv: ogiltig inställning

source: keyword argument(s) not implemented - use normal args instead
pt_br: argumento(s) de palavra-chave não implementado(s) - em vez disso, use argumentos normais
sv: sökordsargument inte implementerade – använd normala argument istället

source: mDNS already initialized
de_de: mDNS bereits initialisiert
fr: mDNS a déjà été initialisé
pt_br: O mDNS já foi inicializado
ru: mDNS уже инициализирован
sv: mDNS har redan initierats

source: mDNS only works with built-in WiFi
de_de: mDNS funktioniert nur mit integriertem WiFi
fr: mDNS ne fonctionne que avec le WiFi intégré
pt_br: O mDNS só funciona com WiFi integrado
ru: mDNS работает только со встроенным WiFi
sv: mDNS fungerar bara med inbyggt WiFi

source: maximum number of dimensions is
de_de: Maximale Anzahl an Dimensionen ist
fr: le nombre maximal de dimensions est
pt_br: a quantidade máxima de dimensões é
ru: Максимальное количество измерений составляет
sv: maximalt antal dimensioner är

source: memoryview offset too large
de_de: memoryview-Versatz zu groß
pt_br: o deslocamento da visualização da memória é muito grande
sv: memoryview offset för stor

source: mktime needs a tuple of length 8 or 9
de_de: mktime braucht ein Tupel der Länge 8 oder 9
fr: mktime nécéssite un tuple de longueur 8 ou 9
pt_br: O mktime precisa de uma tupla com comprimento 8 ou 9
sv: mktime behöver en tupel med längden 8 eller 9

source: mode must be complete, or reduced
de_de: Modus muss vollständig oder reduziert sein
fr: le mode doit être complet, ou réduit
pt_br: o modo deve ser completo ou reduzido
ru: Режим должен быть завершенным или уменьшенным
sv: mode måste vara complete, eller reduced

source: monitor init failed
de_de: monitor init fehlgeschlagen
fr: l'initialisation du moniteur a échoué
pt_br: o init do monitor falhou
ru: Сбой инициализации монитора
sv: monitor init misslyckades

source: native code in .mpy unsupported
de_de: Nativer Code in .mpy wird nicht unterstützt
fr: code natif dans fichier .mpy non pris en charge
pt_br: código nativo em .mpy não é compatível
sv: Inbyggd kod i .mpy stöds inte

source: ndarray length overflows
de_de: ndarray-Länge fließt über
fr: dépassement de longueur du ndarray
pt_br: estouros de comprimento no ndarray
ru: Переполнение длины массива ndarray
sv: ndarray-längden överskriden

source: nested index must be int
de_de: verschachtelter Index muss int sein
fr: sous index doit être entier
pt_br: o índice aninhado deve ser int
ru: вложенный индекс должен быть int
sv: nästlat index måste vara en int

source: not a constant
de_de: keine Konstante
fr: pas une constante
pt_br: não é uma constante
ru: не константа
sv: inte en konstant

source: not implemented for complex dtype
de_de: nicht implementiert für komplexe dtype
fr: n'est pas implémenté pour les dtype complexes
pt_br: não foi implementado para dtype complexo
ru: не реализовано для сложного типа d
sv: inte implementerat för complex dtype

source: not supported for input types
de_de: nicht unterstützt für Eingabetypen
fr: non pris en charge pour types d'entrée
pt_br: não compatível para os tipos de entrada
ru: Не поддерживается для типов ввода
sv: stöds inte för indatatyper

source: off
de_de: aus
fr: inactif
pt_br: desligado
ru: выключить
sv: av

source: only mono is supported
de_de: nur Mono wird unterstützt
fr: seul mono est supporté
pt_br: Apenas o mono é compatível
ru: Поддерживается только моно
sv: endast mono stöds

source: only ndarrays can be concatenated
de_de: nur ndarrays können aneinandergehängt werden
fr: seuls les ndarrays peuvent être concaténés
pt_br: somente os ndarrays podem ser concatenados
ru: только массивы ndarrays могут быть объединены
sv: endast ndarrays kan sammanfogas

source: only oversample=64 is supported
de_de: nur oversample=64 wird unterstützt
fr: seul oversample=64 supporté
pt_br: apenas oversample=64 é compatível
ru: поддерживается только выборка = 64
sv: endast oversample=64 stöds

source: operation is defined for 2D arrays only
de_de: Operation ist nur für 2D-Arrays definiert
fr: l'opération n'est seulement définie que pour les matrices 2D
pt_br: a operação é definida apenas para as matrizes 2D
ru: операция определена только для 2D-массивов
sv: operation definierad endast för 2D-matriser

source: operation is defined for ndarrays only
de_de: Operation ist nur für ndarrays definiert
fr: l'opération n'est seulement définie que pour les ndarrays
pt_br: a operação é definida apenas para ndarrays
ru: операция определена только для массивов ndarrays
sv: operation definierad endast för ndarrays

source: operation not supported for the input types
de_de: Operation wird für die Eingabetypen nicht unterstützt
fr: opération non prise en charge pour les types d'entrée
pt_br: a operação não é suportada para os tipos de entrada
sv: operationen stöds inte för in-typer

source: out keyword is not supported for complex dtype
de_de: out-Schlüsselwort wird nicht unterstützt für komplexen dtype
fr: mot clé out non pris en charge pour dtype complexe
pt_br: a palavra-chave out não é compatível para o dtype complexo
ru: Ключевое слово out не поддерживается для сложного типа d
sv: nyckelordet out stöds inte för komplex dtyp

source: out keyword is not supported for function
de_de: out-Schlüsselwort wird nicht unterstützt für Funktion
fr: mot clé out non pris en charge pour function
pt_br: a palavra-chave out não é compatível com a função
ru: ключевое слово не поддерживается для функции
sv: nyckelordet out stöds inte för function

source: out must be an ndarray
de_de: out muss ein ndarray sein
fr: out doit être un ndarray
pt_br: out deve ser um ndarray
ru: out должен быть массивом ndarray
sv: out måste vara en ndarray

source: out must be of float dtype
de_de: out muss vom Typ dtype sein
fr: out doit être de dtype float
pt_br: out deve ser do tipo float dtype
ru: Выход должен быть поплавкового типа
sv: out måste vara av float dtype

source: poll on file not available on win32
de_de: Abfrage der Datei unter Win32 nicht verfügbar
fr: le polling sur un fichier n'est pas disponible sous win32
pt_br: a sondagem no arquivo não está disponível no win32
ru: Опрос в файле недоступен в Win32
sv: filbevakning är inte tillgänglig på win32

source: positional arg after **
pt_br: arg posicional após **
ru: позиционный аргумент после **
sv: positionsargument efter **

source: positional arg after keyword arg
pt_br: arg posicional após o arg de palavra-chave
ru: позиционный аргумент после ключевого слова аргумента
sv: positionsargument efter nyckelord arg

source: raw f-strings are not supported
de_de: unformatierte F-Strings werden nicht unterstützt
fr: les f-strings bruts ne sont pas supportées
pt_br: os f-strings brutos não são suportados
ru: Необработанные F-строки не поддерживаются
sv: råa f-strängar stöds inte

source: rsplit(None,n)
pt_br: rsplit(Nenhum,n)
ru: rsplit(Нет;n)

source: shape must be integer or tuple of integers
de_de: Form muss eine Ganzzahl oder ein Tupel von Ganzzahlen sein
fr: la forme doit être un entier ou un tuple d'entiers
pt_br: a forma deve ser inteira ou tupla de inteiros
ru: фигура должна быть целым числом или кортежом целых чисел
sv: shape måste vara ett heltal eller en tupel av heltal

source: source_bitmap must have value_count of 2 or 65536
de_de: source_bitmap muss value_count von 2 oder 65536 haben
fr: source_bitmat doit avoir une value_count de 2 ou 65536
pt_br: o source_bitmap deve ter o value_count de 2 ou 65536
ru: source_bitmap должен иметь значение_счет 2 или 65536
sv: source_bitmap måste ha value_count av 2 eller 65536

source: source_bitmap must have value_count of 65536
de_de: source_bitmap muss value_count von 65536 haben
fr: source_bitmap doit avoir une value_count de 65536
pt_br: o source_bitmap deve ter o value_count de 65536
ru: source_bitmap должен иметь значение_счет 65536
sv: source_bitmap måste ha value_count av 65536

source: source_bitmap must have value_count of 8
de_de: source_bitmap muss value_count von 8 haben
fr: source_bitmap doit avoir une value_count de 8
pt_br: o source_bitmap deve ter o value_count de 8
ru: source_bitmap должен иметь значение_счет 8
sv: source_bitmap måste ha value_count av 8

source: splitting with sub-captures
pt_br: divisão com subcapturas
sv: Delning med underfångst stöds inte

source: string argument without an encoding
de_de: String-Argument ohne Encoding
fr: arguments de type chaine de caractères sans encodage
pt_br: argumento da string sem uma codificação
sv: strängargument utan kodning

source: string index out of range
de_de: String index außerhalb des Bereiches
fil: indeks ng string wala sa sakop
fr: index de chaîne hors gamme
it_it: indice della stringa fuori intervallo
pt_br: o índice da string está fora do intervalo
sv: strängindex utanför intervallet

source: string indices must be integers, not %s
de_de: String indizes müssen Integer sein, nicht %s
fil: ang indeks ng string ay dapat na integer, hindi %s
fr: les indices de chaîne de caractères doivent être des entiers, pas %s
it_it: indici della stringa devono essere interi, non %s
pt_br: o índices das string devem ser números inteiros, não %s
sv: strängindex måste vara heltal, inte %s

source: ticks interval overflow
fr: débordement de l'intervale des ticks
pt_br: estouro do intervalo de ticks
sv: Överskridet tickintervall

source: timer re-init
de_de: Timer wird erneut initialisiert
fr: ré-initialisation du miniteur
pt_br: reinicialização do temporizador
ru: Повторное инициализация таймера
sv: timer omstart

source: too many args
de_de: zu viele Argumente
fr: args trop nombreux
pt_br: args demais
ru: слишком много аргументов
sv: för mpnga argument

source: unindent doesn't match any outer indent level
de_de: unindent stimmt mit keiner äußeren Einrückungsebene überein
fr: unindent ne correspond pas au niveau d'indentation parent
pt_br: sem indentação não corresponde com nenhum nível de indentação exterior
ru: Отступ не совпадает ни с одним уровнем внешнего отступа
sv: avindentering matchar inte någon yttre indentering

source: unmatched '%c' in format
de_de: '%c' in Format konnte nicht zugeordnet werden
fr: '%c' sans correspondance dans le format
pt_br: '%c' sem correspondência no formato
ru: Несовпадающий '%c' в формате
sv: Omatchad '%c' i format

source: unsupported colorspace for GifWriter
de_de: Farbraum wird nicht unterstützt für GifWriter
fr: espace de couleur non supporté pour GifWriter
pt_br: espaço de cores não compatível com GifWriter
ru: неподдерживаемое цветовое пространство для GifWriter
sv: färgrymd stöds inte för GifWriter

source: unsupported colorspace for dither
de_de: Farbraum wird nicht unterstützt für dither
fr: espace de couleur non supporté pour dither
pt_br: espaço de cor não compatível para dither
ru: Неподдерживаемое цветовое пространство для дизеринга
sv: färgrymd stöds inte för dither

source: unsupported type for %q: '%s'
de_de: nicht unterstützter Type für %q: '%s'
fil: hindi sinusuportahang type para sa %q: '%s'
fr: type non supporté pour %q : '%s'
it_it: tipo non supportato per %q: '%s'
pt_br: tipo não compatível para %q: '%s'
sv: typ som inte stöds för %q: '%s'

source: usecols is too high
de_de: usecols ist zu hoch/groß
fr: usecols est trop grand
pt_br: usecols é muito alto
ru: Usecols слишком высок
sv: usecols är för hög

source: usecols keyword must be specified
de_de: usecols muss definiert sein
fr: le mot-clé "usecols" doit être spécifié
pt_br: palavra-chave para o usecols deve ser definida
ru: Ключевое слово usecols должно быть указано
sv: nyckelordet usecols måste anges

source: value out of range of target
de_de: Wert außerhalb des Zielbereiches
fr: valeur hors de l'intervalle de la cible
pt_br: valor fora do alcance do alvo
ru: Величина выходящая за пределы диапазона цели
sv: värde utanför målintervall

source: wifi.Monitor not available
de_de: wifi.Monitor nicht verfügbar
fr: wifi.Monitor non disponible
pt_br: O wifi.Monitor não está disponível
ru: Wi-Fi. Монитор недоступен
sv: wifi.Monitor är inte tillgänglig

source: wrong dtype
de_de: Falsches dtype
fr: dtype invalide
pt_br: dtype errado
ru: Неправильный тип
sv: fel dtype

source: wrong index type
de_de: falscher Indextyp
fr: type d'index incorrect
pt_br: tipo do índice errado
ru: Неправильный тип индекса
sv: fel indextyp

source: wrong length of condition array
de_de: falsche Länge des Array von Bedingungen
fr: mauvaise taille du tableau de condition
pt_br: comprimento errado na condição da matriz
ru: неправильная длина массива состояния
sv: fel längd på villkorsmatrisen

source: wrong length of index array
de_de: Falsche Länge des Index Arrays
fr: mauvaise longueur du tableau d'indices
pt_br: comprimento errado do índice da matriz
ru: неправильная длина массива индексов
sv: fel längd av index array

source: %q and %q must share a clock unit
de_de: %q und %q müssen eine Uhreneinheit teilen
sv: %q och %q måste dela klockenhet

source: %q must be multiple of 8.
de_de: %q muss ein Vielfaches von 8 sein.
sv: %q måste vara en multipel av 8.

source: %q must be of type %q, %q, or %q, not %q
de_de: %q muss vom Typ %q, %q oder %q sein, und nicht %q
sv: %q måste vara av typen %q, %q, eller %q, inte %q

source: %q too long
de_de: %q zu lang
sv: %q för lång

source: %q() without %q()
de_de: %q() ohne %q()
sv: %q() utan %q()

source: Data format error (may be broken data)
de_de: Datenformatfehler (Möglicherweise beschädigte Daten)
sv: Dataformatfel (kan var felaktig data)

source: Device error or wrong termination of input stream
sv: Enhetsfel eller felaktig terminator av inström

source: Insufficient memory pool for the image
de_de: Unzureichender Speicherpool für das Bild
sv: Otillräcklig minnespool för bilden

source: Insufficient stream input buffer
sv: Otillräcklig buffer för inström

source: Interrupted by output function
de_de: Unterbrochen durch Ausgabefunktion
sv: Avbruten av utgångsfunktion

source: Not supported JPEG standard
de_de: Nicht unterstützter JPEG-Standard
sv: JPEG-standard stöds ej

source: Parameter error
de_de: Parameter-Fehler
sv: Parameterfel

source: RLE-compressed BMP not supported
de_de: RLE-komprimiertes BMP ist nicht unterstützt
sv: RLE-kodad BMP stöds ej

source: Right format but not supported
de_de: Korrektes Format, wird aber nicht unterstützt
sv: Rätt format, men stöds inte

source: %q cannot be changed once mode is set to %q
de_de: %q und %q können nicht geändert werden, sobald der Modus auf %q gesetzt ist

source: Internal resource(s) in use
de_de: Interne Ressource(n) in Benutzung

source: No bootloader present
de_de: Kein Bootloader vorhanden

source: You pressed the BOOT button at start up.
de_de: Der BOOT-Knopf wurde beim Starten gedrückt.

source: bitmap size and depth must match
de_de: Bitmap-Größen und -Tiefe müssen übereinstimmen

source: unsupported bitmap depth
de_de: nicht unterstützte Bitmap-Tiefe

source: weights must be a sequence with an odd square number of elements (usually 9 or 25)
de_de: Gewichte müssen eine Sequenz mit einer ungeraden quadratischen Anzahl an Elementen sein (normalerweise 9 oder 25)

source: weights must be an object of type %q, %q, %q, or %q, not %q
de_de: Gewichte müssen ein Objekt des Typs %q, %q, %q, or %q, not %q sein

source: Ok
ru: Да

source: '%s' integer %d is not within range %d..%d
fil: '%s' integer %d ay wala sa sakop ng %d..%d
it_it: intero '%s' non è nell'intervallo %d..%d

source: '%s' integer 0x%x does not fit in mask 0x%x
fil: '%s' integer 0x%x ay wala sa mask na sakop ng 0x%x

source: '%s' object does not support item assignment
fil: '%s' object hindi sumusuporta ng item assignment

source: '%s' object does not support item deletion
fil: '%s' object ay hindi sumusuporta sa pagtanggal ng item

source: '%s' object is not an iterator
fil: '%s' object ay hindi iterator
it_it: l'oggetto '%s' non è un iteratore

source: '%s' object is not callable
fil: '%s' object hindi matatawag

source: '%s' object is not iterable
fil: '%s' object ay hindi ma i-iterable
it_it: l'oggetto '%s' non è iterabile

source: '%s' object is not subscriptable
fil: '%s' object ay hindi maaaring i-subscript

source: AP required
fil: AP kailangan
it_it: AP richiesto

source: Can't add services in Central mode
fil: Hindi maarang maglagay ng service sa Central mode

source: Can't advertise in Central mode
fil: Hindi ma advertise habang nasa Central mode

source: Can't change the name in Central mode
fil: Hindi mapalitan ang pangalan sa Central mode

source: Can't connect in Peripheral mode
fil: Hindi maconnect sa Peripheral mode

source: Cannot connect to AP
fil: Hindi maka connect sa AP
it_it: Impossible connettersi all'AP

source: Cannot disconnect from AP
fil: Hindi ma disconnect sa AP
it_it: Impossible disconnettersi all'AP

source: Cannot remount '/' when USB is active.
fil: Hindi ma-remount '/' kapag aktibo ang USB.
it_it: Non è possibile rimontare '/' mentre l'USB è attiva.

source: Cannot set STA config
fil: Hindi ma-set ang STA Config
it_it: Impossibile impostare la configurazione della STA

source: Cannot unambiguously get sizeof scalar
fil: Hindi puedeng hindi sigurado ang get sizeof scalar
it_it: Impossibile ricavare la grandezza scalare di sizeof inequivocabilmente

source: Cannot update i/f status
fil: Hindi ma-update i/f status
it_it: Impossibile aggiornare status di i/f

source: Crash into the HardFault_Handler.
fil: Nagcrash sa HardFault_Handler.

source: Don't know how to pass object to native function
fil: Hindi alam ipasa ang object sa native function
it_it: Non so come passare l'oggetto alla funzione nativa

source: ESP8226 does not support safe mode.
fil: Walang safemode support ang ESP8266.
it_it: ESP8266 non supporta la modalità sicura.

source: ESP8266 does not support pull down.
fil: Walang pull down support ang ESP8266.
it_it: ESP8266 non supporta pull-down

source: Error in ffi_prep_cif
fil: Pagkakamali sa ffi_prep_cif
it_it: Errore in ffi_prep_cif

source: Function requires lock.
fil: Kailangan ng lock ang function.

source: GPIO16 does not support pull up.
fil: Walang pull down support ang GPI016.
it_it: GPIO16 non supporta pull-up

source: Group full
fil: Puno ang group
it_it: Gruppo pieno

source: I2C operation not supported
fil: Hindi supportado ang operasyong I2C
it_it: operazione I2C non supportata

source: Invalid bit clock pin
fil: Mali ang bit clock pin
it_it: Pin del clock di bit non valido

source: Invalid clock pin
fil: Mali ang clock pin
it_it: Pin di clock non valido

source: Invalid data pin
fil: Mali ang data pin
it_it: Pin dati non valido

source: Length must be an int
fil: Haba ay dapat int
it_it: Length deve essere un intero

source: Length must be non-negative
fil: Haba ay dapat hindi negatibo
it_it: Length deve essere non negativo

source: Looks like our core CircuitPython code crashed hard. Whoops! Please file an issue at https://github.com/adafruit/circuitpython/issues with the contents of your CIRCUITPY drive and this message:
fil: Mukhang ang core CircuitPython code nag crash. Ay! Maaring mag file ng issue sa https://github.com/adafruit/circuitpython/issues kasama ng laman ng iyong CIRCUITPY drive at ang message na ito:

source: Maximum PWM frequency is %dhz.
fil: Pinakamataas na PWM frequency ay %dhz.
it_it: Frequenza massima su PWM è %dhz

source: MicroPython NLR jump failed. Likely memory corruption.
fil: CircuitPython NLR jump nabigo. Maaring memory corruption.

source: MicroPython fatal error.
fil: CircuitPython fatal na pagkakamali.

source: Minimum PWM frequency is 1hz.
fil: Pinakamababang PWM frequency ay 1hz.
it_it: Frequenza minima su PWM è 1hz

source: Multiple PWM frequencies not supported. PWM already set to %dhz.
fil: Hindi sinusuportahan ang maraming mga PWM frequency. PWM na naka-set sa %dhz.
it_it: Frequenze PWM multiple non supportate. PWM già impostato a %shz.

source: No PulseIn support for %q
fil: Walang PulseIn support sa %q
it_it: Nessun supporto per PulseIn per %q

source: No default I2C bus
fil: Walang default na I2C bus
it_it: Nessun bus I2C predefinito

source: No default SPI bus
fil: Walang default SPI bus
it_it: Nessun bus SPI predefinito

source: No default UART bus
fil: Walang default UART bus
it_it: Nessun bus UART predefinito

source: No hardware support for analog out.
fil: Hindi supportado ng hardware ang analog out.
it_it: Nessun supporto hardware per l'uscita analogica.
