Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: Already have all-matches listener
de_de: All-Matchers-Listener bereits vorhanden
es: Ya se tiene un escucha de todas las coincidencias
fr: Il y a déjà un auditeur all-matches
nl: Heeft al een luisteraar voor 'all-matches'
pt_br: Já há um ouvinte com todas as correspondências
ru: Уже есть универсальный слушатель
sv: Har redan lyssnare för all-matchningar

source: Already running
de_de: Läuft bereits
es: Ya está en ejecución
fr: Déjà en cours d'exécution
nl: Wordt al uitgevoerd
pt_br: Já está em execução
ru: Уже запущен
sv: Kör redan

source: Already scanning for wifi networks
de_de: Sucht bereits nach Wifi-Netzwerken
es: Ya se están buscando redes wifi
fr: Déjà à la recherche des réseaux wifi
nl: Zoekt al naar WiFi netwerken
pt_br: Já está em busca das redes de wifi
ru: Поиск сетей wifi уже происходит
sv: Skannar redan efter WiFi-nätverk

source: AnalogIn not supported on given pin
es: El pin proporcionado no soporta AnalogIn
nl: AnalogIn niet ondersteund door gegeven pin

source: AnalogOut functionality not supported
es: Funcionalidad AnalogOut no soportada
fil: Hindi supportado ang AnalogOut
it_it: funzionalità AnalogOut non supportata
nl: AnalogOut functionaliteit niet ondersteund

source: AnalogOut is only 16 bits. Value must be less than 65536.
es: AnalogOut es solo de 16 bits. El valor debe ser menor que 65536.
fil: AnalogOut ay 16 bits. Value ay dapat hindi hihigit pa sa 65536.
it_it: AnalogOut ha solo 16 bit. Il valore deve essere meno di 65536.
nl: AnalogOut is slechts 16 bits. Waarde moet minder dan 65536 zijn.

source: AnalogOut not supported on given pin
es: El pin proporcionado no soporta AnalogOut
fil: Hindi supportado ang AnalogOut sa ibinigay na pin
it_it: AnalogOut non supportato sul pin scelto
nl: AnalogOut niet ondersteund door gegeven pin

source: Another PWMAudioOut is already active
de_de: Ein anderer PWMAudioOut ist bereits aktiv
es: Otra salida PWMAudioOut esta ya activada
fr: Un autre PWMAudioOut est déjà actif
pt_br: Um outro PWMAudioOut já está ativo
ru: Другой аудиовыход PWM уже активен
sv: En annan PWMAudioOut är redan aktiv

source: Another send is already active
de_de: Ein anderer Sendevorgang ist schon aktiv
es: Otro envío ya está activo
fil: Isa pang send ay aktibo na
fr: Un autre envoi est déjà actif
nl: Een andere send is al actief
pt_br: Outro envio já está ativo
ru: Другая передача уже активна
sv: En annan send är redan aktiv

source: Array must contain halfwords (type 'H')
de_de: Array muss Halbwörter enthalten (type 'H')
es: El array debe contener medias palabras (escriba 'H')
fil: May halfwords (type 'H') dapat ang array
fr: L'array doit contenir des demi-mots (type 'H')
nl: Array moet halfwords (type 'H') bevatten
pt_br: Array deve conter meias palavras (tipo 'H')
ru: Массив должен содержать полуслова (тип 'H')
sv: Matrisen måste innehålla halfwords (typ "H")

source: Array values should be single bytes.
de_de: Array-Werte sollten aus Einzelbytes bestehen.
es: Valores del array deben ser bytes individuales.
fil: Array values ay dapat single bytes.
fr: Les valeurs de l'array doivent être des octets singuliers.
nl: Array waardes moet enkele bytes zijn.
pt_br: Os valores das matrizes devem ser bytes simples.
ru: Значения массива должны быть однобайтовыми.
sv: Matrisvärden ska bestå av enstaka bytes.

source: At most %d %q may be specified (not %d)
es: Como máximo %d %q se puede especificar (no %d)
nl: Op zijn meest %d %q mogen worden gespecificeerd (niet %d)

source: Attempt to allocate %d blocks
de_de: Versuche %d Blöcke zu allokieren
es: Tratando de localizar %d bloques
fr: Tentative d'allocation de %d blocs
nl: Poging om %d blokken toe te wijzen
pt_br: Tentativa de alocar %d blocos
ru: Попытка выделения %d блоков
sv: Försök att tilldela %d block

source: Attempted heap allocation when VM not running.
es: Asignación del montículo mientras la VM no esta ejecutándose.

source: AuthMode.OPEN is not used with password
de_de: AuthMode.OPEN wird mit Passwort nicht verwendet
es: AuthMode.OPEN no se usa con contraseña
fr: AuthMode.OPEN n'est pas utilisé avec un mot de passe
pt_br: O AuthMode.OPEN não é usado com senha
ru: Режим авторизации.OPEN не используется с паролем
sv: AuthMode.OPEN används inte med lösenord

source: Authentication failure
de_de: Authentifizierungsfehler
es: Fallo de autenticación
fr: Échec d'authentification
nl: Authenticatiefout
pt_br: Houve um falha na autenticação
ru: Ошибка аутентификации
sv: Autentiseringsfel

source: Auto-reload is off.
de_de: Automatisches Neuladen ist deaktiviert.
es: Auto-recarga deshabilitada.
fil: Awtomatikong pag re-reload ay OFF.
fr: L'auto-chargement est désactivé.
it_it: Auto-reload disattivato.
nl: Auto-herlaad staat uit.
pt_br: A atualização automática está desligada.
ru: Автоматическая перезагрузка отключена.
sv: Autoladdning är avstängd.

source: Auto-reload is on. Simply save files over USB to run them or enter REPL to disable.
de_de: Automatisches Neuladen ist aktiviert. Speichere Dateien einfach über USB, um sie auszuführen, oder gib REPL ein, um sie zu deaktivieren.
es: Auto-reload habilitado. Simplemente guarda los archivos via USB para ejecutarlos o entra al REPL para desabilitarlos.
fil: Ang awtomatikong pag re-reload ay ON. i-save lamang ang mga files sa USB para patakbuhin sila o pasukin ang REPL para i-disable ito.
fr: Auto-chargement activé. Copiez ou sauvegardez les fichiers via USB pour les lancer ou démarrez le REPL pour le désactiver.
it_it: L'auto-reload è attivo. Salva i file su USB per eseguirli o entra nel REPL per disabilitarlo.
nl: Auto-herlaad staat aan. Sla bestanden simpelweg op over USB om uit te voeren of start REPL om uit te schakelen.
pt_br: O recarregamento automático está ativo. Simplesmente salve os arquivos via USB para executá-los ou digite REPL para desativar.
ru: Автоматическая перезагрузка включена. Просто сохрани файл по USB или зайди в REPL чтобы отключить.
sv: Autoladdning är på. Spara filer via USB för att köra dem eller ange REPL för att inaktivera.

source: Baudrate not supported by peripheral
de_de: Baudrate wird von der Peripherie nicht unterstützt
es: El periférico no maneja el Baudrate
fr: Baudrate non supporté par le périphérique
nl: Baudrate wordt niet ondersteund door randapparatuur
pt_br: O Baudrate não é suportado pelo periférico
ru: Скорость передачи данных не поддерживается периферийным устройством
sv: Baudrate stöds inte av kringutrustning

source: Below minimum frame rate
de_de: Unterhalb der minimalen Frame Rate
es: Por debajo de la tasa mínima de refrescamiento
fr: Au-dessous de la fréquence d'images minimale
nl: Onder de minimum frame rate
pt_br: Abaixo da taxa mínima de quadros
ru: Ниже минимальной частоты кадров
sv: Under minsta bildfrekvens

source: Bit clock and word select must be sequential pins
es: Le reloj de bit y de selector de palabra deben ser pines secuenciales

source: Bit clock and word select must share a clock unit
es: Bit clock y word select deben compartir una unidad de reloj
fil: Ang bit clock at word select dapat makibahagi sa isang clock unit
it_it: Clock di bit e selezione parola devono condividere la stessa unità di clock
nl: Bit clock en word select moeten een clock eenheid delen
pt_br: O clock de bits e a seleção de palavras devem compartilhar uma unidade de clock

source: Bit depth must be from 1 to 6 inclusive, not %d
es: Bit depth tiene que ser de 1 a 6 inclusivo, no %d
nl: Bitdiepte moet tussen 1 en 6 liggen, niet %d

source: Bit depth must be multiple of 8.
es: Bits depth debe ser múltiplo de 8.
fil: Bit depth ay dapat multiple ng 8.
it_it: La profondità di bit deve essere multipla di 8.
nl: Bit diepte moet een meervoud van 8 zijn.
pt_br: A profundidade de bits deve ser o múltiplo de 8.

source: Both RX and TX required for flow control
de_de: Sowohl RX als auch TX sind zu Flusssteuerung erforderlich
es: Ambos RX y TX requeridos para control de flujo
fr: RX et TX requis pour le contrôle de flux
nl: RX en TX zijn beide vereist voor stroomregeling
pt_br: Ambos os RX e TX são necessários para o controle do fluxo
ru: Для управления потоком требуется как RX так и TX
sv: Både RX och TX krävs för handskakning

source: Both pins must support hardware interrupts
es: Ambos pines deben soportar interrupciones por hardware
fil: Ang parehong mga pin ay dapat na sumusuporta sa hardware interrupts
it_it: Entrambi i pin devono supportare gli interrupt hardware
nl: Beide pinnen moeten hardware interrupts ondersteunen
pt_br: Ambos os pinos devem suportar interrupções de hardware

source: Brightness must be 0-1.0
es: El brillo debe ser 0-1.0
nl: Helderheid moet tussen de 0 en 1.0 liggen

source: Brightness must be between 0 and 255
es: El brillo debe estar entro 0 y 255
fil: Ang liwanag ay dapat sa gitna ng 0 o 255
it_it: La luminosità deve essere compreso tra 0 e 255
nl: Helderheid moet tussen de 0 en 255 liggen

source: Brightness not adjustable
de_de: Die Helligkeit ist nicht einstellbar
es: El brillo no se puede ajustar
fr: Luminosité non-ajustable
nl: Helderheid is niet aanpasbaar
pt_br: Brilho não ajustável
ru: Яркость не регулируется
sv: Ljusstyrka kan inte justeras

source: Buffer + offset too small %d %d %d
de_de: Buffer + Offset zu klein %d %d %d
es: Búfer + compensado muy pequeños %d %d %d
fr: Tampon + décalage trop petit %d %d %d
nl: Buffer + offset te klein %d %d %d
pt_br: O buffer + desvio é muito pequeno %d %d %d
ru: Буфер + сдвиг слишком малы %d %d %d
sv: Buffert + offset för liten %d %d %d

source: Buffer elements must be 4 bytes long or less
de_de: Puffer-Elemente müssen 4 Bytes lang oder kürzer sein
es: Los elementos del búfer deben de ser de una longitud de 4 bytes o menos
fr: Les éléments du tampon doivent faire 4 octets ou moins
pt_br: Os elementos do buffer devem ter 4 bytes de comprimento ou menos
ru: Элементы буфера должны иметь длину не более 4 байт
sv: Buffertelement måste vara fyra byte långa eller mindre

source: Buffer incorrect size. Should be %d bytes.
es: Tamaño de buffer incorrecto. Debe ser de %d bytes.
fil: Mali ang size ng buffer. Dapat %d bytes.
it_it: Buffer di lunghezza non valida. Dovrebbe essere di %d bytes.
nl: Buffer heeft incorrect grootte. Moet %d bytes zijn.

source: Buffer is not a bytearray.
de_de: Der Buffer ist kein Byte-Array.
es: Buffer no es un bytearray.
fr: Le tampon n'est pas un 'bytearray'.
nl: Buffer is geen bytearray.
pt_br: O buffer não é um bytearray.
ru: Буфер не является байтовым массивом.
sv: Buffert är inte en bytearray.

source: Buffer is too small
es: El buffer es muy pequeño
nl: Buffer is te klein

source: Buffer length %d too big. It must be less than %d
de_de: Die Pufferlänge %d ist zu groß. Sie muss kleiner als %d sein
es: Longitud del buffer %d es demasiado grande. Tiene que ser menor a %d
fr: La longueur du tampon %d est trop grande. Il doit être inférieur à %d
nl: Buffer lengte %d te groot. Het moet kleiner zijn dan %d
pt_br: O tamanho do buffer %d é muito grande. Deve ser menor que %d
ru: Размер буфера %d слишком большой. Он должен быть меньше чем %d
sv: Buffertlängd %d för stor. Den måste vara mindre än %d

source: Buffer length must be a multiple of 512
de_de: Die Pufferlänge muss ein vielfaches von 512 sein
es: El tamaño del búfer debe ser múltiplo de 512
fr: La longueur de la mémoire tampon doit être un multiple de 512
nl: Buffer lengte moet een veelvoud van 512 zijn
pt_br: O comprimento do Buffer deve ser um múltiplo de 512
ru: Размер буфера должен быть кратен 512
sv: Buffertlängd måste vara en multipel av 512

source: Buffer must be a multiple of 512 bytes
de_de: Der Puffer muss ein vielfaches von 512 bytes sein
es: Búfer deber ser un múltiplo de 512 bytes
fr: La mémoire tampon doit être un multiple de 512
nl: Buffer moet een veelvoud van 512 bytes zijn
pt_br: O buffer deve ser um múltiplo de 512 bytes
ru: Буфер должен быть кратен 512
sv: Bufferten måste vara en multipel av 512 byte

source: Buffer must be at least length 1
es: Buffer debe ser de longitud 1 como minimo
fil: Buffer dapat ay hindi baba sa 1 na haba
it_it: Il buffer deve essere lungo almeno 1
nl: Buffer moet op zijn minst lengte 1 zijn

source: Buffer too short by %d bytes
de_de: Puffer um %d Bytes zu kurz
es: Búffer muy corto por %d bytes
fr: Tampon trop court de %d octets
nl: Buffer is %d bytes te klein
pt_br: O buffer é muito curto em %d bytes
ru: Буфер слишком короткий на %d байт
sv: Buffert är %d bytes för kort

source: Bus pin %d is already in use
de_de: Bus-Pin %d wird schon benutzt
es: Bus pin %d ya está siendo utilizado
fr: La broche %d du bus est déjà utilisée
nl: Bus pin %d al in gebruik
pt_br: O pino bus %d já está em uso
ru: Вывод шины %d уже используется
sv: Busspinne %d används redan

source: Byte buffer must be 16 bytes.
de_de: Der Puffer muss 16 Bytes lang sein.
es: Búfer Byte debe de ser 16 bytes.
fr: Le tampon doit être de 16 octets.
nl: Byte buffer moet 16 bytes zijn.
pt_br: O buffer deve ter 16 bytes.
ru: Буфер байтов должен быть размером 16 байтам.
sv: Byte-buffert måste vara 16 byte.

source: Bytes must be between 0 and 255.
es: Bytes debe estar entre 0 y 255.
fil: Sa gitna ng 0 o 255 dapat ang bytes.
it_it: I byte devono essere compresi tra 0 e 255
nl: Bytes moeten tussen 0 en 255 liggen.

source: CBC blocks must be multiples of 16 bytes
de_de: CBC-Blöcke müssen ein Vielfaches von 16 Bytes sein
es: Los bloques CBC deben ser múltiplos de 16 bytes
fr: Les blocs CBC doivent être des multiples de 16 octets
nl: CBC blocks moeten meervouden van 16 bytes zijn
pt_br: Os blocos CBC devem ter múltiplos de 16 bytes
ru: Блоки CBC должны быть кратны 16 байтам
sv: CBC-block måste vara multiplar om 16 byte

source: CRC or checksum was invalid
de_de: CRC oder Checksumme ungültig
es: CRC o suma de comprobación inválida
fr: CRC ou somme de contrôle invalide
pt_br: CRC ou checksum inválido
ru: CRC или контрольная сумма неправильная
sv: CRC eller checksumma var ogiltig

source: Call super().__init__() before accessing native object.
de_de: Rufe super().__init__() vor dem Zugriff auf ein natives Objekt auf.
es: Llame a super().__ init __() antes de acceder al objeto nativo.
fr: Appelez super().__init__() avant d'accéder à l'objet natif.
nl: Roep super().__init__() aan voor toegang native object.
pt_br: Chame super().__init__() antes de acessar o objeto nativo.
ru: Вызовите super().__init__() перед доступом к собственному объекту.
sv: Anropa super().__init__() innan du använder det ursprungliga objektet.

source: Can only alarm on RTC IO from deep sleep.
de_de: Alarm der RTC IO kann nur im deep sleep ausgeführt werden.
es: Solo puede alertar en RTC IO de deep sleep.
fr: L'alarme ne peut être que sur TRC IO depuis un sommeil profond.
pt_br: O alarme só pode acontecer no RTC IO a partir do deep sleep.
ru: Возможен только сигнал тревоги по RTC IO из глубокого сна.
sv: Kan bara larma på RTC-IO från djupsömn.

source: Can only alarm on one low pin while others alarm high from deep sleep.
de_de: Kann nur auf einem Pin Alarm als low auslösen, während anderen aus Deep Sleep dem Alarm auf high setzen.
es: Solo puede alertar en un pin low mientras los otros alertan en high viniendo de deep sleep.
fr: L'alarme peut seulement être sur une broche basse tandis que d'autres alarment sont sur des broches hautes depuis le sommeil profond.
pt_br: O alarme só pode acontecer em um pino com nível baixo enquanto os outros alarmes só com nível alto a partir do deep sleep.
ru: Может сигнализировать только по одному низкому контакту в то время как другие сигнализируют о высоком уровне после глубокого сна.
sv: Kan bara larma från djup sömn på låg för en pinne medan andra larmar på hög.

source: Can only alarm on two low pins from deep sleep.
de_de: Kann nur auf zwei Pins Alarm als low aus Deep Sleep auslösen.
es: Solo puede alerta en dos low pines viniendo de deep sleep.
fr: L'alarme peut seulement être sur deux broches basses depuis le sommeil profond.
pt_br: O alarme só é possível nos dois pinos com sinal baixo a partir do deep sleep.
ru: Из глубокого сна может сигнализировать только по двум низким контактам.
sv: Kan bara larma från djup sömn på två låga pinnar.

source: Can't set CCCD on local Characteristic
de_de: CCCD kann nicht auf lokales Merkmal eingestellt werden
es: No se puede configurar CCCD en la característica local
fr: Impossible de définir CCCD sur une caractéristique locale
nl: Kan CCCD niet toewijzen aan lokaal Characteristic
pt_br: Não é possível definir o CCCD com a característica local
ru: Невозможно установить CCCD для локальной характеристики
sv: Kan inte ställa in CCCD på lokal karaktäristik

source: Cannot change USB devices now
de_de: Kann USB-Geräte jetzt nicht ändern
es: No se pueden cambiar dispositivos USB en este momento
fr: Impossible de changer de périphérique USB maintenant
pt_br: Agora não é possível alternar os dispositivos USB
ru: Невозможно изменить USB устройство сейчас
sv: Kan inte ändra USB-enheter nu

source: Cannot create a new Adapter; use _bleio.adapter;
de_de: Kann keinen neuen Adapter erstellen; benutze _bleio.adapter;
es: No se puede crear nuevo Adapter; use _bleio.adapter;
fr: Un nouveau Adapter ne peut être créé ; Adapter; utilisez _bleio.adapter;
nl: Kan geen nieuwe Adapter creëren; gebruik _bleio.adapter;
pt_br: Não é possível criar um novo Adaptador; utilize _bleio.adapter;
ru: Невозможно создать новый Adapter; используйте _bleio.adapter;
sv: Det går inte att skapa en ny Adapter; använd _bleio.adapter;

source: Cannot delete values
de_de: Kann Werte nicht löschen
es: No se puede eliminar valores
fil: Hindi mabura ang values
fr: Impossible de supprimer les valeurs
it_it: Impossibile cancellare valori
nl: Kan waardes niet verwijderen
pt_br: Não é possível excluir valores
ru: Невозможно удалить значения
sv: Kan inte radera värden

source: Cannot get pull while in output mode
de_de: Pull up im Ausgabemodus nicht möglich
es: No puede ser pull mientras este en modo de salida
fil: Hindi makakakuha ng pull habang nasa output mode
fr: Ne peut être tiré ('pull') en mode sortie ('output')
nl: get pull kan niet gedurende output mode
pt_br: Não é possível obter (pull) enquanto estiver no modo saída
ru: Невозможно получить pull в режиме вывода
sv: Kan inte ange pull i output-läge

source: Cannot get temperature
de_de: Kann Temperatur nicht holen
es: No se puede obtener la temperatura
fr: Impossible de lire la température
nl: Kan de temperatuur niet verkrijgen
pt_br: Não é possível obter a temperatura
ru: Невозможно получить температуру
sv: Kan inte hämta temperatur

source: Cannot have scan responses for extended, connectable advertisements.
de_de: Es können keine Scanantworten für erweiterte, verbindbare Anzeigen vorliegen.
es: No se pueden obtener respuestas de exploración para anuncios extendidos y conectables.
fr: Impossible d'avoir des réponses d'analyse pour les publicités étendues et connectables.
nl: Kan geen scan responses voor extended, connectable advertisements hebben.
pt_br: Não é possível ter respostas da verificação para os anúncios estendidos e conectáveis.
ru: Не может быть ответов на сканирование для расширенных подключаемых рекламных объявлений.
sv: Det går inte att ha skanningssvar för utökade, anslutningsbara aviseringar.

source: Cannot output both channels on the same pin
es: No se puede tener ambos canales en el mismo pin
fil: Hindi maaaring output ang mga parehong channel sa parehong pin
it_it: Impossibile dare in output entrambi i canal sullo stesso pin
nl: Output van beide kanalen kan niet op dezelfde pin

source: Cannot pull on input-only pin.
de_de: Kann nicht 'pull' an einem 'input-only' pin.
es: No puede hacer pull en un pin de entrada sola.
fr: Ne peut tirer ('pull') sur une broche d'entrée ('input') seule.
pt_br: Não é possível obter (pull) nos pinos somente de entrada.
ru: Невозможно вытащить контакт только для ввода.
sv: Kan bara använda pull på pinne för input.

source: Cannot read without MISO pin.
es: No se puede leer sin pin MISO.
fil: Hindi maaring mabasa kapag walang MISO pin.
it_it: Impossibile leggere senza pin MISO.
nl: Kan niet lezen zonder MISO pin.

source: Cannot record to a file
de_de: Aufnahme in eine Datei nicht möglich
es: No se puede grabar en un archivo
fil: Hindi ma-record sa isang file
fr: Impossible d'enregistrer vers un fichier
it_it: Impossibile registrare in un file
nl: Kan niet opnemen naar een bestand
pt_br: Não é possível gravar em um arquivo
ru: Невозможно записать в файл
sv: Det går inte att spela in till en fil

source: Cannot remount '/' when visible via USB.
de_de: '/' kann nicht wiedereingehängt werden, wenn per USB sichtbar.
es: No se puede remountar '/' cuanto se es visible vía USB.
fr: Ne peut démonter '/' quand est visible par USB.
pt_br: Não é possível montar '/' quando estiver visível pelo USB.
ru: Невозможно перемонтировать '/' пока он виден через USB.
sv: Det går inte att montera om '/' när den är synlig via USB.

source: Cannot reset into bootloader because no bootloader is present.
es: No se puede reiniciar a bootloader porque no hay bootloader presente.
fil: Hindi ma-reset sa bootloader dahil walang bootloader.
it_it: Impossibile resettare nel bootloader poiché nessun bootloader è presente.
nl: Kan niet resetten naar bootloader omdat er geen bootloader aanwezig is.

source: Cannot set socket options
es: No se pueden definir opciones para enchufe
fr: Ne peut définir les options de socket
pt_br: Não foi possível definir as opções do socket

source: Cannot set value when direction is input.
de_de: Der Wert kann nicht gesetzt werden, wenn die Richtung input ist.
es: No se puede asignar un valor cuando la dirección es input.
fil: Hindi ma i-set ang value kapag ang direksyon ay input.
fr: Impossible d'affecter une valeur quand la direction est entrante ('input').
nl: Kan de waarde niet toewijzen als de richting input is.
pt_br: Não é possível definir o valor quando a direção é inserida.
ru: Невозможно установить значение при вводе направления.
sv: Kan inte sätta värde när riktning är input.

source: Cannot specify RTS or CTS in RS485 mode
de_de: RTS oder CTS können im RS485-Modus nicht angegeben werden
es: No se puede especificar RTS o CTS en modo RS485
fr: Impossible de spécifier RTS ou CTS en mode RS485
nl: Kan RTS of CTS niet specificeren in RS485 modus
pt_br: Não é possível definir o RTS ou CTS no modo RS485
ru: Невозможно указать RTS или CTS в режиме RS485
sv: Det går inte att specificera RTS eller CTS i RS485-läget

source: Cannot subclass slice
de_de: Slice kann keine sub-klasse sein
es: No se puede manejar la partición en una subclase
fil: Hindi magawa ang sublcass slice
fr: On ne peut faire de sous-classes de tranches
it_it: Impossibile subclasare slice
nl: Kan slice niet subclasseren
pt_br: Não é possível subclassificar a fatia
ru: Невозможно создать подкласс среза
sv: Det går inte att subklassa slice

source: Cannot transfer without MOSI and MISO pins.
es: No se puede transmitir sin pines MOSI y MISO.
fil: Hindi maaaring ilipat kapag walang MOSI at MISO pin.
it_it: Impossibile trasferire senza i pin MOSI e MISO.
nl: Kan niet overdragen zonder MOSI en MISO pinnen.

source: Cannot vary frequency on a timer that is already in use
es: No puede variar la frecuencia en un temporizador que ya está en uso
nl: Kan de frequentie van een timer die al in gebruik is niet variëren
pt_br: Não é possível variar a frequência em um timer que já esteja em uso

source: Cannot wake on pin edge. Only level.
de_de: Kann nicht auf Flanke wecken, nur auf Level.
es: No puede despertar en pin edge, solo en nivel.
fr: Impossible de réveiller via une bordure d'une broche. Seulement via un niveau.
pt_br: Não é possível acordar (wake) no pino edge. Nível apenas.
ru: Невозможно проснуться по спаду росту на пине. Только по уровню.
sv: Kan inte vakna på nivåskift, enbart nivå.
