Repository: micropython/micropython
Catalog: locale/*.po
Languages: de_de, es, fil, fr, it_it, nl, pt_br, ru, sv

source: maxiter should be > 0
de_de: maxiter sollte > 0 sein
es: maxiter debe ser > 0
fr: maxiter devrait être > 0
nl: maxiter moet groter dan 0 zijn
pt_br: maxiter pode ser > 0
ru: макситер должен быть > 0
sv: maxiter bör vara > 0

source: median argument must be an ndarray
de_de: Median-Argument muss ein ndarray sein
es: argumento median debe ser una matriz ndarray
fr: le paramètre pour median doit être un ndarray
pt_br: o argumento mediano deve ser um ndarray
ru: Средний аргумент должен быть массивом ndarray
sv: argumentet median måste vara en ndarray

source: memory allocation failed, allocating %u bytes
de_de: Speicherzuordnung fehlgeschlagen, Zuweisung von %u Bytes
es: la asignación de memoria falló, asignando %u bytes
fil: nabigo ang paglalaan ng memorya, paglalaan ng %u bytes
fr: l'allocation de mémoire a échoué en allouant %u octets
it_it: allocazione di memoria fallita, allocando %u byte
nl: geheugentoewijzing mislukt, %u bytes worden toegewezen
pt_br: falha na alocação de memória, alocando %u bytes
ru: Сбой выделения памяти, выделение %u байт
sv: minnesallokering misslyckades, allokerar %u byte

source: memory allocation failed, heap is locked
de_de: Speicherzuweisung fehlgeschlagen, der Heap ist gesperrt
es: la asignación de memoria falló, el heap está bloqueado
fil: abigo ang paglalaan ng memorya, ang heap ay naka-lock
fr: l'allocation de mémoire a échoué, le tas est vérrouillé
it_it: allocazione di memoria fallita, l'heap è bloccato
nl: geheugentoewijzing mislukt, heap is vergrendeld
pt_br: falha na alocação de memória, a área de alocação dinâmica de variáveis (heap) está bloqueada
ru: Не удалось выделить память, куча заблокирована
sv: minnesallokeringen misslyckades, heapen är låst

source: memoryview: length is not a multiple of itemsize
de_de: memoryview: length ist kein Vielfaches von itemize
es: memoryview: la longitud no es un múltiplo del tamaño del elemento (itemsize)
fr: memoryview: length n'est pas un multiple de itemsize
pt_br: memoryview: o comprimento não é um múltiplo do tamanho dos itens
ru: вид памяти: длина не является множеством элементов
sv: memoryview: längden är inte en multipel av itemsize

source: module not found
de_de: Modul nicht gefunden
es: módulo no encontrado
fil: module hindi nakita
fr: module introuvable
it_it: modulo non trovato
nl: module niet gevonden
pt_br: o módulo não foi encontrado
ru: модуль не найден
sv: modulen hittades inte

source: more degrees of freedom than data points
de_de: mehr Freiheitsgrade als Datenpunkte
es: más grados de libertad que los puntos de datos
fr: plus de degrés de liberté que de points de données
nl: meer vrijheidsgraden dan datapunten
pt_br: mais graus de liberdade do que pontos de dados
ru: Больше степеней свободы чем точек данных
sv: fler frihetsgrader än datapunkter

source: multiple *x in assignment
de_de: mehrere *x in Zuordnung
es: múltiples *x en la asignación
fil: maramihang *x sa assignment
fr: *x multiple dans l'assignement
it_it: *x multipli nell'assegnamento
nl: meerdere *x in toewijzing
pt_br: múltiplo *x na atribuição
ru: Несколько *x в назначении
sv: flera *x i tilldelning

source: multiple bases have instance lay-out conflict
de_de: Mehrere Basen haben einen Instanzlayoutkonflikt
es: multiple bases tienen una instancia conel conflicto diseño
fil: maraming bases ay may instance lay-out conflict
fr: de multiples bases ont un conflit de lay-out d'instance
nl: meerdere grondtallen (bases) hebben instance lay-out conflicten
pt_br: várias bases possuem instâncias de layout com conflitos
ru: Несколько баз имеют конфликт расположения экземпляров
sv: Multipla basklasser har instanslayoutkonflikt

source: multiple inheritance not supported
de_de: Mehrfache Vererbung nicht unterstützt
es: herencia multiple no soportada
fil: maraming inhertance hindi sinusuportahan
fr: héritages multiples non supportés
it_it: ereditarietà multipla non supportata
nl: meervoudige overerving niet ondersteund
pt_br: herança múltipla não suportada
ru: Множественное наследование не поддерживается
sv: multipelt arv stöds inte

source: must raise an object
de_de: muss ein Objekt aufwerfen (raise)
es: debe hacer un raise de un objeto
fil: dapat itaas ang isang object
fr: doit lever un objet
it_it: deve lanciare un oggetto
nl: moet een object oproepen (raise)
pt_br: deve levantar um objeto
ru: должен поднять объект
sv: måste ge ett objekt

source: must use keyword argument for key function
de_de: muss Schlüsselwortargument für key function verwenden
es: debe utilizar argumento de palabra clave para la función clave
fil: dapat gumamit ng keyword argument para sa key function
fr: doit utiliser un argument nommé pour une fonction key
nl: voor sleutelfunctie moet een trefwoordargument gebruikt worden
pt_br: deve usar o argumento da palavra-chave para a função da chave
ru: Необходимо использовать аргумент ключевого слова для ключевой функции
sv: måste använda nyckelordsargument för nyckelfunktion

source: name '%q' is not defined
de_de: Name '%q' ist nirgends definiert worden (Schreibweise kontrollieren)
es: name '%q' no esta definido
fil: name '%q' ay hindi defined
fr: nom '%q' non défini
it_it: nome '%q'non definito
nl: naam '%q' is niet gedefinieerd
pt_br: o nome '%q' não está definido
ru: Имя '%q' не определено
sv: namnet '%q' är inte definierat

source: name not defined
de_de: Dieser Name ist nirgends definiert worden (Schreibweise kontrollieren)
es: name no definido
fil: name hindi na define
fr: nom non défini
it_it: nome non definito
nl: naam is niet gedefinieerd
pt_br: nome não definido
ru: Имя не определено
sv: namn inte definierat

source: native method too big
de_de: native Methode zu groß
es: método nativo muy grande
fr: la méthode native est trop longue
pt_br: o método nativo é grande demais
ru: родной метод слишком большой
sv: inbyggd metod för stor

source: native yield
de_de: natives yield
es: yield nativo
fr: 'yield' natif
it_it: yield nativo
nl: natuurlijke opbrengst (native yield)
pt_br: rendimento nativo
ru: родной урожай

source: need more than %d values to unpack
de_de: Zum Entpacken sind mehr als %d Werte erforderlich
es: necesita más de %d valores para descomprimir
fil: kailangan ng higit sa %d na halaga upang i-unpack
fr: nécessite plus de %d valeurs à dégrouper
it_it: necessari più di %d valori da scompattare
nl: Om uit te pakken zijn meer dan %d waarden vereist
pt_br: precisa de mais de %d valores para desempacotar
ru: Для распаковки требуется более значений %d
sv: behöver mer än %d värden för att packa upp

source: negative factorial
de_de: negative Fakultät
es: factorial negativo
fr: factoriel négatif
pt_br: fatorial negativo
ru: отрицательный факториал
sv: negativ faktoriell

source: negative power with no float support
de_de: negative Potenz ohne Gleitkomma(float)-Unterstützung
es: potencia negativa sin float support
fil: negatibong power na walang float support
fr: puissance négative sans support des nombres à virgule flottante
it_it: potenza negativa senza supporto per float
nl: negatieve macht terwijl er geen ondersteuning is voor float
pt_br: potência negativa sem suporte de flutuação
ru: Отрицательная мощность без поплавковой опоры
sv: negativ exponent utan stöd för flyttal

source: negative shift count
de_de: Negative Anzahl an Verschiebungen
es: cuenta de corrimientos negativo
fr: compte de décalage négatif
nl: negatieve verschuivingstelling (shift count)
pt_br: contagem de turnos negativos
ru: Количество отрицательных сдвигов
sv: negativt skiftantal

source: no SD card
de_de: keine SD-Karte
es: no hay tarjeta SD
fr: pas de carte SD
nl: geen SD kaart
pt_br: nenhum cartão SD
ru: нет SD карты
sv: inget SD-kort

source: no active exception to reraise
de_de: Keine aktive Ausnahme zum Wiederaufwerfen (reraise)
es: exception no activa para reraise
fil: walang aktibong exception para i-reraise
fr: aucune exception active à relever
it_it: nessuna eccezione attiva da rilanciare
nl: geen actieve uitzondering om opnieuw op te werpen (raise)
pt_br: nenhuma exceção ativa para reraise
ru: Нет активного исключения для повторного создания
sv: ingen aktiv exception för reraise

source: no available NIC
es: NIC no disponible
fil: walang magagamit na NIC
nl: geen netwerkadapter (NIC) beschikbaar

source: no binding for nonlocal found
de_de: Keine Bindung für nichtlokale Variable gefunden
es: no se ha encontrado ningún enlace para nonlocal
fil: no binding para sa nonlocal, nahanap
fr: pas de lien trouvé pour nonlocal
it_it: nessun binding per nonlocal trovato
nl: geen binding voor nonlocal gevonden
pt_br: nenhuma ligação para nonlocal foi encontrada
ru: Привязка для нелокальных не найдена
sv: ingen bindning för ickelokal hittad

source: no default packer
de_de: kein Standard-Packer
es: no hay empaquetador por defecto
fr: aucun emballeur par défault
pt_br: nenhum empacotador padrão
ru: Нет упаковщика по умолчанию
sv: ingen standardpackare

source: no default seed
de_de: kein Standard-Seed
es: sin semilla por omisión
fr: aucun seed par défaut
pt_br: nenhuma semente padrão
ru: Нет начального числа по умолчанию
sv: inget standard seed

source: no module named '%q'
de_de: Kein Modul mit dem Namen '%q'
es: ningún módulo se llama '%q'
fil: walang module na '%q'
fr: pas de module '%q'
it_it: nessun modulo chiamato '%q'
nl: geen module met naam '%q'
pt_br: nenhum módulo chamado '%q'
ru: Нет модуля с именем '%Q'
sv: ingen modul med namnet '%q'

source: no reset pin available
es: no hay pin de reinicio disponible
nl: geen reset pin beschikbaar

source: no response from SD card
de_de: keine Antwort von der SD-Karte
es: no hay respuesta de la tarjeta SD
fr: pas de réponse de la carte SD
nl: geen antwoord van SD kaart
pt_br: não houve resposta do cartão SD
ru: нет ответа с SD карты
sv: inget svar från SD-kort

source: no such attribute
de_de: kein solches Attribut
es: no hay tal atributo
fil: walang ganoon na attribute
fr: pas de tel attribut
it_it: attributo inesistente
nl: niet zo'n attribuut
pt_br: não há tal atributo
ru: нет такого атрибута
sv: inget sådant attribut

source: non-Device in %q
es: hay un no-Device en %q

source: non-UUID found in service_uuids_whitelist
de_de: Nicht-UUID in service_uuids_whitelist gefunden
es: no UUID encontrado en service_uuids_whitelist
fr: non UUID trouvé dans service_uuids_whitelist
nl: niet-UUID gevonden in service_uuids_whitelist
pt_br: um não UUID foi encontrado na lista service_uuids_whitelist
ru: не-UUID найден в сервисе_uuids_белый список
sv: icke-UUID hittades i service_uuids_whitelist

source: non-default argument follows default argument
de_de: ein non-default argument folgt auf ein default argument
es: argumento no predeterminado sigue argumento predeterminado
fil: non-default argument sumusunod sa default argument
fr: un argument sans valeur par défaut suit un argument avec valeur par défaut
it_it: argomento non predefinito segue argmoento predfinito
nl: niet-standaard argument volgt op een standaard argument
pt_br: o argumento não predefinido segue o argumento predefinido
ru: Аргумент отличный от аргумента по умолчанию следует за аргументом по умолчанию
sv: icke-standard argument följer standard argument

source: non-hex digit found
de_de: eine nicht-hex zahl wurde gefunden
es: digito non-hex encontrado
fil: non-hex digit nahanap
fr: chiffre non-héxadécimale trouvé
it_it: trovata cifra non esadecimale
nl: er werd een niet-hexadecimaal cijfer gevonden
pt_br: um dígito não hexadecimal foi encontrado
ru: Ненайдена шестнадцатеричная цифра
sv: icke-hexnummer hittade

source: non-keyword arg after */**
es: no deberia estar/tener agumento por palabra clave despues de */**
fil: non-keyword arg sa huli ng */**
it_it: argomento non nominato dopo */**
nl: niet-trefwoord argument na */**

source: non-keyword arg after keyword arg
es: no deberia estar/tener agumento por palabra clave despues de argumento por palabra clave
fil: non-keyword arg sa huli ng keyword arg
it_it: argomento non nominato seguito da argomento nominato
nl: niet-trefwoord argument na trefwoord argument

source: non-zero timeout must be > 0.01
de_de: Timeout ungleich Null muss > 0,01 sein
es: el tiempo de espera non-zero deber ser > 0.01
fr: le délai non-zéro doit être > 0.01
pt_br: o tempo limite não zero deve ser > 0.01
ru: Ненулевое время ожидания должно быть > 0,01
sv: Icke-noll timeout måste vara > 0.01

source: non-zero timeout must be >= interval
de_de: Timeout ungleich Null muss >= Intervall sein
es: el tiempo de espera non-zero debe ser >= intervalo
fr: le délai non-zéro doit être >= interval
pt_br: o tempo limite não zero deve ser >= intervalo
ru: Ненулевое время ожидания должно быть >= интервал
sv: Icke-noll timeout måste vara >= intervall

source: not a 128-bit UUID
de_de: keine 128-bit UUID
es: no es 128-bit UUID
fr: n'est pas un UUID 128 bits
nl: geen 128-bit UUID
pt_br: não é um UUID com 128 bits
ru: не 128-битный UUID
sv: inte en 128-bitars UUID

source: not all arguments converted during string formatting
de_de: Nicht alle Argumente wurden während der Formatierung der Zeichenfolge konvertiert
es: no todos los argumentos fueron convertidos durante el formato de string
fil: hindi lahat ng arguments na i-convert habang string formatting
fr: tous les arguments n'ont pas été convertis pendant le formatage de la chaîne
it_it: non tutti gli argomenti sono stati convertiti durante la formatazione in stringhe
nl: niet alle argumenten omgezet bij formattering van string
pt_br: nem todos os argumentos são convertidos durante a formatação da string
ru: Не все аргументы преобразуются при форматировании строки
sv: inte alla argument omvandlade under strängformatering

source: not enough arguments for format string
de_de: Nicht genügend Argumente für die Formatzeichenfolge
es: no suficientes argumentos para format string
fil: kulang sa arguments para sa format string
fr: pas assez d'arguments pour la chaîne de format
it_it: argomenti non sufficienti per la stringa di formattazione
nl: niet genoeg argumenten om string te formatteren
pt_br: argumentos insuficientes para o formato da string
ru: Недостаточно аргументов для строки форматирования
sv: inte tillräckligt med argument för formatsträng

source: number of points must be at least 2
de_de: Die Anzahl der Punkte muss mindestens 2 betragen
es: el número de puntos debe ser al menos 2
fr: le nombre de points doit être d'au moins 2
nl: aantal punten moet minimaal 2 zijn
pt_br: a quantidade dos pontos deve ser pelo menos 2
ru: Количество баллов должно быть не менее 2
sv: antal punkter måste vara minst 2

source: object
de_de: Objekt
es: objecto
fr: objet
pt_br: objeto
ru: объект
sv: objekt

source: object '%s' isn't a tuple or list
de_de: Objekt '%s' ist'kein Tupel oder Liste
es: objeto '%s' no es una tupla o lista
fr: l'objet '%s' n'est pas un tuple ou une liste
pt_br: o objeto '%s' não é uma tupla ou lista
ru: Объект "%s" не является кортежом или списком
sv: objektet '%s' är inte en tuple eller list

source: object doesn't support item assignment
de_de: Das Objekt unterstützt keine Elementzuweisung
es: el objeto no tiene capacidad de asignar item
fr: les objets ne supportent pas l'assignation des éléments
pt_br: O objeto não suporta a atribuição dos itens
ru: Объект не поддерживает назначение элементов
sv: objektet stöder inte tilldelning

source: object doesn't support item deletion
de_de: Objekt unterstützt das Löschen von Elementen nicht
es: el objeto no tiene capacidad de borrado de item
fr: l'objet ne supporte pas la suppression d'éléments
pt_br: o objeto não suporta a exclusão do item
ru: Объект не поддерживает удаление элементов
sv: objektet stöder inte borttagning

source: object has no len
de_de: Objekt hat keine len
es: el objeto no tiene longitud
fil: object walang len
fr: l'objet n'a pas de 'len'
it_it: l'oggetto non ha lunghezza
nl: object heeft geen len
pt_br: o objeto não tem len
ru: Объект не имеет объектива
sv: objektet har inte len

source: object isn't subscriptable
de_de: Objekt ist nicht subskribierbar
es: el objeto no puede retornar índice de artículos
fr: l'objet n'est pas indexable
pt_br: o objeto não é subroteirizável
ru: Объект не имеет индекса
sv: Objektet är inte prenumererbart

source: object not an iterator
de_de: Objekt ist kein Iterator
es: objeto no es un iterator
fil: object ay hindi iterator
fr: l'objet n'est pas un itérateur
it_it: l'oggetto non è un iteratore
nl: object is geen iterator
pt_br: o objeto não é um iterador
ru: объект не итератор
sv: objektet är inte en iterator

source: object not callable
de_de: Objekt nicht aufrufbar
es: objeto no puede ser llamado
fil: hindi matatawag ang object
fr: objet non appelable
nl: object niet aanroepbaar
pt_br: o objeto não é resgatável
ru: Объект не вызывается
sv: objektet är inte anropbart

source: object not in sequence
de_de: Objekt ist nicht in sequence
es: objeto no en secuencia
fil: object wala sa sequence
fr: l'objet n'est pas dans la séquence
it_it: oggetto non in sequenza
nl: object niet in volgorde (sequence)
pt_br: objeto não em seqüência
ru: объект не в последовательности
sv: objektet är inte i sekvens

source: object not iterable
de_de: Objekt nicht iterierbar
es: objeto no iterable
fil: object hindi ma i-iterable
fr: objet non itérable
it_it: oggetto non iterabile
nl: object niet itereerbaar
pt_br: objeto não iterável
ru: Объект не итерируемый
sv: objektet är inte iterable

source: object of type '%s' has no len()
de_de: Objekt vom Typ '%s' hat keine len()
es: el objeto de tipo '%s' no tiene len()
fil: object na type '%s' walang len()
fr: l'objet de type '%s' n'a pas de len()
it_it: l'oggetto di tipo '%s' non implementa len()
nl: object van type '%s' heeft geen len()
pt_br: O objeto do tipo '%s' não possui len()
ru: объект типа «%s» не имеет len()
sv: objekt av typen '%s' har ingen len()

source: object with buffer protocol required
de_de: Objekt mit Pufferprotokoll (buffer protocol) erforderlich
es: objeto con protocolo de buffer requerido
fil: object na may buffer protocol kinakailangan
fr: un objet avec un protocole de tampon est nécessaire
nl: object met buffer protocol vereist
pt_br: é necessário objeto com protocolo do buffer
ru: Объект с обязательным буферным протоколом
sv: objekt med buffertprotokoll krävs

source: odd-length string
de_de: String mit ungerader Länge
es: string de longitud impar
fr: chaîne de longueur impaire
it_it: stringa di lunghezza dispari
nl: string met oneven lengte
pt_br: sequência com comprimento ímpar
ru: Строка нечетной длины
sv: sträng har udda längd

source: offset is too large
de_de: Offset ist zu groß
es: offset es demasiado grande
fr: offset est trop large
nl: compensatie is te groot
pt_br: o offset é muito grande
ru: Смещение слишком большое
sv: offset är för stor

source: offset must be >= 0
de_de: Offset muss >= 0 sein
es: offset debe ser >= 0
fr: offset doit être >= 0
nl: compensatie moet groter of gelijk 0 zijn
pt_br: o offset deve ser >= 0
ru: Смещение должно быть >= 0
sv: offset måste vara >= 0

source: offset must be non-negative and no greater than buffer length
de_de: Offset muss nicht negativ sein und darf nicht größer als die Pufferlänge sein
es: offset debe ser non-negative y no mayo que la longitud del buffer
fr: offset ne doit pas être négatif, et pas plus grand que la taille du tampon
pt_br: o offset deve ser positivo e não maior do que o comprimento do buffer
ru: Смещение должно быть неотрицательным и не превышать длину буфера
sv: offset måste vara icke-negativt och inte längre än buffertlängd

source: offset out of bounds
es: offset fuera de límites
nl: offset buiten bereik

source: only bit_depth=16 is supported
de_de: nur eine bit_depth=16 wird unterstützt
es: solo se admite bit_depth=16
fr: seul bit_depth = 16 est pris en charge
nl: alleen bit_depth=16 wordt ondersteund
pt_br: apenas bit_depth = 16 é compatível
ru: поддерживается только бит_глубина=16
sv: bara bit_depth=16 stöds

source: only sample_rate=16000 is supported
de_de: nur eine sample_rate=16000 wird unterstützt
es: solo se admite sample_rate=16000
fr: seul sample_rate = 16000 est pris en charge
nl: alleen sample_rate=16000 wordt ondersteund
pt_br: apenas sample_rate = 16000 é compatível
ru: только образец_рейт=16000 поддерживается
sv: enbart sample_rate=16000 stöds

source: only slices with step=1 (aka None) are supported
de_de: Es werden nur Slices mit Schritt = 1 (auch bekannt als None) unterstützt
es: solo se admiten segmentos con step=1 (alias None)
fil: ang mga slices lamang na may hakbang = 1 (aka None) ang sinusuportahan
fr: seules les tranches avec 'step=1' (cad None) sont supportées
it_it: solo slice con step=1 (aka None) sono supportate
nl: alleen segmenten met step=1 (ook wel None) worden ondersteund
pt_br: apenas fatias com a etapa=1 (também conhecida como Nenhuma) são compatíveis
ru: поддерживаются только срезы с шагом = 1 (так как нет)
sv: endast segment med steg=1 (aka Ingen) stöds

source: opcode
es: código de operación
ru: код операции
sv: opkod

source: operands could not be broadcast together
de_de: Operanden konnten nicht zusammen gesendet werden
es: los operandos no se pueden transmitir juntos
fr: les opérandes ne pouvaient pas être diffusés ensemble
nl: operands konden niet samen verzonden worden
pt_br: os operandos não puderam ser transmitidos juntos
ru: Операнды не могут транслироваться вместе
sv: operander kan inte sändas tillsammans

source: operation is implemented for 1D Boolean arrays only
de_de: Operation wird nur für boolesche 1D-Arrays implementiert
es: operación solo está implementada para arrays booleanos de 1D
fr: opération implémentée que pour les matrices 1D booléennes
nl: operatie is alleen geïmplementeerd voor 1D Booleaanse arrays
pt_br: A operação é implementada apenas para matrizes booleanas 1D
ru: операция реализована только для 1D логических массивов
sv: operationen är enbart implementerad för 1D Boolean-matriser

source: operation is not implemented on ndarrays
de_de: Operation ist auf ndarrays nicht implementiert
es: la operación no está implementada para ndarrays
fr: l'opération n'est pas implémentée pour les ndarrays
nl: bewerking is voor ndarrays niet geïmplementeerd
pt_br: a operação não foi implementada nos ndarrays
ru: операция не реализована на массивах ndarrays
sv: åtgärden är inte implementerad för ndarray:er

source: operation is not supported for given type
de_de: Die Operation wird für den angegebenen Typ nicht unterstützt
es: la operación no es compatible para un tipo dado
fr: l'opération n'est pas prise en charge pour un type donné
nl: bewerking wordt niet ondersteund voor dit type
pt_br: operação não é compatível com o tipo informado
ru: Операция не поддерживается для данного типа
sv: åtgärden stöds inte för given typ

source: ord expects a character
de_de: ord erwartet ein Zeichen
es: ord espera un carácter
fil: ord umaasa ng character
fr: ord attend un caractère
it_it: ord() aspetta un carattere
nl: ord verwacht een teken (char)
pt_br: o ord espera um caractere
ru: Орд ожидает персонажа
sv: ord förväntar sig ett tecken

source: ord() expected a character, but string of length %d found
de_de: ord() erwartet einen Buchstaben(char) aber es wurde ein String mit Länge %d gefunden
es: ord() espera un carácter, pero encontró un string de longitud %d
fil: ord() umaasa ng character pero string ng %d haba ang nakita
fr: ord() attend un caractère mais une chaîne de %d caractères a été trouvée
it_it: ord() aspettava un carattere, ma ha ricevuto una stringa di lunghezza %d
nl: ord() verwacht een teken (char) maar vond een string van lengte %d
pt_br: o ord() esperava um caractere, porém a sequência do comprimento %d foi encontrada
ru: ord() ожидал символ, но строка длины %d найдена
sv: ord() förväntade sig ett tecken, men en sträng med längden %d hittades
